{"collection": "abudawud", "collectionName": "Sunan Abu Dawud", "book": 16, "bookName": "Chapter: What Has Been Reported Regarding The Obligation Of The Sacrifices", "hadiths": [{"id": 1, "hadithNumber": "2788", "text": "Narrated Mikhnaf ibn Sulaym: We were staying with the Messenger of Allah (ﷺ) at Arafat; he said: O people, every family must offer a sacrifice and an atirah. Do you know what  the atirah is? It is what you call the Rajab sacrifice. Abu Dawud said: 'Atirah has been abrogated, and this tradition is an abrogated one.", "grade": "Hasan (Al-Albani)", "narratedBy": "Narrated Mikhnaf ibn Sulaym:", "reference": "https://sunnah.com/abudawud:2788", "inBookReference": "Book 16, Hadith 1"}, {"id": 2, "hadithNumber": "2789", "text": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: I have been commanded to celebrate festival ('Id) on the day of sacrifice, which Allah, Most High, has appointed for this community. A man said: If I do not find except a she-goat or a she-camel borrowed for milk or other benefits, should I sacrifice it? He said: No, but you should clip your hair , and nails, trim your moustaches, and shave your pubes. This is all your sacrifice in the eyes of Allah, Most High.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Abdullah ibn Amr ibn al-'As:", "reference": "https://sunnah.com/abudawud:2789", "inBookReference": "Book 16, Hadith 2"}, {"id": 3, "hadithNumber": "2790", "text": "Narrated Hanash: I saw Ali sacrificing two rams; so I asked him: What is this? He replied. The Messenger of Allah (ﷺ) enjoined upon me to sacrifice on his behalf, so that is what I am doing.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Hanash:", "reference": "https://sunnah.com/abudawud:2790", "inBookReference": "Book 16, Hadith 3"}, {"id": 4, "hadithNumber": "2791", "text": "Narrated Umm Salamah: The Prophet (ﷺ) as saying: If anyone has sacrificial animal and intends to sacrifice it, and he sights the new moon of Dhul-Hajjah, he must not take any of his hair and nails until he sacrifices Abu Dawud said: The name of 'Amr b. Muslim in the chain narrated by Malik and Muhammad b. 'Amr is disputed. Some say that it is 'Umar and the majority holds that it is 'Amr. Abu Dawud said: He is 'Amr b. Muslim b. Ukaimah al-Laithi al-Jundu'i.", "grade": "Hasan Sahih (Al-Albani)", "narratedBy": "Narrated Umm Salamah:", "reference": "https://sunnah.com/abudawud:2791", "inBookReference": "Book 16, Hadith 4"}, {"id": 5, "hadithNumber": "2792", "text": "Narrated 'Aishah: The Prophet (Saws) ordered a horned ram with black legs, black belly and black round the eyes, and it was brought from him to sacrifice. He said: 'Aishah, get the knife then he said: Sharpen it with a stone. So I did. He took it, then take the ram he placed it on the ground and slaughtered it. He then said: In the name of Allah. O Allah, accept it for Muhammad, Muhammad's family and Muhammad's people. Then he sacrificed it.", "grade": "Hasan (Al-Albani)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/abudawud:2792", "inBookReference": "Book 16, Hadith 5"}, {"id": 6, "hadithNumber": "2793", "text": "Narrated Anas: The Prophet (ﷺ) sacrificed seven camels standing with his own hand, and sacrificed at Medina two horned rams which were white with black markings.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/abudawud:2793", "inBookReference": "Book 16, Hadith 6"}, {"id": 7, "hadithNumber": "2794", "text": "Narrated Anas: The Prophet (ﷺ) sacrificed two horned rams which were white with black markings, slaughtered, and uttered: \"Allah is Most Great.\" and mentioned Allah's name and placed his foot on their sides.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/abudawud:2794", "inBookReference": "Book 16, Hadith 7"}, {"id": 8, "hadithNumber": "2795", "text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) sacrificed two horned rams which were white with black markings and had been castrated. When he made them face the qiblah, he said: I have turned my face towards Him. Who created the heavens and the earth, following Abraham's religion, the true in faith, and I am not one of the polytheists. My prayer, and my service of sacrifice, my life and my death are all for Allah, the Lord of the Universe, Who has no partner. That is what I was commanded to do, and I am one of the Muslims. O Allah it comes from Thee and is given to Thee from Muhammad and his people. In the name of Allah, and Allah is Most Great. He then made sacrifice.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Jabir ibn Abdullah:", "reference": "https://sunnah.com/abudawud:2795", "inBookReference": "Book 16, Hadith 8"}, {"id": 9, "hadithNumber": "2796", "text": "Narrated AbuSa'id al-Khudri: The Messenger of Allah (ﷺ) used to sacrifice a choice, horned ram with black round the eyes, the mouth and the feet.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated AbuSa'id al-Khudri:", "reference": "https://sunnah.com/abudawud:2796", "inBookReference": "Book 16, Hadith 9"}, {"id": 10, "hadithNumber": "2797", "text": "Narrated Jabir: The Messenger of Allah (ﷺ) as saying: Sacrifice only a full-grown animal unless it is difficult for you, in which case sacrifice a lamb.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/abudawud:2797", "inBookReference": "Book 16, Hadith 10"}, {"id": 11, "hadithNumber": "2798", "text": "Narrated Zayd ibn Khalid al-Juhani: The Messenger of Allah (ﷺ) distributed sacrificial animals among his Companions. He gave me a kid (of less than a year). I took it to him and said: This is a kid. He said: Sacrifice it. so I sacrificed it.", "grade": "Hasan Sahih (Al-Albani)", "narratedBy": "Narrated Zayd ibn Khalid al-Juhani:", "reference": "https://sunnah.com/abudawud:2798", "inBookReference": "Book 16, Hadith 11"}, {"id": 12, "hadithNumber": "2799", "text": "Narrated 'Asim b. Kulaib: On the authority of his father: We were with a man from the Companions of the Prophet (ﷺ) called Mujashi' who belonged to Banu Sulaim. There was a scarcity if goats (in those days). He commanded a man to announce (among the people); so he announced that the Messenger of Allah (ﷺ) used to say: A lamb may be given as full payent for that for which has full-grown animal is payment. Abu Dawud said: His name is Mujashi' b. Mas'ud.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated 'Asim b. Kulaib:", "reference": "https://sunnah.com/abudawud:2799", "inBookReference": "Book 16, Hadith 12"}, {"id": 13, "hadithNumber": "2800", "text": "Narrated Al-Bara' bin 'Azib: The Messenger of Allah (ﷺ) delivered a sermon to us on the day of sacrifice after the prayer. He said: If anyone prays like our prayer, and sacrifices like our sacrifice, his sacrifice is all right. If anyone sacrifices before the prayer (for 'Id), that is goat meant for flesh. Abu Burdah b. Niyar stood up and said: Messenger of Allah, I swear by Allah, I sacrificed before I went for prayer. I thought it was the day of eating and drinking; so I made haste, and ate myself, and supplied flesh to my family and neighbors. The Messenger of Allah (ﷺ) said: That is a goat meant for eating flesh. He said: I have a kid (of less than a year) which is better than two goats meant for flesh. Will it be valid from me ? He said: Yes, but it will not be valid for anyone after you.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Al-Bara' bin 'Azib:", "reference": "https://sunnah.com/abudawud:2800", "inBookReference": "Book 16, Hadith 13"}, {"id": 14, "hadithNumber": "2801", "text": "Narrated Al-Bara' ibn Azib: A maternal uncle of mine called AbuBurdah sacrificed before the prayer (for 'Id). The Messenger of Allah (ﷺ) said: Your goat is meant for flesh. He said: Messenger of Allah, I have a domestic kid with me. He said: Sacrifice it, but it is not valid for any man other than you.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Al-Bara' ibn Azib:", "reference": "https://sunnah.com/abudawud:2801", "inBookReference": "Book 16, Hadith 14"}, {"id": 15, "hadithNumber": "2802", "text": "Narrated Ubayd ibn Firuz: I asked al-Bara' ibn Azib: What should be avoided in sacrificial animals? He said: The Messenger of Allah (ﷺ)  stood among us, and my fingers are smaller than his fingers, and my fingertips are smaller than his fingertips. He said (pointing with his fingers): Four (types of animals) should be avoided in sacrifice: A One-eyed animal which has obviously lost the sight of one eye, a sick animal which is obviously sick, a lame animal which obviously limps and an animal with a broken leg with no marrow. I also detest an animal which has defective teeth. He said: Leave what you detest, but do not make it illegal for anyone. Abu Dawud said: (By a lean animal mean) and animal which has no marrow.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Ubayd ibn Firuz:", "reference": "https://sunnah.com/abudawud:2802", "inBookReference": "Book 16, Hadith 15"}, {"id": 16, "hadithNumber": "2803", "text": "Narrated Yazid Dhu Misr : I came to Utbah ibn AbdusSulami and said: AbulWalid, I went out seeking sacrificial animals. I did not find anything which attracted me except an animal whose teeth have fallen. So I abominated it. What do you say (about it)? He said: Why did you not bring it to me? He said: Glory be to Allah: Is if lawful for you and not lawful for me? He said: Yes, you doubt and I do not doubt. The Messenger of Allah (ﷺ) has forbidden an animal whose ear has been uprooted so much so that its hole appears (outwardly), and an animal whose horn has broken from the root, and an animal which has totally lost the sight of its eye, and an animal which is so thin and weak that it cannot go with the herd, and an animal with a broken leg.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Yazid Dhu Misr :", "reference": "https://sunnah.com/abudawud:2803", "inBookReference": "Book 16, Hadith 16"}, {"id": 17, "hadithNumber": "2804", "text": "Narrated Ali ibn AbuTalib: The Messenger of Allah (ﷺ) enjoined upon us to pay great attention to the eye and both ears, and not to sacrifice a one-eyed animal, and an animal with a slit which leaves something hanging at the front or back of the ear, or with a lengthwise slit with a perforation in the ear. I asked AbuIshaq: Did he mention an animal with broken horns and uprooted ears? He said: No. I said: 'What is the Muqabalah ?' He replied: 'It has been cut from the back of its ear.' I said: 'What about the Sharqa'? He replied: 'The ear has been split.' I said: 'What about the Kharqa'? He replied: 'A hole is made (in its ears) as a distinguishing mark.'\"", "grade": null, "narratedBy": "Narrated Ali ibn AbuTalib:", "reference": "https://sunnah.com/abudawud:2804", "inBookReference": "Book 16, Hadith 17"}, {"id": 18, "hadithNumber": "2805", "text": "Narrated Ali ibn AbuTalib: The Prophet (ﷺ) prohibited to sacrifice an animal with a slit ear and broken horn. Abu Dawud said: The narrator Jurayy (b. Kulaib) is Sadusi, and belongs to Basrah. No one narrated traditions from him except Qatadah.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Ali ibn AbuTalib:", "reference": "https://sunnah.com/abudawud:2805", "inBookReference": "Book 16, Hadith 18"}, {"id": 19, "hadithNumber": "2806", "text": "Narrated Qatadah: I asked Sa'id b. al-Musayyab: What is meant by animal with a slit ear and broken horn ? He replied: Half and more than half.", "grade": null, "narratedBy": "Narrated Qatadah:", "reference": "https://sunnah.com/abudawud:2806", "inBookReference": "Book 16, Hadith 19"}, {"id": 20, "hadithNumber": "2807", "text": "Narrated Jabir bin ‘Abdullah : We performed tamattu' during the lifetime of the Messenger of Allah (ﷺ), sacrificed a cow for seven and a camel for seven people. We shared them.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Jabir bin ‘Abdullah :", "reference": "https://sunnah.com/abudawud:2807", "inBookReference": "Book 16, Hadith 20"}, {"id": 21, "hadithNumber": "2808", "text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) said: A cow serves for seven, and a camel serves for seven.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Jabir ibn Abdullah:", "reference": "https://sunnah.com/abudawud:2808", "inBookReference": "Book 16, Hadith 21"}, {"id": 22, "hadithNumber": "2809", "text": "Narrated Jabir ibn Abdullah: We sacrificed along with the Messenger of Allah (ﷺ) at al-Hudaybiyyah a camel for seven and a cow for seven people.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Jabir ibn Abdullah:", "reference": "https://sunnah.com/abudawud:2809", "inBookReference": "Book 16, Hadith 22"}, {"id": 23, "hadithNumber": "2810", "text": "Narrated Jabir ibn Abdullah: I witnessed sacrificing along with the Messenger of Allah (ﷺ) at the place of prayer. When he finished his sermon, he descended from his pulpit, and a ram was brought to him. The Messenger of Allah (ﷺ) slaughtered it with his hand, and said: In the name of Allah, Allah, is Most Great. This is from me and from those who did not sacrifice from my community.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Jabir ibn Abdullah:", "reference": "https://sunnah.com/abudawud:2810", "inBookReference": "Book 16, Hadith 23"}, {"id": 24, "hadithNumber": "2811", "text": "Narrated Ibn 'Umar: The Prophet (ﷺ) used to slaughter his sacrificial animal at the place of prayer. Ibn 'Umar used to do so.", "grade": null, "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/abudawud:2811", "inBookReference": "Book 16, Hadith 24"}, {"id": 25, "hadithNumber": "2812", "text": "Narrated 'Aishah: Some people of desert came at the time of sacrifice in the time of Apostle of  Allah (ﷺ). The Messenger of Allah (ﷺ) said: Store up for three days and give the rest as sadaqah (alms). After than the people said to the Messenger of Allah (ﷺ): Messenger of Allah, the people used to benefit from their sacrifices, take and dissolve fat from them, and make water-bags (from their skins). The Messenger of Allah (ﷺ) said: What is that ? or whatever he said: They said: Messenger of Allah (ﷺ), you have prohibited to preserve the meat of sacrifice after three days. The Messenger of Allah (ﷺ) said: I prohibited you due to a body of people who came to you. Now eat, give it as sadaqah (alms), and store up.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/abudawud:2812", "inBookReference": "Book 16, Hadith 25"}, {"id": 26, "hadithNumber": "2813", "text": "Narrated Nubayshah: The Prophet (ﷺ) said: We forbade you to eat their meat for more than three days in order that you  might have abundance; now Allah has produced abundance, so you may eat, store up and seek reward. Beware, these days are days of eating, drinking and remembrance of Allah, Most High.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Nubayshah:", "reference": "https://sunnah.com/abudawud:2813", "inBookReference": "Book 16, Hadith 26"}, {"id": 27, "hadithNumber": "2814", "text": "Narrated Thawban: The Messenger of Allah (ﷺ) sacrificed during a journey and then said: Thawban, mend the meat of this goat. I then kept on supplying its meat until we reached Medina.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Thawban:", "reference": "https://sunnah.com/abudawud:2814", "inBookReference": "Book 16, Hadith 27"}, {"id": 28, "hadithNumber": "2815", "text": "Narrated Shaddad b. Aws: There are two characteristics that I heard the Messenger of Allah (ﷺ) say: Allah has decreed that everything should be done in a good way, so when you kill use a good method. The version of the narrators other than Muslim says: \"So kill in a good manner.\" And when you slaughter, you should use a good method, for one of you should sharpen his knife, and give the animal as little pain as possible.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Shaddad b. Aws:", "reference": "https://sunnah.com/abudawud:2815", "inBookReference": "Book 16, Hadith 28"}, {"id": 29, "hadithNumber": "2816", "text": "Narrated Hisham b. Zaid: I entered upon al-Hakam b. Ayyub along with Anas. He saw some youths or boys who had set up a hen and shooting at it. Anas said: The Messenger of Allah (ﷺ) forbade to kill an animal in confinement.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Hisham b. Zaid:", "reference": "https://sunnah.com/abudawud:2816", "inBookReference": "Book 16, Hadith 29"}, {"id": 30, "hadithNumber": "2817", "text": "Narrated Ibn 'Abbas: The verse: \"So eat of (meats) on which Allah's name hath been pronounced\" and the verse: \"Eat not of  (meats) on which Allah's name hath not been pronounced\" were abrogated, meaning an exception was made therein by the verse: \"The food of the people of the Book is lawful unto you and yours is lawful unto them.\"", "grade": "Hasan (Al-Albani)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/abudawud:2817", "inBookReference": "Book 16, Hadith 30"}, {"id": 31, "hadithNumber": "2818", "text": "Narrated Abdullah ibn Abbas: explaining the verse \"But the evil ones ever inspire their friend to contend with you\" They used to say: Do not eat which Allah killed, but eat which you slaughtered. So Allah revealed the verse: \"Eat not of (meats) on which Allah's name hath not been pronounced\"...to the end of the verse.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Abdullah ibn Abbas:", "reference": "https://sunnah.com/abudawud:2818", "inBookReference": "Book 16, Hadith 31"}, {"id": 32, "hadithNumber": "2819", "text": "Narrated Abdullah ibn Abbas: The Jews came to the Prophet (ﷺ) and said: We eat which we kill but we do not eat which Allah kills? So Allah revealed: \"Eat not of (meats) on which Allah's name hath not been pronounced.\" to the end of the verse.", "grade": null, "narratedBy": "Narrated Abdullah ibn Abbas:", "reference": "https://sunnah.com/abudawud:2819", "inBookReference": "Book 16, Hadith 32"}, {"id": 33, "hadithNumber": "2820", "text": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) forbade to eat (the meat of animals) slaughtered by the bedouins for vainglory and pride. Abu Dawud said: The narrator Ghundar narrated this tradition as a saying of Ibn 'Abbas (and not of the Prophet).", "grade": "Hasan Sahih (Al-Albani)", "narratedBy": "Narrated Abdullah ibn Abbas:", "reference": "https://sunnah.com/abudawud:2820", "inBookReference": "Book 16, Hadith 33"}, {"id": 34, "hadithNumber": "2821", "text": "Narrated Rafi' b. Khadij: I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we shall meet the enemy tomorrow and we have no knives with us. May we kill with a sharp-edged white stone (flint) and with splinter of a staff ? The Messenger of Allah (ﷺ) said: Hasten in slaughtering it. When Allah's name is mentioned you may eat what is killed by anything which causes the blood to flow except tooth and claw. I shall tell you about it. The tooth is a bone, and the claw is the knife of Abyssinians. Some people hastened and went forward, they made haste and got booty, while the Messenger of Allah (ﷺ) was in the rear and they setup cooking pots. The Messenger of Allah (ﷺ) passed by over the cooking pots. He ordered to turn them over. He then divided (the spoils of war) between them, and gave them a camel for ten goats in equation. One of the camels of the people ran away, and they had no horses with them at that time. A man shot an arrow at it, and Allah prevented it from escaping. The Prophet (ﷺ) said: Among animals (i.e. camels) there are some which bolt like wild animals ; so when any of them does so, do with it like this.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Rafi' b. Khadij:", "reference": "https://sunnah.com/abudawud:2821", "inBookReference": "Book 16, Hadith 34"}, {"id": 35, "hadithNumber": "2822", "text": "Narrated Muhammad ibn Safwan or Safwan ibn Muhammad: I hunted two hares and slaughtered them with a flint. I asked the Messenger of Allah (ﷺ) about them. He permitted me to eat them.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Muhammad ibn Safwan or Safwan ibn Muhammad:", "reference": "https://sunnah.com/abudawud:2822", "inBookReference": "Book 16, Hadith 35"}, {"id": 36, "hadithNumber": "2823", "text": "Narrated Ata' ibn Yasar: A man of Banu Harith was pasturing a pregnant she-camel in one of the ravines of Uhud, (he saw that) it was about to die; he could find nothing to slaughter it; he took a stake and stabbed it in the upper part of its breast until he made its blood flow. He then came to the Prophet (ﷺ) and informed him about that, and he ordered him to eat it.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Ata' ibn Yasar:", "reference": "https://sunnah.com/abudawud:2823", "inBookReference": "Book 16, Hadith 36"}, {"id": 37, "hadithNumber": "2824", "text": "Narrated Adi ibn Hatim: I said: Messenger of Allah, tell me when one of us catches game and has no knife; may he slaughter with a flint and a splinter of stick. He said: Cause the blood to flow with whatever you like and mention Allah's name.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Adi ibn Hatim:", "reference": "https://sunnah.com/abudawud:2824", "inBookReference": "Book 16, Hadith 37"}, {"id": 38, "hadithNumber": "2825", "text": "Narrated AbulUshara': AbulUshara' reported on the authority of his father: He asked: Messenger of Allah, is the slaughtering to be done only in the upper part of the breast and the throat? The Messenger of Allah (ﷺ) replied: If you pierced its thigh, it would serve you. Abu Dawud said: This is the way suitable for slaughtering an animal which has fallen into a well or runs loose.", "grade": "Munkar (Al-Albani)", "narratedBy": "Narrated AbulUshara':", "reference": "https://sunnah.com/abudawud:2825", "inBookReference": "Book 16, Hadith 38"}, {"id": 39, "hadithNumber": "2826", "text": "Narrated Abdullah ibn Abbas: Ibn Isa added: (Ibn Abbas) and AbuHurayrah said: The Messenger of Allah (ﷺ) forbade the devil's sacrifice. AbuIsa added in his version: This refers to the slaughtered animal whose skin cut off, and is then left to die without its jugular veins being severed.", "grade": "Da'if (Al-Albani)", "narratedBy": "Narrated Abdullah ibn Abbas:", "reference": "https://sunnah.com/abudawud:2826", "inBookReference": "Book 16, Hadith 39"}, {"id": 40, "hadithNumber": "2827", "text": "Narrated AbuSa'id al-Khudri: I asked the Messenger of Allah (ﷺ) about the embryo. He replied: Eat it if you wish. Musaddad's version says: we said: Messenger of Allah, we slaughter a she-camel, a cow and a sheep, and we find an embryo in its womb. Shall we throw it away or eat it? He replied: Eat it if you wish for the slaughter of its mother serves its slaughter.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated AbuSa'id al-Khudri:", "reference": "https://sunnah.com/abudawud:2827", "inBookReference": "Book 16, Hadith 40"}, {"id": 41, "hadithNumber": "2828", "text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) said: The slaughter of embryo is included when its mother is slaughtered.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Jabir ibn Abdullah:", "reference": "https://sunnah.com/abudawud:2828", "inBookReference": "Book 16, Hadith 41"}, {"id": 42, "hadithNumber": "2829", "text": "Narrated 'Aishah: (the narrator Musa did not mention the words \"from 'Aishah\" in his version from Hammad, and al-Qa'nabi also did not mention the word \"from 'Aishah\" in his version from Malik). They (the people) said: Messenger of Allah, there are people here, recent converts from polytheism, who bring us meat and we do not know whether or not they mentioned Allah's name over it. The Messenger of Allah (ﷺ) said: Mention Allah's name and eat.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/abudawud:2829", "inBookReference": "Book 16, Hadith 42"}, {"id": 43, "hadithNumber": "2830", "text": "Narrated Nubayshah: A man called the Messenger of Allah (ﷺ): We used to sacrifice Atirah in pre-Islamic days during Rajab; so what do you command us? He said: Sacrifice for the sake of Allah in any month whatever; obey Allah, Most High, and feed(the people). He said: We used to sacrifice a Fara' in pre-Islamic days, so what do you command us? He said: On every pasturing animal there is a Fara' which is fed by your cattle till it becomes strong and capable of carrying load. The narrator Nasr said (in his version): When it becomes capable of carrying load of the pilgrims, you may slaughter it and give its meat as charity (sadaqah). The narrator Khalid's version says: You (may give it) to the travellers, for it is better. Khalid said: I asked AbuQilabah: How many pasturing animals? He replied: One hundred.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Nubayshah:", "reference": "https://sunnah.com/abudawud:2830", "inBookReference": "Book 16, Hadith 43"}, {"id": 44, "hadithNumber": "2831", "text": "Narrated Abu Hurairah: Prophet (ﷺ) sa saying: There is no fara' and 'atirah.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/abudawud:2831", "inBookReference": "Book 16, Hadith 44"}, {"id": 45, "hadithNumber": "2832", "text": "Narrated Sa'id: Fara' was the first animal born to them (the Arabs) which they sacrificed.", "grade": "Sahih Maqtu' (Al-Albani)", "narratedBy": "Narrated Sa'id:", "reference": "https://sunnah.com/abudawud:2832", "inBookReference": "Book 16, Hadith 45"}, {"id": 46, "hadithNumber": "2833", "text": "Narrated 'Aishah: The Messenger of Allah (ﷺ) used to sacrifice goat out of every fifty goats. Abu Dawud said: Fara' means the first baby camel born (to the Arabs). They used to sacrifice it for their idols, and then eat it, and its skin was thrown on a tree. 'Atira was a sacrifice made during the first ten days of Rajab.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/abudawud:2833", "inBookReference": "Book 16, Hadith 46"}, {"id": 47, "hadithNumber": "2834", "text": "Narrated Umm Kurz al-Ka'biyyah: I heard the Messenger of Allah (ﷺ) say: Two resembling sheep are to be sacrificed for a boy and one for a girl. AbuDawud said: I heard Ahmad (ibn Hanbal) say: The Arabic word mukafi'atani means equal (in age) or resembling each other.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Umm Kurz al-Ka'biyyah:", "reference": "https://sunnah.com/abudawud:2834", "inBookReference": "Book 16, Hadith 47"}, {"id": 48, "hadithNumber": "2835", "text": "Narrated Umm Kurz: I heard the Prophet (nay peace be upon him) say: Let the birds stay in their roosts. She said: I also heard him say: Two sheep are to be sacrificed for a boy and one for a girl, but it does you no harm whether they are male or female.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Umm Kurz:", "reference": "https://sunnah.com/abudawud:2835", "inBookReference": "Book 16, Hadith 48"}, {"id": 49, "hadithNumber": "2836", "text": "Narrated Umm Kurz: The Messenger of Allah (ﷺ) said: Two sheep which resemble each other are to be sacrificed for a boy and one for a girl. Abu Dawud said: This is a sound tradition, and the tradition narrated by Sufyan is misunderstanding.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Umm Kurz:", "reference": "https://sunnah.com/abudawud:2836", "inBookReference": "Book 16, Hadith 49"}, {"id": 50, "hadithNumber": "2837", "text": "Narrated Samurah ibn Jundub: The Prophet (ﷺ) said: A boy is in pledge for his Aqiqah. Sacrifice is made for him on the seventh day, his head is shaved and is smeared with blood. When Qatadah was asked about smearing with blood, how that should be done, he said: When you cut the head (i.e. throat) of the animal (meant for Aqiqah), you may take a few hair of it, place them on its veins, and then place them in the middle of the head of the infant, so that the blood flows on the hair (of the infant) like a threat. Then its head may be washed and shaved off. Abu Dawud said: In narrating the word \"is smeared with blood\" (yudamma) there is a misunderstanding on the part of Hammam. Abu Dawud said: Hammam has been opposed in narrating the words \"is smeared with blood\". This is misunderstanding of Hammam. They narrated he word \"he is given a name (yusamma) and Hammam narrated it \"is smeared with blood\" (yudamma). Abu Dawud said: This tradition is not followed.", "grade": null, "narratedBy": "Narrated Samurah ibn Jundub:", "reference": "https://sunnah.com/abudawud:2837", "inBookReference": "Book 16, Hadith 50"}, {"id": 51, "hadithNumber": "2838", "text": "Narrated Samurah ibn Jundub: The Prophet (ﷺ) said: A boy is in pledge for his Aqiqah, Sacrifice is made for him on the seventh day, his head is shaved and he is given name. Abu Dawud said: The word wa yusamma is sounder as narrated by Salam b. Abi Muti' from Qatadah, and narrated by Iyas b. Daghfal and Ash'ath from al-Hassan who narrated wa yusamma (and he is given a name).", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Samurah ibn Jundub:", "reference": "https://sunnah.com/abudawud:2838", "inBookReference": "Book 16, Hadith 51"}, {"id": 52, "hadithNumber": "2839", "text": "Narrated Salman b. 'Amir al-Dabbi: The Messenger of Allah (ﷺ) as saying: Along with a boy there is an 'Aqiqah, so shed blood on his behalf, and remove injury from him.", "grade": "Sahih (Al-Albani)", "narratedBy": "Narrated Salman b. 'Amir al-Dabbi:", "reference": "https://sunnah.com/abudawud:2839", "inBookReference": "Book 16, Hadith 52"}, {"id": 53, "hadithNumber": "2840", "text": "Narrated Al-Hasan: To remove the injury is the shaving of the head.", "grade": "Sahih Maqtu' (Al-Albani)", "narratedBy": "Narrated Al-Hasan:", "reference": "https://sunnah.com/abudawud:2840", "inBookReference": "Book 16, Hadith 53"}, {"id": 54, "hadithNumber": "2841", "text": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) sacrificed a ram for both al-Hasan and al-Husayn each (Allah be pleased with them).", "grade": null, "narratedBy": "Narrated Abdullah ibn Abbas:", "reference": "https://sunnah.com/abudawud:2841", "inBookReference": "Book 16, Hadith 54"}, {"id": 55, "hadithNumber": "2842", "text": "Narrated 'Amr b. Suh'aib: On his father's authority, said that his grandfather that the Messenger of Allah (ﷺ) was asked  about the aqiqah. He replied: Allah does not like the breaking of ties (uquq), as though he disliked the name. And he said: If anyone has a child born to him and wishes to offer a sacrifice on its behalf, he may offer two resembling sheep for a boy and one for a girl. And he was asked about fara'. He replied: Fara' is right. If you leave it (i.e. let it grow till it becomes a healthy camel of one year or two years, then you give it to a widow or give it in the path of Allah for using it as a riding beast, it is better than slaughtering it at the age when its meat is stuck to its hair, and you turn over your milking vessel and annoy your she-camel.", "grade": "Hasan (Al-Albani)", "narratedBy": "Narrated 'Amr b. Suh'aib:", "reference": "https://sunnah.com/abudawud:2842", "inBookReference": "Book 16, Hadith 55"}, {"id": 56, "hadithNumber": "2843", "text": "Narrated Buraydah ibn al-Hasib: When a boy was born to one of us in the pre-Islamic period, we sacrificed a sheep and smeared his head with its blood; but when Allah brought Islam, we sacrificed a sheep, shaved his head and smeared his head with saffron.", "grade": "Hasan Sahih (Al-Albani)", "narratedBy": "Narrated Buraydah ibn al-Hasib:", "reference": "https://sunnah.com/abudawud:2843", "inBookReference": "Book 16, Hadith 56"}]}