{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 8, "bookName": "Chapter: How As-Salat (the Prayer) was prescribed on the night of Al-Isra (miraculous night journey) of the Prophet (pbuh) to Jerusalem (and then to the heavens)", "hadiths": [{"id": 1, "hadithNumber": "349", "text": "Narrated Abu Dhar: Allah's Messenger (ﷺ) said, \"While I was at Mecca the roof of my house was opened and Gabriel descended, \nopened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom \nand faith and having poured its contents into my chest, he closed it. Then he took my hand and \nascended with me to the nearest heaven, when I reached the nearest heaven, Gabriel said to the \ngatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'Who is it?' Gabriel answered: \n'Gabriel.' He asked, 'Is there anyone with you?' Gabriel replied, 'Yes, Muhammad I is with me.' He \nasked, 'Has he been called?' Gabriel said, 'Yes.' So the gate was opened and we went over the nearest \nheaven and there we saw a man sitting with some people on his right and some on his left. When he \nlooked towards his right, he laughed and when he looked toward his left he wept. Then he said, \n'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' He replied, 'He is Adam and \nthe people on his right and left are the souls of his offspring. Those on his right are the people of \nParadise and those on his left are the people of Hell and when he looks towards his right he laughs and \nwhen he looks towards his left he weeps.' \nThen he ascended with me till he reached the second heaven and he (Gabriel) said to its gatekeeper, \n'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven had said \nand he opened the gate. Anas said: \"Abu Dhar added that the Prophet (ﷺ) met Adam, Idris, Moses, Jesus \nand Abraham, he (Abu Dhar) did not mention on which heaven they were but he mentioned that he \n(the Prophet (ﷺ) ) met Adam on the nearest heaven and Abraham on the sixth heaven. Anas said, \"When \nGabriel along with the Prophet (ﷺ) passed by Idris, the latter said, 'Welcome! O pious Prophet and pious \nbrother.' The Prophet (ﷺ) asked, 'Who is he?' Gabriel replied, 'He is Idris.\" The Prophet (ﷺ) added, \"I passed \nby Moses and he said, 'Welcome! O pious Prophet and pious brother.' I asked Gabriel, 'Who is he?' \nGabriel replied, 'He is Moses.' Then I passed by Jesus and he said, 'Welcome! O pious brother and \npious Prophet.' I asked, 'Who is he?' Gabriel replied, 'He is Jesus. \nThen I passed by Abraham and he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, \n'Who is he?' Gabriel replied, 'He is Abraham. The Prophet (ﷺ) added, 'Then Gabriel ascended with me to a \nplace where I heard the creaking of the pens.\" Ibn Hazm and Anas bin Malik said: The Prophet (ﷺ) said, \n\"Then Allah enjoined fifty prayers on my followers when I returned with this order of Allah, I passed \nby Moses who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined \nfifty prayers on them.' Moses said, 'Go back to your Lord (and appeal for reduction) for your followers \nwill not be able to bear it.' (So I went back to Allah and requested for reduction) and He reduced it to \nhalf. When I passed by Moses again and informed him about it, he said, 'Go back to your Lord as your \nfollowers will not be able to bear it.' So I returned to Allah and requested for further reduction and \nhalf of it was reduced. I again passed by Moses and he said to me: 'Return to your Lord, for your \nfollowers will not be able to bear it. So I returned to Allah and He said, 'These are five prayers and \nthey are all (equal to) fifty (in reward) for My Word does not change.' I returned to Moses and he told \nme to go back once again. I replied, 'Now I feel shy of asking my Lord again.' Then Gabriel took me \ntill we '' reached Sidrat-il-Muntaha (Lote tree of; the utmost boundary) which was shrouded in colors, \nindescribable. Then I was admitted into Paradise where I found small (tents or) walls (made) of pearls \nand its earth was of musk.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Dhar:", "reference": "https://sunnah.com/bukhari:349", "inBookReference": "Book 8, Hadith 1"}, {"id": 2, "hadithNumber": "350", "text": "Narrated `Aisha: the mother of believers: Allah enjoined the prayer when He enjoined it, it was two rak`at only (in \nevery prayer) both when in residence or on journey. Then the prayers offered on journey remained the \nsame, but (the rak`at of) the prayers for non-travelers were increased.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:350", "inBookReference": "Book 8, Hadith 2"}, {"id": 3, "hadithNumber": "351", "text": "Narrated Um `Atiya: We were ordered to bring out our menstruating women and veiled women in the religious gatherings \nand invocation of Muslims on the two `Id festivals. These menstruating women were to keep away \nfrom their Musalla. A woman asked, \"O Allah's Messenger (ﷺ) ' What about one who does not have a veil?\" \nHe said, \"Let her share the veil of her companion.\"", "grade": "Sahih", "narratedBy": "Narrated Um `Atiya:", "reference": "https://sunnah.com/bukhari:351", "inBookReference": "Book 8, Hadith 3"}, {"id": 4, "hadithNumber": "352", "text": "Narrated Muhammad bin Al-Munkadir: Once Jabir prayed with his Izar tied to his back while his clothes were Lying beside him on a wooden \npeg. Somebody asked him, \"Do you offer your prayer in a single Izar?\" He replied, \"I did so to show it \nto a fool like you. Had anyone of us two garments in the lifetime of the Prophet?\"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin Al-Munkadir:", "reference": "https://sunnah.com/bukhari:352", "inBookReference": "Book 8, Hadith 4"}, {"id": 5, "hadithNumber": "353", "text": "Narrated Muhammad bin Al Munkadir: I saw Jabir bin `Abdullah praying in a single garment and he said that he had seen the Prophet (ﷺ) praying \nin a single garment.", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin Al Munkadir:", "reference": "https://sunnah.com/bukhari:353", "inBookReference": "Book 8, Hadith 5"}, {"id": 6, "hadithNumber": "354", "text": "Narrated `Umar bin Abi Salama: The Prophet (ﷺ) prayed in one garment and crossed its ends.", "grade": "Sahih", "narratedBy": "Narrated `Umar bin Abi Salama:", "reference": "https://sunnah.com/bukhari:354", "inBookReference": "Book 8, Hadith 6"}, {"id": 7, "hadithNumber": "355", "text": "Narrated `Umar bin Abi Salama: I saw the Prophet (ﷺ) offering prayers in a single garment in the house of Um-Salama and he had crossed \nits ends around his shoulders.", "grade": "Sahih", "narratedBy": "Narrated `Umar bin Abi Salama:", "reference": "https://sunnah.com/bukhari:355", "inBookReference": "Book 8, Hadith 7"}, {"id": 8, "hadithNumber": "356", "text": "Narrated `Umar bin Abi Salama: In the house of Um-Salama I saw Allah's Messenger (ﷺ) offering prayers, wrapped in a single garment \naround his body with its ends crossed round his shoulders.", "grade": "Sahih", "narratedBy": "Narrated `Umar bin Abi Salama:", "reference": "https://sunnah.com/bukhari:356", "inBookReference": "Book 8, Hadith 8"}, {"id": 9, "hadithNumber": "357", "text": "Narrated Abu Murra: (the freed slave of Um Hani) Um Hani, the daughter of Abi Talib said, \"I went to Allah's Messenger (ﷺ) in \nthe year of the conquest of Mecca and found him taking a bath and his daughter Fatima was screening \nhim. I greeted him. He asked, 'Who is she?' I replied, 'I am Um Hani bint Abi Talib.' He said, \n'Welcome! O Um Hani.' When he finished his bath he stood up and prayed eight rak`at while wearing \na single garment wrapped round his body and when he finished I said, 'O Allah's Messenger (ﷺ) ! My brother \nhas told me that he will kill a person whom I gave shelter and that person is so and so the son of \nHubaira.' The Prophet (ﷺ) said, 'We shelter the person whom you have sheltered.' \" Um Hani added, \"And \nthat was before noon (Duha).", "grade": "Sahih", "narratedBy": "Narrated Abu Murra:", "reference": "https://sunnah.com/bukhari:357", "inBookReference": "Book 8, Hadith 9"}, {"id": 10, "hadithNumber": "358", "text": "Narrated Abu Huraira: A person asked Allah's Messenger (ﷺ) about the offering of the prayer in a single garment. Allah's Messenger (ﷺ) \nreplied, \"Has every one of you got two garments?\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:358", "inBookReference": "Book 8, Hadith 10"}, {"id": 11, "hadithNumber": "359", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"None of you should offer prayer in a single garment that does not cover the \nshoulders.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:359", "inBookReference": "Book 8, Hadith 11"}, {"id": 12, "hadithNumber": "360", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Whoever prays in a single garment must cross its ends (over the shoulders).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:360", "inBookReference": "Book 8, Hadith 12"}, {"id": 13, "hadithNumber": "361", "text": "Narrated Sa`id bin Al-Harith: I asked Jabir bin `Abdullah about praying in a single garment. He said, \"I traveled with the Prophet (ﷺ) \nduring some of his journeys, and I came to him at night for some purpose and I found him praying. At \nthat time, I was wearing a single garment with which I covered my shoulders and prayed by his side. \nWhen he finished the prayer, he asked, 'O Jabir! What has brought you here?' I told him what I \nwanted. When I finished, he asked, 'O Jabir! What is this garment which I have seen and with which \nyou covered your shoulders?' I replied, 'It is a (tight) garment.' He said, 'If the garment is large \nenough, wrap it round the body (covering the shoulders) and if it is tight (too short) then use it as an \nIzar (tie it around your waist only.)' \"", "grade": "Sahih", "narratedBy": "Narrated Sa`id bin Al-Harith:", "reference": "https://sunnah.com/bukhari:361", "inBookReference": "Book 8, Hadith 13"}, {"id": 14, "hadithNumber": "362", "text": "Narrated Sahl: The men used to pray with the Prophet (ﷺ) with their Izars tied around their necks as boys used to do; \ntherefore the Prophet (ﷺ) told the women not to raise their heads till the men sat down straight (while \npraying).", "grade": "Sahih", "narratedBy": "Narrated Sahl:", "reference": "https://sunnah.com/bukhari:362", "inBookReference": "Book 8, Hadith 14"}, {"id": 15, "hadithNumber": "363", "text": "Narrated Mughira bin Shu`ba: Once I was traveling with the Prophet (ﷺ) and he said, \"O Mughira! take this container of water.\" I took it \nand Allah's Messenger (ﷺ) went far away till he disappeared. He answered the call of nature and was wearing \na Syrian cloak. He tried to take out his hands from its sleeve but it was very tight so he took out his \nhands from under it. I poured water and he performed ablution like that for prayers and passed his wet \nhands over his Khuff (socks made from thick fabric or leather) and then prayed .", "grade": "Sahih", "narratedBy": "Narrated Mughira bin Shu`ba:", "reference": "https://sunnah.com/bukhari:363", "inBookReference": "Book 8, Hadith 15"}, {"id": 16, "hadithNumber": "364", "text": "Narrated Jabir bin `Abdullah: While Allah's Messenger (ﷺ) was carrying stones (along) with the people of Mecca for (the building of) the \nKa`ba wearing an Izar (waist-sheet cover), his uncle Al-`Abbas said to him, \"O my nephew! (It would \nbe better) if you take off your Izar and put it over your shoulders underneath the stones.\" So he took \noff his Izar and put it over his shoulders, but he fell unconscious and since then he had never been \nseen naked.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:364", "inBookReference": "Book 8, Hadith 16"}, {"id": 17, "hadithNumber": "365", "text": "Narrated Abu Huraira: A man stood up and asked the Prophet (ﷺ) about praying in a single garment. The Prophet (ﷺ) said, \"Has \nevery one of you two garments?\" A man put a similar question to `Umar on which he replied, \"When \nAllah makes you wealthier then you should clothe yourself properly during prayers. Otherwise one \ncan pray with an Izar and a Rida' (a sheet covering the upper part of the body.) Izar and a shirt, Izar \nand a Qaba', trousers and a Rida, trousers and a shirt or trousers and a Qaba', Tubban and a Qaba' or \nTubban and a shirt.\" (The narrator added, \"I think that he also said a Tubban and a Rida. \")", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:365", "inBookReference": "Book 8, Hadith 17"}, {"id": 18, "hadithNumber": "366", "text": "Narrated Ibn `Umar: A person asked Allah's Messenger (ﷺ), \"What should a Muhrim wear?\" He replied, \"He should not wear \nshirts, trousers, a burnus (a hooded cloak), or clothes which are stained with saffron or Wars (a kind of \nperfume). Whoever does not find a sandal to wear can wear Khuffs (socks made from thick fabric or \nleather), but these should be cut short so as not to cover the ankles.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:366", "inBookReference": "Book 8, Hadith 18"}, {"id": 19, "hadithNumber": "367", "text": "Narrated Abu Sa`id Al-Khudri: Allah's Messenger (ﷺ) forbade Ishtimal-As-Samma' (wrapping one's body with a garment so that one cannot \nraise its end or take one's hand out of it). He also forbade Al-Ihtiba' (sitting on buttocks with knees \nclose to `Abdomen and feet apart with the hands circling the knees) while wrapping oneself with a \nsingle garment, without having a part of it over the private parts.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:367", "inBookReference": "Book 8, Hadith 19"}, {"id": 20, "hadithNumber": "368", "text": "Narrated Abu Huraira: The Prophet (ﷺ) forbade two kinds of sales i.e. Al-Limais and An-Nibadh (the former is a kind of sale in \nwhich the deal is completed if the buyer touches a thing, without seeing or checking it properly and \nthe latter is a kind of a sale in which the deal is completed when the seller throws a thing towards the \nbuyer giving him no opportunity to see, touch or check it) and (the Prophet (ﷺ) forbade) also Ishtimal-As- \nSamma' and Al-Ihtiba' in a single garment.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:368", "inBookReference": "Book 8, Hadith 20"}, {"id": 21, "hadithNumber": "369", "text": "Narrated Abu Huraira: On the Day of Nahr (10th of Dhul-Hijja, in the year prior to the last Hajj of the Prophet (ﷺ) when Abu \r\nBakr was the leader of the pilgrims in that Hajj) Abu Bakr sent me along with other announcers to \r\nMina to make a public announcement: \"No pagan is allowed to perform Hajj after this year and no \r\nnaked person is allowed to perform the Tawaf around the Ka`ba. Then Allah's Messenger (ﷺ) sent `Ali to \r\nread out the Surat Bara'a (at-Tauba) to the people; so he made the announcement along with us on the \r\nday of Nahr in Mina: \"No pagan is allowed to perform Hajj after this year and no naked person is \r\nallowed to perform the Tawaf around the Ka`ba.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:369", "inBookReference": "Book 8, Hadith 21"}, {"id": 22, "hadithNumber": "370", "text": "Narrated Muhammad bin Al-Munkadir: I went to Jabir bin `Abdullah and he was praying wrapped in a garment and his Rida was Lying beside \nhim. When he finished the prayers, I said \"O `Abdullah! You pray (in a single garment) while your \nRida' is lying beside you.\" He replied, \"Yes, I did it intentionally so that the ignorant ones like you \nmight see me. I saw the Prophet (ﷺ) praying like this. \"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin Al-Munkadir:", "reference": "https://sunnah.com/bukhari:370", "inBookReference": "Book 8, Hadith 22"}, {"id": 23, "hadithNumber": "371", "text": "Narrated `Abdul `Aziz: Anas said, 'When Allah's Messenger (ﷺ) invaded Khaibar, we offered the Fajr prayer there (early in the \r\nmorning) when it was still dark. The Prophet (ﷺ) rode and Abu Talha rode too and I was riding behind \r\nAbu Talha. The Prophet (ﷺ) passed through the lane of Khaibar quickly and my knee was touching the \r\nthigh of the Prophet (ﷺ) . He uncovered his thigh and I saw the whiteness of the thigh of the Prophet. \r\nWhen he entered the town, he said, 'Allahu Akbar! Khaibar is ruined. Whenever we approach near a \r\n(hostile) nation (to fight) then evil will be the morning of those who have been warned.' He repeated \r\nthis thrice. The people came out for their jobs and some of them said, 'Muhammad (has come).' (Some \r\nof our companions added, \"With his army.\") We conquered Khaibar, took the captives, and the booty \r\nwas collected. Dihya came and said, 'O Allah's Prophet! Give me a slave girl from the captives.' The \r\nProphet said, 'Go and take any slave girl.' He took Safiya bint Huyai. A man came to the Prophet (ﷺ) and \r\nsaid, 'O Allah's Messenger (ﷺ)s! You gave Safiya bint Huyai to Dihya and she is the chief mistress of the \r\ntribes of Quraidha and An-Nadir and she befits none but you.' So the Prophet (ﷺ) said, 'Bring him along \r\nwith her.' So Dihya came with her and when the Prophet (ﷺ) saw her, he said to Dihya, 'Take any slave \r\ngirl other than her from the captives.' Anas added: The Prophet (ﷺ) then manumitted her and married her.\" \r\nThabit asked Anas, \"O Abu Hamza! What did the Prophet (ﷺ) pay her (as Mahr)?\" He said, \"Her self was \r\nher Mahr for he manumitted her and then married her.\" Anas added, \"While on the way, Um Sulaim \r\ndressed her for marriage (ceremony) and at night she sent her as a bride to the Prophet (ﷺ) . So the \r\nProphet was a bridegroom and he said, 'Whoever has anything (food) should bring it.' He spread out a \r\nleather sheet (for the food) and some brought dates and others cooking butter. (I think he (Anas) \r\nmentioned As-Sawaq). So they prepared a dish of Hais (a kind of meal). And that was Walima (the \r\nmarriage banquet) of Allah's Messenger (ﷺ) .\"", "grade": "Sahih", "narratedBy": "Narrated `Abdul `Aziz:", "reference": "https://sunnah.com/bukhari:371", "inBookReference": "Book 8, Hadith 23"}, {"id": 24, "hadithNumber": "372", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) used to offer the Fajr prayer and some believing women covered with their veiling \nsheets used to attend the Fajr prayer with him and then they would return to their homes unrecognized \n.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:372", "inBookReference": "Book 8, Hadith 24"}, {"id": 25, "hadithNumber": "373", "text": "Narrated `Aisha: the Prophet (ﷺ) prayed in a Khamisa (a square garment) having marks. During the prayer, he looked at its \nmarks. So when he finished the prayer he said, \"Take this Khamisa of mine to Abu Jahm and get me \nhis Inbijaniya (a woolen garment without marks) as it (the Khamisa) has diverted my attention from \nthe prayer.\" Narrated `Aisha: The Prophet (ﷺ) said, 'I was looking at its (Khamisa's) marks during the prayers and I was afraid that it \nmay put me in trial (by taking away my attention).", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:373", "inBookReference": "Book 8, Hadith 25"}, {"id": 26, "hadithNumber": "374", "text": "Narrated Anas: `Aisha had a Qiram (a thin marked woolen curtain) with which she had screened one side of her home. \nThe Prophet (ﷺ) said, \"Take away this Qiram of yours, as its pictures are still displayed in front of me \nduring my prayer (i.e. they divert my attention from the prayer).", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:374", "inBookReference": "Book 8, Hadith 26"}, {"id": 27, "hadithNumber": "375", "text": "Narrated `Uqba bin 'Amir: The Prophet (ﷺ) was given a silken Farruj [??] as a present. He wore it while praying. When he had \nfinished his prayer, he took it off violently as if with a strong aversion to it and said, \"It is not the \ndress of Allah-fearing pious people.\"", "grade": "Sahih", "narratedBy": "Narrated `Uqba bin 'Amir:", "reference": "https://sunnah.com/bukhari:375", "inBookReference": "Book 8, Hadith 27"}, {"id": 28, "hadithNumber": "376", "text": "Narrated Abu Juhaifa: I saw Allah's Messenger (ﷺ) in a red leather tent and I saw Bilal taking the remaining water with which the \nProphet had performed ablution. I saw the people taking the utilized water impatiently and whoever \ngot some of it rubbed it on his body and those who could not get any took the moisture from the \nothers' hands. Then I saw Bilal carrying a short spear (or stick) which he planted in the ground. The \nProphet came out tucking up his red cloak, and led the people in prayer and offered two rak`at (facing \nthe Ka`ba) taking a short spear (or stick) as a Sutra for his prayer. I saw the people and animals \npassing in front of him beyond the stick.", "grade": "Sahih", "narratedBy": "Narrated Abu Juhaifa:", "reference": "https://sunnah.com/bukhari:376", "inBookReference": "Book 8, Hadith 28"}, {"id": 29, "hadithNumber": "377", "text": "Narrated Abu Hazim: Sahl bin Sa`d was asked about the (Prophet's) pulpit as to what thing it was made of? Sahl replied: \n\"None remains alive amongst the people, who knows about it better than I. It was made of tamarisk \n(wood) of the forest. So and so, the slave of so and so prepared it for Allah's Messenger (ﷺ) . When it was \nconstructed and place (in the Mosque), Allah's Messenger (ﷺ) stood on it facing the Qibla and said 'Allahu \nAkbar', and the people stood behind him (and led the people in prayer). He recited and bowed and the \npeople bowed behind him. Then he raised his head and stepped back, got down and prostrated on the \nground and then he again ascended the pulpit, recited, bowed, raised his head and stepped back, got \ndown and prostrate on the ground. So, this is what I know about the pulpit.\" \nAhmad bin Hanbal said, \"As the Prophet (ﷺ) was at a higher level than the people, there is no harm \naccording to the above-mentioned Hadith if the Imam is at a higher level than his followers during the \nprayers.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Hazim:", "reference": "https://sunnah.com/bukhari:377", "inBookReference": "Book 8, Hadith 29"}, {"id": 30, "hadithNumber": "378", "text": "Narrated Anas bin Malik: Once Allah's Messenger (ﷺ) fell off a horse and his leg or shoulder got injured. He swore that he would not \ngo to his wives for one month and he stayed in a Mashruba [??] (attic room) having stairs made of \ndate palm trunks. So his companions came to visit him, and he led them in prayer sitting, whereas his \ncompanions were standing. When he finished the prayer, he said, \"Imam is meant to be followed, so \nwhen he says 'Allahu Akbar,' say 'Allahu Akbar' and when he bows, bow and when he prostrates, \nprostrate and if he prays standing pray, standing. After the 29th day the Prophet (ﷺ) came down (from the \nattic room) and the people asked him, \"O Allah's Messenger (ﷺ)! You swore that you will not go to your \nwives for one month.\" He said, \"The month is 29 days.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:378", "inBookReference": "Book 8, Hadith 30"}, {"id": 31, "hadithNumber": "379", "text": "Narrates `Abdullah bin Shaddad: Maimuna said, \"Allah's Messenger (ﷺ) was praying while I was in my menses, sitting beside him and \nsometimes his clothes would touch me during his prostration.\" Maimuna added, \"He prayed on a \nKhumra (a small mat sufficient just for the face and the hands while prostrating during prayers).", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:379", "inBookReference": "Book 8, Hadith 31"}, {"id": 32, "hadithNumber": "380", "text": "Narrated 'Is-haq: Anas bin Malik said, \"My grandmother Mulaika invited Allah's Messenger (ﷺ) for a meal which she herself \nhad prepared. He ate from it and said, 'Get up! I will lead you in the prayer.' \" Anas added, \"I took my \nHasir, washed it with water as it had become dark because of long use and Allah's Messenger (ﷺ) stood on it. \nThe orphan (Damira or Ruh) and I aligned behind him and the old lady (Mulaika) stood behind us. \nAllah's Messenger (ﷺ) led us in the prayer and offered two rak`at and then left.\"", "grade": "Sahih", "narratedBy": "Narrated 'Is-haq:", "reference": "https://sunnah.com/bukhari:380", "inBookReference": "Book 8, Hadith 32"}, {"id": 33, "hadithNumber": "381", "text": "Narrated Maimuna: Allah's Messenger (ﷺ) used to pray on Khumra.", "grade": "Sahih", "narratedBy": "Narrated Maimuna:", "reference": "https://sunnah.com/bukhari:381", "inBookReference": "Book 8, Hadith 33"}, {"id": 34, "hadithNumber": "382", "text": "Narrated Abu Salama: `Aisha the wife of the Prophet (ﷺ) said, \"I used to sleep in front o Allah's Messenger (ﷺ) and my legs were \nopposite his Qibla and in prostration he pushed my legs and I withdrew then and when he stood, I \nstretched them.' `Aisha added, \"In those days the houses were without lights.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Salama:", "reference": "https://sunnah.com/bukhari:382", "inBookReference": "Book 8, Hadith 34"}, {"id": 35, "hadithNumber": "383", "text": "Narrated `Aisha: Allah Apostle prayed while I was lying like a dead body on his family bed between him and his Qibla.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:383", "inBookReference": "Book 8, Hadith 35"}, {"id": 36, "hadithNumber": "384", "text": "Narrated `Urwa: The Prophet (ﷺ) prayed while `Aisha was lying between him and his Qibla on the bed on which they used \nto sleep.", "grade": "Sahih", "narratedBy": "Narrated `Urwa:", "reference": "https://sunnah.com/bukhari:384", "inBookReference": "Book 8, Hadith 36"}, {"id": 37, "hadithNumber": "385", "text": "Narrated Anas bin Malik: We used to pray with the Prophet (ﷺ) and some of us used to place the ends of their clothes at the place of \nprostration because of scorching heat.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:385", "inBookReference": "Book 8, Hadith 37"}, {"id": 38, "hadithNumber": "386", "text": "Narrated Abu Maslama: Sa`id bin Yazid Al-Azdi: I asked Anas bin Malik whether the Prophet (ﷺ) had ever, prayed with his shoes \non. He replied \"Yes.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Maslama:", "reference": "https://sunnah.com/bukhari:386", "inBookReference": "Book 8, Hadith 38"}, {"id": 39, "hadithNumber": "387", "text": "Narrated Ibrahim: Hammam bin Al-Harith said, \"I saw Jarir bin `Abdullah urinating. Then he performed ablution and \npassed his (wet) hands over his Khuffs (socks made from thick fabric or leather), stood up and prayed. \nHe was asked about it. He replied that he had seen the Prophet (ﷺ) doing the same.\" They approved of this \nnarration as Jarir was one of those who embraced Islam very late.", "grade": "Sahih", "narratedBy": "Narrated Ibrahim:", "reference": "https://sunnah.com/bukhari:387", "inBookReference": "Book 8, Hadith 39"}, {"id": 40, "hadithNumber": "388", "text": "Narrated Al-Mughira bin Shu'ba: I helped the Prophet (ﷺ) in performing ablution and he passed his wet \n     hands over his Khuffs and prayed.", "grade": "Sahih", "narratedBy": "Narrated Al-Mughira bin Shu'ba:", "reference": "https://sunnah.com/bukhari:388", "inBookReference": "Book 8, Hadith 40"}, {"id": 41, "hadithNumber": "389", "text": "Narrated Hudhaifa that he saw a person bowing and prostrating imperfectly. When he finished his Salat, Hudhaifa told him that he had not offered Salat. The subnarrator added, \"I think that Hudhaifa also said: Were you to die you would die on a \"Sunna\" (legal way) other than that of Muhammad (ﷺ).\"", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:389", "inBookReference": "Book 8, Hadith 41"}, {"id": 42, "hadithNumber": "390", "text": "Narrated 'Abdullah bin Malik: Ibn Buhaina, \"When the Prophet (ﷺ) prayed, he used to separate his arms \n     from his body so widely that the whiteness of his armpits was \n     visible.\"", "grade": "Sahih", "narratedBy": "Narrated 'Abdullah bin Malik:", "reference": "https://sunnah.com/bukhari:390", "inBookReference": "Book 8, Hadith 42"}, {"id": 43, "hadithNumber": "391", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) said, \"Whoever prays like us and faces our Qibla and eats our slaughtered animals is a \nMuslim and is under Allah's and His Apostle's protection. So do not betray Allah by betraying those \nwho are in His protection.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:391", "inBookReference": "Book 8, Hadith 43"}, {"id": 44, "hadithNumber": "392", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) said, \"I have been ordered to fight the people till they say: 'None has the right to be \nworshipped but Allah.' And if they say so, pray like our prayers, face our Qibla and slaughter as we \nslaughter, then their blood and property will be sacred to us and we will not interfere with them except \nlegally and their reckoning will be with Allah.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:392", "inBookReference": "Book 8, Hadith 44"}, {"id": 45, "hadithNumber": "393", "text": "Narrated Maimun bin Siyah that he asked Anas bin \nMalik, \"O Abu Hamza! What makes the life and property of a person sacred?\" He replied, \"Whoever \nsays, 'None has the right to be worshipped but Allah', faces our Qibla during the prayers, prays like us \nand eats our slaughtered animal, then he is a Muslim, and has got the same rights and obligations as \nother Muslims have.\"", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:393", "inBookReference": "Book 8, Hadith 45"}, {"id": 46, "hadithNumber": "394", "text": "Narrated Abu Aiyub Al-Ansari: The Prophet (ﷺ) said, \"While defecating, neither face nor turn your back to the Qibla but face either east \nor west.\" Abu Aiyub added. \"When we arrived in Sham we came across some lavatories facing the \nQibla; therefore we turned ourselves while using them and asked for Allah's forgiveness.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Aiyub Al-Ansari:", "reference": "https://sunnah.com/bukhari:394", "inBookReference": "Book 8, Hadith 46"}, {"id": 47, "hadithNumber": "395", "text": "Narrated `Amr bin Dinar: I asked Ibn `Umar, \"Can a person who has performed the Tawaf around the Ka`ba for `Umra but has \nnot performed the (Sa`i) Tawaf of Safa and Marwa, have a sexual relation with his wife?\" Ibn `Umar \nreplied \"When the Prophet (ﷺ) reached Mecca he performed the Tawaf around the Ka`ba \n(circumambulated it seven times) and offered a two-rak`at prayer (at the place) behind the station (of \nAbraham) and then performed the Tawaf (Sa`i) of Safa and Marwa, and verily in Allah's Messenger (ﷺ) you \nhave a good example.\" Then we put the same question to Jabir bin `Abdullah and he too replied, \"He \nshould not go near his wife (for sexual relation) till he has finished the Tawaf of Safa and Marwa.\"", "grade": "Sahih", "narratedBy": "Narrated `Amr bin Dinar:", "reference": "https://sunnah.com/bukhari:395", "inBookReference": "Book 8, Hadith 47"}, {"id": 48, "hadithNumber": "397", "text": "Narrated Mujahid: Someone came to Ibn `Umar and said, \"Here is Allah's Messenger (ﷺ) entering the Ka`ba.\" Ibn `Umar said, \n\"I went there but the Prophet (ﷺ) had come out of the Ka`ba and I found Bilal standing between its two \ndoors. I asked Bilal, 'Did the Prophet (ﷺ) pray in the Ka`ba?' Bilal replied, 'Yes, he prayed two rak`at \nbetween the two pillars which are to your left on entering the Ka`ba. Then Allah's Messenger (ﷺ) came out \nand offered a two-rak`at prayer facing the Ka`ba.' \"", "grade": "Sahih", "narratedBy": "Narrated Mujahid:", "reference": "https://sunnah.com/bukhari:397", "inBookReference": "Book 8, Hadith 48"}, {"id": 49, "hadithNumber": "398", "text": "Narrated Ibn `Abbas: When the Prophet (ﷺ) entered the Ka`ba, he invoked Allah in each and every side of it and did not pray \ntill he came out of it, and offered a two-rak`at prayer facing the Ka`ba and said, \"This is the Qibla.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:398", "inBookReference": "Book 8, Hadith 49"}, {"id": 50, "hadithNumber": "399", "text": "Narrated Bara' bin `Azib: Allah's Messenger (ﷺ) prayed facing Baitul-Maqdis for sixteen or seventeen months but he loved to face the \nKa`ba (at Mecca) so Allah revealed: \"Verily, We have seen the turning of your face to the heaven!\" \n(2:144) So the Prophet (ﷺ) faced the Ka`ba and the fools amongst the people namely \"the Jews\" said, \n\"What has turned them from their Qibla (Baitul-Maqdis) which they formerly observed\"\" (Allah \nrevealed): \"Say: 'To Allah belongs the East and the West. He guides whom he will to a straight path'.\" \n(2:142) A man prayed with the Prophet (facing the Ka`ba) and went out. He saw some of the Ansar \npraying the `Asr prayer with their faces towards Baitul-Maqdis, he said, \"I bear witness that I prayed \nwith Allah's Messenger (ﷺ) facing the Ka`ba.\" So all the people turned their faces towards the Ka`ba.", "grade": "Sahih", "narratedBy": "Narrated Bara' bin `Azib:", "reference": "https://sunnah.com/bukhari:399", "inBookReference": "Book 8, Hadith 50"}, {"id": 51, "hadithNumber": "400", "text": "Narrated Jabir: Allah's Messenger (ﷺ) used to pray (optional, non-obligatory prayer) while riding on his mount (Rahila) \nwherever it turned, and whenever he wanted to pray the compulsory prayer he dismounted and prayed \nfacing the Qibla.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:400", "inBookReference": "Book 8, Hadith 51"}, {"id": 52, "hadithNumber": "401", "text": "Narrated `Abdullah: The Prophet (ﷺ) prayed (and the sub-narrator Ibrahim said, \"I do not know whether he prayed more or less \nthan usual\"), and when he had finished the prayers he was asked, \"O Allah's Messenger (ﷺ)! Has there been \nany change in the prayers?\" He said, \"What is it?' The people said, \"You have prayed so much and so \nmuch.\" So the Prophet (ﷺ) bent his legs, faced the Qibla and performed two prostration's (of Sahu) and \nfinished his prayers with Taslim (by turning his face to right and left saying: 'As-Salamu `Alaikum- \nWarahmat-ullah'). When he turned his face to us he said, \"If there had been anything changed in the \nprayer, surely I would have informed you but I am a human being like you and liable to forget like \nyou. So if I forget remind me and if anyone of you is doubtful about his prayer, he should follow what \nhe thinks to be correct and complete his prayer accordingly and finish it and do two prostrations (of \nSahu).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:401", "inBookReference": "Book 8, Hadith 52"}, {"id": 53, "hadithNumber": "402", "text": "Narrated `Umar (bin Al-Khattab): My Lord agreed with me in three things: \n-1. I said, \"O Allah's Messenger (ﷺ), I wish we took the station of Abraham as our praying place (for some of \nour prayers). So came the Divine Inspiration: And take you (people) the station of Abraham as a place \nof prayer (for some of your prayers e.g. two rak`at of Tawaf of Ka`ba)\". (2.125) \n-2. And as regards the (verse of) the veiling of the women, I said, 'O Allah's Messenger (ﷺ)! I wish you \nordered your wives to cover themselves from the men because good and bad ones talk to them.' So the \nverse of the veiling of the women was revealed. \n-3. Once the wives of the Prophet (ﷺ) made a united front against the Prophet (ﷺ) and I said to them, 'It may \nbe if he (the Prophet) divorced you, (all) that his Lord (Allah) will give him instead of you wives \nbetter than you.' So this verse (the same as I had said) was revealed.\" (66.5).", "grade": "Sahih", "narratedBy": "Narrated `Umar (bin Al-Khattab):", "reference": "https://sunnah.com/bukhari:402", "inBookReference": "Book 8, Hadith 53"}, {"id": 54, "hadithNumber": "54", "text": "Narrated Anas: as above (395).", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:402b", "inBookReference": "Book 8, Hadith 54"}, {"id": 55, "hadithNumber": "403", "text": "Narrated `Abdullah bin `Umar: While the people were offering the Fajr prayer at Quba' (near Medina), someone came to them and \nsaid: \"It has been revealed to Allah's Messenger (ﷺ) tonight, and he has been ordered to pray facing the \nKa`ba.\" So turn your faces to the Ka`ba. Those people were facing Sham (Jerusalem) so they turned \ntheir faces towards Ka`ba (at Mecca).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:403", "inBookReference": "Book 8, Hadith 55"}, {"id": 56, "hadithNumber": "404", "text": "Narrated `Abdullah: \"Once the Prophet (ﷺ) offered five rak`at in Zuhr prayer. He was asked, \"Is there an increase in the \nprayer?\" The Prophet (ﷺ) said, \"And what is it?\" They said, \"You have prayed five rak`at.' So he bent his \nlegs and performed two prostrations (of Sahu).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:404", "inBookReference": "Book 8, Hadith 56"}, {"id": 57, "hadithNumber": "405", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) saw some sputum in the direction of the Qibla (on the wall of the mosque) and he \ndisliked that and the sign of disgust was apparent from his face. So he got up and scraped it off with \nhis hand and said, \"Whenever anyone of you stands for the prayer, he is speaking in private to his \nLord or his Lord is between him and his Qibla. So, none of you should spit in the direction of the \nQibla but one can spit to the left or under his foot.\" The Prophet (ﷺ) then took the corner of his sheet and \nspat in it and folded it and said, \"Or you can do this. \"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:405", "inBookReference": "Book 8, Hadith 57"}, {"id": 58, "hadithNumber": "406", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) saw sputum on the wall of the mosque in the direction of the Qibla and scraped it off. \nHe faced the people and said, \"Whenever any one of you is praying, he should not spit in front of him \nbecause in the prayer Allah is in front of him.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:406", "inBookReference": "Book 8, Hadith 58"}, {"id": 59, "hadithNumber": "407", "text": "Narrated `Aisha: (the mother of faithful believers) Allah's Messenger (ﷺ) saw some nasal secretions, expectoration or sputum \non the wall of the mosque in the direction of the Qibla and scraped it off.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:407", "inBookReference": "Book 8, Hadith 59"}, {"id": 60, "hadithNumber": "408", "text": "Narrated Abu Huraira and Abu Sa`id: Allah's Messenger (ﷺ) saw some expectoration on the wall of the mosque; he took gravel and scraped it off \nand said, \"If anyone of you wanted to spit he should neither spit in front of him nor on his right but he \ncould spit either on his left or under his left foot.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira and Abu Sa`id:", "reference": "https://sunnah.com/bukhari:408", "inBookReference": "Book 8, Hadith 60"}, {"id": 61, "hadithNumber": "410", "text": "Narrated Abu Huraira and Abu Sa`id: Allah's Messenger (ﷺ) saw some expectoration on the wall of the mosque; he took gravel and scraped it off \nand said, \"If anyone of you wanted to spit, he should neither spit in front of him nor on his right but \ncould spit either on his left or under his left foot.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira and Abu Sa`id:", "reference": "https://sunnah.com/bukhari:410", "inBookReference": "Book 8, Hadith 61"}, {"id": 62, "hadithNumber": "412", "text": "Narrated Anas: The Prophet (ﷺ) said, \"None of you should spit in front or on his right but he could spit either on his left \nor under his foot.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:412", "inBookReference": "Book 8, Hadith 62"}, {"id": 63, "hadithNumber": "413", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) said, \"A faithful believer while in prayer is speaking in private to his Lord, so he should \nneither spit in front of him nor to his right side but he could spit either on his left or under his foot.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:413", "inBookReference": "Book 8, Hadith 63"}, {"id": 64, "hadithNumber": "414", "text": "Narrated Abu Sa`id: The Prophet (ﷺ) saw sputum on (the wall of) the mosque in the direction of the Qibla and scraped it off \nwith gravel. Then he forbade Spitting in front or on the right, but allowed it on one's left or under \none's left foot.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:414", "inBookReference": "Book 8, Hadith 64"}, {"id": 65, "hadithNumber": "415", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) said, \"Spitting in the mosque is a sin and its expiation is to bury it.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:415", "inBookReference": "Book 8, Hadith 65"}, {"id": 66, "hadithNumber": "416", "text": "Narrated Abu Huraira: Prophet said, \"If anyone of you stands for prayer, he should not spit in front of him because in prayer \nhe is speaking in private to Allah and he should not spit on his right as there is an angel, but he can \nspit either on his left or under his left foot and bury it (i.e. expectoration).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:416", "inBookReference": "Book 8, Hadith 66"}, {"id": 67, "hadithNumber": "417", "text": "Narrated Anas: The Prophet (ﷺ) saw expectoration (on the wall of the mosque) in the direction of the Qibla and scraped it \noff with his hand. It seemed that he disliked it and the sign of disgust was apparent from his face. He \nsaid, \"If anyone of you stands for the prayer, he is speaking in private to his Lord, (or) his Lord is \nbetween him and his Qibla, therefore he should not spit towards his Qibla, but he could spit either on \nhis left or under his foot.\" Then he took the corner of his sheet and spat in it, folded it and said, \"Or do \nthis.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:417", "inBookReference": "Book 8, Hadith 67"}, {"id": 68, "hadithNumber": "418", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Do you consider or see that my face is towards the Qibla? By Allah, neither \nyour submissiveness nor your bowing is hidden from me, surely I see you from my back.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:418", "inBookReference": "Book 8, Hadith 68"}, {"id": 69, "hadithNumber": "419", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) led us in a prayer and then got up on the pulpit and said, \"In your prayer and bowing, I \ncertainly see you from my back as I see you (while looking at you.)\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:419", "inBookReference": "Book 8, Hadith 69"}, {"id": 70, "hadithNumber": "420", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) ordered for a horse race; the trained horses were to run from a place called Al-Hafya' \nto Thaniyat Al-Wada` and the horses which were not trained were to run from Al-Thaniya to the \nMasjid (mosque of) Bani Zuraiq. The sub narrator added: Ibn `Umar was one of those who took part \nin the race.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:420", "inBookReference": "Book 8, Hadith 70"}, {"id": 71, "hadithNumber": "421", "text": "Narrated Anas: Some goods came to Allah's Messenger (ﷺ) from Bahrain. The Prophet (ﷺ) ordered the people to spread them in \nthe mosque --it was the biggest amount of goods Allah's Messenger (ﷺ) had ever received. He left for prayer \nand did not even look at it. After finishing the prayer, he sat by those goods and gave from those to \neverybody he saw. Al-`Abbas came to him and said, \"O Allah's Messenger (ﷺ)! give me (something) too, \nbecause I gave ransom for myself and `Aqil\". Allah's Messenger (ﷺ) told him to take. So he stuffed his \ngarment with it and tried to carry it away but he failed to do so. He said, \"O Allah's Messenger (ﷺ)! Order \nsomeone to help me in lifting it.\" The Prophet (ﷺ) refused. He then said to the Prophet: Will you please \nhelp me to lift it?\" Allah's Messenger (ﷺ) refused. Then Al-`Abbas threw some of it and tried to lift it (but \nfailed). He again said, \"O Allah's Messenger (ﷺ) Order someone to help me to lift it.\" He refused. Al-`Abbas \nthen said to the Prophet: \"Will you please help me to lift it?\" He again refused. Then Al-`Abbas threw \nsome of it, and lifted it on his shoulders and went away. Allah's Messenger (ﷺ) kept on watching him till he \ndisappeared from his sight and was astonished at his greediness. Allah's Messenger (ﷺ) did not get up till the \nlast coin was distributed.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:421", "inBookReference": "Book 8, Hadith 71"}, {"id": 72, "hadithNumber": "422", "text": "Narrated Anas: I found the Prophet (ﷺ) in the mosque along with some people. He said to me, \"Did Abu Talha send you?\" \nI said, \"Yes\". He said, \"For a meal?\" I said, \"Yes.\" Then he said to his companions, \"Get up.\" They set \nout and I was ahead of them.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:422", "inBookReference": "Book 8, Hadith 72"}, {"id": 73, "hadithNumber": "423", "text": "Narrated Sahl bin Sa`d: A man said, \"O Allah's Messenger (ﷺ)! If a man finds another man with his wife, (committing adultery) \nshould the husband kill him?\" Later on I saw them (the man and his wife) doing Li`an in the mosque \n(taking oaths, one accusing, and the other denying adultery).", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Sa`d:", "reference": "https://sunnah.com/bukhari:423", "inBookReference": "Book 8, Hadith 73"}, {"id": 74, "hadithNumber": "424", "text": "Narrated `Itban bin Malik: The Prophet (ﷺ) came to my house and said, \"Where do you like me to pray?\" I pointed to a place. The \nProphet then said, \"Allahu Akbar\", and we aligned behind him and he offered a two-rak`at prayer.", "grade": "Sahih", "narratedBy": "Narrated `Itban bin Malik:", "reference": "https://sunnah.com/bukhari:424", "inBookReference": "Book 8, Hadith 74"}, {"id": 75, "hadithNumber": "425", "text": "Narrated `Itban bin Malik: who was one of the companions of Allah's Messenger (ﷺ) and one of the Ansar's who took part in the battle \nof Badr: I came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ) I have weak eyesight and I lead my \npeople in prayers. When it rains the water flows in the valley between me and my people so I cannot \ngo to their mosque to lead them in prayer. O Allah's Messenger (ﷺ)! I wish you would come to my house and \npray in it so that I could take that place as a Musalla. Allah's Messenger (ﷺ) said. \"Allah willing, I will do \nso.\" Next day after the sun rose high, Allah's Messenger (ﷺ) and Abu Bakr came and Allah's Messenger (ﷺ) asked \nfor permission to enter. I gave him permission and he did not sit on entering the house but said to me, \n\"Where do you like me to pray?\" I pointed to a place in my house. So Allah's Messenger (ﷺ) stood there and \nsaid, 'Allahu Akbar', and we all got up and aligned behind him and offered a two-rak`at prayer and \nended it with Taslim. We requested him to stay for a meal called \"Khazira\" which we had prepared for \nhim. Many members of our family gathered in the house and one of them said, \"Where is Malik bin \nAl-Dukhaishin or Ibn Al-Dukhshun?\" One of them replied, \"He is a hypocrite and does not love Allah \nand His Apostle.\" Hearing that, Allah's Messenger (ﷺ) said, \"Do not say so. Haven't you seen that he said, \n'None has the right to be worshipped but Allah' for Allah's sake only?\" He said, \"Allah and His \nApostle know better. We have seen him helping and advising hypocrites.\" \nAllah's Messenger (ﷺ) said, \"Allah has forbidden the (Hell) fire for those who say, 'None has the right to be \nworshipped but Allah' for Allah's sake only.\"", "grade": "Sahih", "narratedBy": "Narrated `Itban bin Malik:", "reference": "https://sunnah.com/bukhari:425", "inBookReference": "Book 8, Hadith 75"}, {"id": 76, "hadithNumber": "426", "text": "Narrated `Aisha: The Prophet (ﷺ) used to start every thing from the right (for good things) whenever it was possible in all \nhis affairs; for example: in washing, combing or wearing shoes.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:426", "inBookReference": "Book 8, Hadith 76"}, {"id": 77, "hadithNumber": "427", "text": "Narrated `Aisha: Um Habiba and Um Salama mentioned about a church they had seen in Ethiopia in which there were \npictures. They told the Prophet (ﷺ) about it, on which he said, \"If any religious man dies amongst those \npeople they would build a place of worship at his grave and make these pictures in it. They will be the \nworst creature in the sight of Allah on the Day of Resurrection.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:427", "inBookReference": "Book 8, Hadith 77"}, {"id": 78, "hadithNumber": "428", "text": "Narrated Anas: When the Prophet (ﷺ) arrived Medina he dismounted at `Awali-i-Medina amongst a tribe called Banu \n`Amr bin `Auf. He stayed there For fourteen nights. Then he sent for Bani An-Najjar and they came \narmed with their swords. As if I am looking (just now) as the Prophet (ﷺ) was sitting over his Rahila \n(Mount) with Abu Bakr riding behind him and all Banu An-Najjar around him till he dismounted at \nthe courtyard of Abu Aiyub's house. The Prophet (ﷺ) loved to pray wherever the time for the prayer was \ndue even at sheep-folds. Later on he ordered that a mosque should be built and sent for some people of \nBanu-An-Najjar and said, \"O Banu An-Najjar! Suggest to me the price of this (walled) piece of land \nof yours.\" They replied, \"No! By Allah! We do not demand its price except from Allah.\" Anas added: \nThere were graves of pagans in it and some of it was unleveled and there were some date-palm trees \nin it. The Prophet (ﷺ) ordered that the graves of the pagans be dug out and the unleveled land be level led \nand the date-palm trees be cut down . (So all that was done). They aligned these cut date-palm trees \ntowards the Qibla of the mosque (as a wall) and they also built two stone side-walls (of the mosque). \nHis companions brought the stones while reciting some poetic verses. The Prophet (ﷺ) was with them and \nhe kept on saying, \"There is no goodness except that of the Hereafter, O Allah! So please forgive the \nAnsars and the emigrants. \"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:428", "inBookReference": "Book 8, Hadith 78"}, {"id": 79, "hadithNumber": "429", "text": "Narrated Abu Al-Taiyah [??]: Anas said, \"The Prophet (ﷺ) prayed in the sheep fold.\" Later on I heard him saying, \"He prayed in the \nsheep folds before the construction of the, mosque.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Taiyah [??]:", "reference": "https://sunnah.com/bukhari:429", "inBookReference": "Book 8, Hadith 79"}, {"id": 80, "hadithNumber": "430", "text": "Narrated Nafi`: \"I saw Ibn `Umar praying while taking his camel as a Sutra in front of him and he said, \"I saw the \nProphet doing the same.\"", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:430", "inBookReference": "Book 8, Hadith 80"}, {"id": 81, "hadithNumber": "431", "text": "Narrated `Abdullah bin `Abbas: The sun eclipsed and Allah's Messenger (ﷺ) offered the eclipse prayer and said, \"I have been shown the \nHellfire (now) and I never saw a worse and horrible sight than the sight I have seen today.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:431", "inBookReference": "Book 8, Hadith 81"}, {"id": 82, "hadithNumber": "432", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) had said, \"Offer some of your prayers (Nawafil) at home, and do not take your houses as \ngraves.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:432", "inBookReference": "Book 8, Hadith 82"}, {"id": 83, "hadithNumber": "433", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"Do not enter (the places) of these people where Allah's punishment had fallen \nunless you do so weeping. If you do not weep, do not enter (the places of these people) because \nAllah's curse and punishment which fell upon them may fall upon you.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:433", "inBookReference": "Book 8, Hadith 83"}, {"id": 84, "hadithNumber": "434", "text": "Narrated `Aisha: Um Salama told Allah's Messenger (ﷺ) about a church which she had seen in Ethiopia and which was called \nMariya. She told him about the pictures which she had seen in it. Allah's Messenger (ﷺ) said, \"If any \nrighteous pious man dies amongst them, they would build a place of worship at his grave and make \nthese pictures in it; they are the worst creatures in the sight of Allah.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:434", "inBookReference": "Book 8, Hadith 84"}, {"id": 85, "hadithNumber": "435", "text": "Narrated `Aisha and `Abdullah bin `Abbas: When the last moment of the life of Allah's Messenger (ﷺ) came he started putting his 'Khamisa' on his face \nand when he felt hot and short of breath he took it off his face and said, \"May Allah curse the Jews \nand Christians for they built the places of worship at the graves of their Prophets.\" The Prophet (ﷺ) was \nwarning (Muslims) of what those had done.", "grade": "Sahih", "narratedBy": "Narrated `Aisha and `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:435", "inBookReference": "Book 8, Hadith 85"}, {"id": 86, "hadithNumber": "437", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"May Allah's curse be on the Jews for they built the places of worship at the \ngraves of their Prophets.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:437", "inBookReference": "Book 8, Hadith 86"}, {"id": 87, "hadithNumber": "438", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) said, \"I have been given five things which were not given to any amongst the Prophets \nbefore me. These are: \n-1. Allah made me victorious by awe (by His frightening my enemies) for a distance of one month's \njourney. \n-2. The earth has been made for me (and for my followers) a place for praying and a thing to perform \nTayammum. Therefore my followers can pray wherever the time of a prayer is due. \n-3. The booty has been made Halal (lawful) for me (and was not made so for anyone else). \n-4. Every Prophet used to be sent to his nation exclusively but I have been sent to all mankind. \n-5. I have been given the right of intercession (on the Day of Resurrection.)", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:438", "inBookReference": "Book 8, Hadith 87"}, {"id": 88, "hadithNumber": "439", "text": "Narrated `Aisha: There was a black slave girl belonging to an 'Arab tribe and they manumitted her but she remained \nwith them. The slave girl said, \"Once one of their girls (of that tribe) came out wearing a red leather \nscarf decorated with precious stones. It fell from her or she placed it somewhere. A kite passed by that \nplace, saw it Lying there and mistaking it for a piece of meat, flew away with it. Those people \nsearched for it but they did not find it. So they accused me of stealing it and started searching me and \neven searched my private parts.\" The slave girl further said, \"By Allah! while I was standing (in that \nstate) with those people, the same kite passed by them and dropped the red scarf and it fell amongst \nthem. I told them, 'This is what you accused me of and I was innocent and now this is it.' \" `Aisha \nadded: That slave girl came to Allah's Messenger (ﷺ) and embraced Islam. She had a tent or a small room \nwith a low roof in the mosque. Whenever she called on me, she had a talk with me and whenever she \nsat with me, she would recite the following: \"The day of the scarf (band) was one of the wonders of \nour Lord, verily He rescued me from the disbelievers' town. `Aisha added: \"Once I asked her, 'What is \nthe matter with you? Whenever you sit with me, you always recite these poetic verses.' On that she \ntold me the whole story. \"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:439", "inBookReference": "Book 8, Hadith 88"}, {"id": 89, "hadithNumber": "440", "text": "Narrated Nafi`: `Abdullah bin `Umar said: I used to sleep in the mosque of the Prophet (ﷺ) while I was young and \nunmarried.", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:440", "inBookReference": "Book 8, Hadith 89"}, {"id": 90, "hadithNumber": "441", "text": "Narrated Sahl bin Sa`d: Allah's Messenger (ﷺ) went to Fatima's house but did not find `Ali there. So he asked, \"Where is your \ncousin?\" She replied, \"There was something between us and he got angry with me and went out. He \ndid not sleep (midday nap) in the house.\" Allah's Messenger (ﷺ) asked a person to look for him. That person \ncame and said, \"O Allah's Messenger (ﷺ)! He (Ali) is sleeping in the mosque.\" Allah's Messenger (ﷺ) went there \nand `Ali was lying. His upper body cover had fallen down to one side of his body and he was covered \nwith dust. Allah's Messenger (ﷺ) started cleaning the dust from him saying: \"Get up! O Aba Turab. Get up! \nO Aba Turab (literally means: O father of dust).", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Sa`d:", "reference": "https://sunnah.com/bukhari:441", "inBookReference": "Book 8, Hadith 90"}, {"id": 91, "hadithNumber": "442", "text": "Narrated Abu Huraira: I saw seventy of As-Suffa men and none of them had a Rida' (a garment covering the upper part of the \nbody). They had either Izars (only) or sheets which they tied round their necks. Some of these sheets \nreached the middle of their legs and some reached their heels and they used to gather them with their \nhands lest their private parts should become naked.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:442", "inBookReference": "Book 8, Hadith 91"}, {"id": 92, "hadithNumber": "443", "text": "Narrated Jabir bin `Abdullah: I went to the Prophet (ﷺ) in the mosque (the sub-narrator Mas`ar thought that Jabir had said, \"In the \nforenoon.\") He ordered me to pray two rak`at. He owed me some money and he repaid it to me and \ngave more than what was due to me.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:443", "inBookReference": "Book 8, Hadith 92"}, {"id": 93, "hadithNumber": "444", "text": "Narrated Abu Qatada Al-Aslami: Allah's Messenger (ﷺ) said, \"If anyone of you enters a mosque, he should pray two rak`at before sitting.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada Al-Aslami:", "reference": "https://sunnah.com/bukhari:444", "inBookReference": "Book 8, Hadith 93"}, {"id": 94, "hadithNumber": "445", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"The angels keep on asking Allah's forgiveness for anyone of you, as long as he \nis at his Musalla (praying place) and he does not pass wind (Hadath). They say, 'O Allah! Forgive \nhim, O Allah! be Merciful to him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:445", "inBookReference": "Book 8, Hadith 94"}, {"id": 95, "hadithNumber": "446", "text": "Narrated `Abdullah bin `Umar: In the lifetime of Allah's Messenger (ﷺ) the mosque was built of adobes, its roof of the leaves of date-palms \nand its pillars of the stems of date-palms. Abu Bakr did not alter it. `Umar expanded it on the same \npattern as it was in the lifetime of Allah's Messenger (ﷺ) by using adobes, leaves of date-palms and changing \nthe pillars into wooden ones. `Uthman changed it by expanding it to a great extent and built its walls \nwith engraved stones and lime and made its pillars of engraved stones and its roof of teak wood.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:446", "inBookReference": "Book 8, Hadith 95"}, {"id": 96, "hadithNumber": "447", "text": "Narrated `Ikrima: Ibn `Abbas said to me and to his son `Ali, \"Go to Abu Sa`id and listen to what he narrates.\" So we \nwent and found him in a garden looking after it. He picked up his Rida', wore it and sat down and \nstarted narrating till the topic of the construction of the mosque reached. He said, \"We were carrying \none adobe at a time while `Ammar was carrying two. The Prophet (ﷺ) saw him and started removing the \ndust from his body and said, \"May Allah be Merciful to `Ammar. He will be inviting them (i.e. his \nmurderers, the rebellious group) to Paradise and they will invite him to Hell-fire.\" `Ammar said, \"I \nseek refuge with Allah from affliction.\"", "grade": "Sahih", "narratedBy": "Narrated `Ikrima:", "reference": "https://sunnah.com/bukhari:447", "inBookReference": "Book 8, Hadith 96"}, {"id": 97, "hadithNumber": "448", "text": "Narrated Sahl: Allah's Messenger (ﷺ) sent someone to a woman telling her to \"Order her slave, carpenter, to prepare a \nwooden pulpit for him to sit on.\"", "grade": "Sahih", "narratedBy": "Narrated Sahl:", "reference": "https://sunnah.com/bukhari:448", "inBookReference": "Book 8, Hadith 97"}, {"id": 98, "hadithNumber": "449", "text": "Narrated Jabir: A woman said, \"O Allah's Messenger (ﷺ)! Shall I get something constructed for you to sit on as I have a \nslave who is a carpenter?\" He replied, \"Yes, if you like.\" So she had that pulpit constructed.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:449", "inBookReference": "Book 8, Hadith 98"}, {"id": 99, "hadithNumber": "450", "text": "Narrated 'Ubaidullah Al-Khaulani: I heard `Uthman bin `Affan saying, when people argued too much about his intention to reconstruct \nthe mosque of Allah's Messenger (ﷺ), \"You have talked too much. I heard the Prophet (ﷺ) saying, 'Whoever built \na mosque, (Bukair thought that `Asim, another sub-narrator, added, \"Intending Allah's Pleasure\"), \nAllah would build for him a similar place in Paradise.' \"", "grade": "Sahih", "narratedBy": "Narrated 'Ubaidullah Al-Khaulani:", "reference": "https://sunnah.com/bukhari:450", "inBookReference": "Book 8, Hadith 99"}, {"id": 100, "hadithNumber": "451", "text": "Narrated `Amr: I heard Jabir bin `Abdullah saying, \"A man passed through the mosque carrying arrows. Allah's \nApostle said to him, 'Hold them by their heads.' \"", "grade": "Sahih", "narratedBy": "Narrated `Amr:", "reference": "https://sunnah.com/bukhari:451", "inBookReference": "Book 8, Hadith 100"}, {"id": 101, "hadithNumber": "452", "text": "Narrated Abu Burda bin `Abdullah: (on the authority of his father) The Prophet (ﷺ) said, \"Whoever passes through our mosques or markets \nwith arrows should hold them by their heads lest he should injure a Muslim.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Burda bin `Abdullah:", "reference": "https://sunnah.com/bukhari:452", "inBookReference": "Book 8, Hadith 101"}, {"id": 102, "hadithNumber": "453", "text": "Narrated Hassan bin Thabit Al-Ansari: I asked Abu Huraira \"By Allah! Tell me the truth whether you heard the Prophet (ﷺ) saying, 'O Hassan! \nReply on behalf of Allah's Messenger (ﷺ). O Allah! Help him with the Holy Spirit.\" Abu Huraira said, \"Yes . \n\"", "grade": "Sahih", "narratedBy": "Narrated Hassan bin Thabit Al-Ansari:", "reference": "https://sunnah.com/bukhari:453", "inBookReference": "Book 8, Hadith 102"}, {"id": 103, "hadithNumber": "454", "text": "Narrated `Aisha: Once I saw Allah's Messenger (ﷺ) at the door of my house while some Ethiopians were playing in the \nmosque (displaying their skill with spears). Allah's Messenger (ﷺ) was screening me with his Rida' so as to \nenable me to see their display. (`Urwa said that `Aisha said, \"I saw the Prophet (ﷺ) and the Ethiopians \nwere playing with their spears.\")", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:454", "inBookReference": "Book 8, Hadith 103"}, {"id": 104, "hadithNumber": "456", "text": "Narrated `Aisha: Barirah came to seek my help regarding her manumission (freedom). I told herself you like I would pay your price \r\nto your masters but your Wala' (allegiance) would be for me.\" Her masters said, \"If you like, you can \r\npay what remains (of the price of her manumission), (Sufyan the sub-narrator once said), or if you like \r\nyou can manumit her, but her (inheritance) Al-Wala would be for us. \"When Allah's Messenger (ﷺ) came, I \r\nspoke to him about it. He said, \"Buy her and manumit her. No doubt Al-Wala' is for the manumitted.\" \r\nThen Allah's Messenger (ﷺ) stood on the pulpit (or Allah's Messenger (ﷺ) ascended the pulpit as Sufyan once said), \r\nand said, \"What about some people who impose conditions which are not present in Allah's Book \r\n(Laws)? Whoever imposes conditions which are not in Allah's Book (Laws), his conditions will be \r\ninvalid even if he imposed them a hundred times.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:456", "inBookReference": "Book 8, Hadith 104"}, {"id": 105, "hadithNumber": "457", "text": "Narrated Ka`b: In the mosque l asked Ibn Abi Hadrad to pay the debts which he owed to me and our voices grew \nlouder. Allah's Messenger (ﷺ) heard that while he was in his house. So he came to us raising the curtain of \nhis room and said, \"O Ka`b!\" I replied, \"Labaik, O Allah's Messenger (ﷺ)!\" He said, \"O Ka`b! reduce your \ndebt to one half,\" gesturing with his hand. I said, \"O Allah's Messenger (ﷺ)! I have done so.\" Then Allah's \nApostle said (to Ibn Abi Hadrad), \"Get up and pay the debt to him.\"", "grade": "Sahih", "narratedBy": "Narrated Ka`b:", "reference": "https://sunnah.com/bukhari:457", "inBookReference": "Book 8, Hadith 105"}, {"id": 106, "hadithNumber": "458", "text": "Narrated Abu Huraira: A black man or a black woman used to sweep the mosque and he or she died. The Prophet (ﷺ) asked \nabout her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? \nShow me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:458", "inBookReference": "Book 8, Hadith 106"}, {"id": 107, "hadithNumber": "459", "text": "Narrated `Aisha: When the verses of Surat \"Al-Baqara\"' about the usury Riba were revealed, the Prophet (ﷺ) went to the \nmosque and recited them in front of the people and then banned the trade of alcohol.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:459", "inBookReference": "Book 8, Hadith 107"}, {"id": 108, "hadithNumber": "460", "text": "Narrated Abu Rafi: Abu Huraira said, \"A man or a woman used to clean the mosque.\" (A \n     sub-narrator said, 'Most probably a woman..') Then he narrated the \n     Hadith of the Prophet", "grade": "Sahih", "narratedBy": "Narrated Abu Rafi:", "reference": "https://sunnah.com/bukhari:460", "inBookReference": "Book 8, Hadith 108"}, {"id": 109, "hadithNumber": "461", "text": "Narrated Abu Huraira: \"The Prophet (ﷺ) said, \"Last night a big demon (afreet) from the Jinns \n     came to me and wanted to interrupt my prayers (or said something \n     similar) but Allah enabled me to overpower him. I wanted to fasten him\n     to one of the pillars of the mosque so that all of you could See him \n     in the morning but I remembered the statement of my brother Solomon \n     (as stated in Quran): My Lord! Forgive me and bestow on me a kingdom \n     such as shall not belong to anybody after me (38.35).\" The sub \n     narrator Rauh said, \"He (the demon) was dismissed humiliated.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:461", "inBookReference": "Book 8, Hadith 109"}, {"id": 110, "hadithNumber": "462", "text": "Narrated Abu Huraira: The Prophet (ﷺ) sent some horsemen to Najd and they brought a man called Thumama bin Uthal from \nBani Hanifa. They fastened him to one of the pillars of the mosque. The Prophet (ﷺ) came and ordered \nthem to release him. He went to a (garden of) date-palms near the mosque, took a bath and entered \nthe mosque again and said, \"None has the right to be worshipped but Allah and Muhammad is His \nApostle\" (i.e. he embraced Islam).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:462", "inBookReference": "Book 8, Hadith 110"}, {"id": 111, "hadithNumber": "463", "text": "Narrated `Aisha: On the day of Al-Khandaq (battle of the Trench' the medial arm vein of Sa`d bin Mu`ad [??] was \ninjured and the Prophet (ﷺ) pitched a tent in the mosque to look after him. There was another tent for \nBanu Ghaffar in the mosque and the blood started flowing from Sa`d's tent to the tent of Bani Ghaffar. \nThey shouted, \"O occupants of the tent! What is coming from you to us?\" They found that Sa`d' \nwound was bleeding profusely and Sa`d died in his tent.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:463", "inBookReference": "Book 8, Hadith 111"}, {"id": 112, "hadithNumber": "464", "text": "Narrated Um Salama: I complained to Allah's Messenger (ﷺ) that I was sick. He told me to perform the Tawaf behind the people \nwhile riding. So I did so and Allah's Messenger (ﷺ) was praying beside the Ka`ba and reciting the Sura \nstarting with \"Wat-tur wa kitabin mastur.\"", "grade": "Sahih", "narratedBy": "Narrated Um Salama:", "reference": "https://sunnah.com/bukhari:464", "inBookReference": "Book 8, Hadith 112"}, {"id": 113, "hadithNumber": "465", "text": "Narrated Anas bin Malik: Two of the companions of the Prophet (ﷺ) departed from him on a dark night and were led by two lights \nlike lamps (going in front of them from Allah as a miracle) lighting the way in front of them, and \nwhen they parted, each of them was accompanied by one of these lights till he reached their \n(respective) houses.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:465", "inBookReference": "Book 8, Hadith 113"}, {"id": 114, "hadithNumber": "466", "text": "Narrated Abu Sa`id Al-Khudri: The Prophet (ﷺ) delivered a sermon and said, \"Allah gave a choice to one of (His) slaves either to choose \nthis world or what is with Him in the Hereafter. He chose the latter.\" Abu Bakr wept. I said to myself, \n\"Why is this Sheikh weeping, if Allah gave choice to one (of His) slaves either to choose this world or \nwhat is with Him in the Here after and he chose the latter?\" And that slave was Allah's Messenger (ﷺ) \nhimself. Abu Bakr knew more than us. The Prophet (ﷺ) said, \"O Abu Bakr! Don't weep. The Prophet (ﷺ) \nadded: Abu- Bakr has favored me much with his property and company. If I were to take a Khalil \nfrom mankind I would certainly have taken Abu Bakr but the Islamic brotherhood and friendship is \nsufficient. Close all the gates in the mosque except that of Abu Bakr.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:466", "inBookReference": "Book 8, Hadith 114"}, {"id": 115, "hadithNumber": "467", "text": "Narrated Ibn `Abbas: \"Allah's Messenger (ﷺ) in his fatal illness came out with a piece of cloth tied round his head and sat on the \npulpit. After thanking and praising Allah he said, \"There is no one who had done more favor to me \nwith life and property than Abu Bakr bin Abi Quhafa. If I were to take a Khalil, I would certainly have \ntaken Abu- Bakr but the Islamic brotherhood is superior. Close all the small doors in this mosque \nexcept that of Abu Bakr.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:467", "inBookReference": "Book 8, Hadith 115"}, {"id": 116, "hadithNumber": "468", "text": "Narrated Nafi`: Ibn `Umar said, \"The Prophet (ﷺ) arrived at Mecca and sent for `Uthman bin Talha. He opened the gate of \nthe Ka`ba and the Prophet, Bilal, Usama bin Zaid and `Uthman bin Talha entered the Ka`ba and then \nthey closed its door (from inside). They stayed there for an hour, and then came out.\" Ibn `Umar \nadded, \"I quickly went to Bilal and asked him (whether the Prophet (ﷺ) had prayed). Bilal replied, 'He \nprayed in it.' I asked, 'Where?' He replied, 'Between the two pillars.' \"Ibn `Umar added, \"I forgot to \nask how many rak`at he (the Prophet) had prayed in the Ka`ba.\"", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:468", "inBookReference": "Book 8, Hadith 116"}, {"id": 117, "hadithNumber": "469", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) sent some horse men to Najd and they brought a man called Thumama bin Uthal from \nBani Hanifa. They fastened him to one of the pillars of the mosque.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:469", "inBookReference": "Book 8, Hadith 117"}, {"id": 118, "hadithNumber": "470", "text": "Narrated Al-Sa'ib bin Yazid: I was standing in the mosque and somebody threw a gravel at me. I looked and found that he was \n`Umar bin Al-Khattab. He said to me, \"Fetch those two men to me.\" When I did, he said to them, \n\"Who are you? (Or) where do you come from?\" They replied, \"We are from Ta'if.\" `Umar said, \"Were \nyou from this city (Medina) I would have punished you for raising your voices in the mosque of \nAllah's Messenger (ﷺ).\"", "grade": "Sahih", "narratedBy": "Narrated Al-Sa'ib bin Yazid:", "reference": "https://sunnah.com/bukhari:470", "inBookReference": "Book 8, Hadith 118"}, {"id": 119, "hadithNumber": "471", "text": "Narrated Ka`b bin Malik: During the lifetime of Allah's Messenger (ﷺ) I asked Ibn Abi Hadrad in the mosque to pay the debts which he \nowed to me and our voices grew so loud that Allah's Messenger (ﷺ) heard them while he was in his house. So \nhe came to us after raising the curtain of his room. The Prophet (ﷺ) said, \"O Ka`b bin Malik!\" I replied, \n\"Labaik, O Allah's Messenger (ﷺ).\" He gestured with his hand to me to reduce the debt to one half. I said, \"O \nAllah's Messenger (ﷺ) have done it.\" Allah's Messenger (ﷺ) said (to Ibn Hadrad), \"Get up and pay it.\"", "grade": "Sahih", "narratedBy": "Narrated Ka`b bin Malik:", "reference": "https://sunnah.com/bukhari:471", "inBookReference": "Book 8, Hadith 119"}, {"id": 120, "hadithNumber": "472", "text": "Narrated Nafi`: Ibn `Umar said, \"While the Prophet (ﷺ) was on the pulpit, a man asked him how to offer the night prayers. \nHe replied, 'Pray two rak`at at a time and then two and then two and so on, and if you are afraid of the \ndawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the witr for all the \nrak`at which you have offered.\" Ibn `Umar said, \"The last rak`at of the night prayer should be odd, for \nthe Prophet (ﷺ) ordered it to be so.", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:472", "inBookReference": "Book 8, Hadith 120"}, {"id": 121, "hadithNumber": "473", "text": "Narrated Ibn `Umar: A man came to the Prophet (ﷺ) while he was delivering the sermon and asked him how to offer the night \r\nprayers. The Prophet (ﷺ) replied, 'Pray two rak`at at a time and then two and then two and so on and if \r\nyou are afraid of dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the \r\nwitr for all the rak`at which you have prayed.\" Narrated 'Ubaidullah bin `Abdullah bin `Umar: A man \r\ncalled the Prophet (ﷺ) while he was in the mosque.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:473", "inBookReference": "Book 8, Hadith 121"}, {"id": 122, "hadithNumber": "474", "text": "Narrated Abu Waqid al-Laithi: While Allah's Messenger (ﷺ) was sitting in the mosque (with some people) three men came, two of them \ncame in front of Allah's Messenger (ﷺ) and the third one went away, and then one of them found a place in \nthe circle and sat there while the second man sat behind the gathering, and the third one went away. \nWhen Allah's Messenger (ﷺ) finished his preaching, he said, \"Shall I tell you about these three persons? One \nof them betook himself to Allah and so Allah accepted him and accommodated him; the second felt \nshy before Allah so Allah did the same for him and sheltered him in His Mercy (and did not punish \nhim), while the third turned his face from Allah, and went away, so Allah turned His face from him \nlikewise.", "grade": "Sahih", "narratedBy": "Narrated Abu Waqid al-Laithi:", "reference": "https://sunnah.com/bukhari:474", "inBookReference": "Book 8, Hadith 122"}, {"id": 123, "hadithNumber": "475", "text": "Narrated `Abbad bin Tamim: that his uncle said, \"I saw Allah's Messenger (ﷺ) lying flat (on his back) in the mosque with one leg on the \nother.\" Narrated Sa`id bin Al-Musaiyab that `Umar and `Uthman used to do the same.", "grade": "Sahih", "narratedBy": "Narrated `Abbad bin Tamim:", "reference": "https://sunnah.com/bukhari:475", "inBookReference": "Book 8, Hadith 123"}, {"id": 124, "hadithNumber": "476", "text": "Narrated `Aisha: (the wife of the Prophet) I had seen my parents following Islam since I attained the age of intelligence. Not a day passed but the Prophet (ﷺ) visited us, both in the mornings and evenings. My father Abu Bakr thought of building a mosque in the courtyard of his house and he did so. He used to pray and recite the Qur'an in it. The pagan women and their children used to stand by him and look at him with surprise. Abu Bakr was a soft-hearted person and could not help weeping while reciting the Qur'an. The chiefs of the Quraish pagans became afraid of that (i.e. that their children and women might be \naffected by the recitation of Qur'an).", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:476", "inBookReference": "Book 8, Hadith 124"}, {"id": 125, "hadithNumber": "477", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"The prayer offered in congregation is twenty five times more superior (in reward) \nto the prayer offered alone in one's house or in a business center, because if one performs ablution and \ndoes it perfectly, and then proceeds to the mosque with the sole intention of praying, then for each \nstep which he takes towards the mosque, Allah upgrades him a degree in reward and (forgives) \ncrosses out one sin till he enters the mosque. When he enters the mosque he is considered in prayer as \nlong as he is waiting for the prayer and the angels keep on asking for Allah's forgiveness for him and \nthey keep on saying: 'O Allah! Be Merciful to him, O Allah! Forgive him, as long as he keeps on \nsitting at his praying place and does not pass wind. (See Hadith No. 620).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:477", "inBookReference": "Book 8, Hadith 125"}, {"id": 126, "hadithNumber": "478", "text": "Narrated Ibn `Umar or Ibn `Amr: The Prophet (ﷺ) clasped his hands, by interlacing his fingers.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar or Ibn `Amr:", "reference": "https://sunnah.com/bukhari:478", "inBookReference": "Book 8, Hadith 126"}, {"id": 127, "hadithNumber": "480", "text": "Narrated `Abdullah: That Allah's Messenger (ﷺ) \nsaid, \"O `Abdullah bin `Amr! What will be your condition when you will be left with the sediments of \n(worst) people?\" (They will be in conflict with each other).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:480", "inBookReference": "Book 8, Hadith 127"}, {"id": 128, "hadithNumber": "481", "text": "Narrated Abu Musa: The Prophet (ﷺ) said, \"A faithful believer to a faithful believer is like the bricks of a wall, enforcing each \nother.\" While (saying that) the Prophet (ﷺ) clasped his hands, by interlacing his fingers.", "grade": "Sahih", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/bukhari:481", "inBookReference": "Book 8, Hadith 128"}, {"id": 129, "hadithNumber": "482", "text": "Narrates Ibn Seereen: Abu Huraira said, \"Allah's Messenger (ﷺ) led us in one of the two `Isha' prayers (Abu Huraira named that \nprayer but I forgot it).\" Abu Huraira added, \"He prayed two rak`at and then finished the prayer with \nTaslim. He stood up near a piece of wood Lying across the mosque and leaned on it in such a way as \nif he was angry. Then he put his right hand over the left and clasped his hands by interlacing his \nfingers and then put his J right cheek on the back of his left hand. The people who were in haste left \nthe mosque through its gates. They wondered whether the prayer was reduced. And amongst them \nwere Abu Bakr and `Umar but they hesitated to ask the Prophet. A long-handed man called Dhul- \nYadain asked the Prophet, 'O Allah's Messenger (ﷺ)! Have you forgotten or has the prayer been reduced?' \nThe Prophet (ﷺ) replied, 'I have neither forgotten nor has the prayer been reduced' The Prophet (ﷺ) added, 'Is \nwhat Dhul Yadain has said true?' They (the people) said, 'Yes, it is true.' The Prophet (ﷺ) stood up again \nand led the prayer, completing the remaining prayer, forgotten by him, and performed Taslim, and \nthen said, 'Allahu Akbar.' And then he did a prostration as he used to prostrate or longer than that. He \nthen raised his head saying, 'Allahu Akbar; he then again said, 'Allahu Akbar', and prostrated as he \nused to prostrate or longer than that. Then he raised his head and said, 'Allahu Akbar.' \" (The subnarrator \nadded, \"I think that they asked (Ibn Seereen) whether the Prophet (ﷺ) completed the prayer with \nTaslim. He replied, \"I heard that `Imran bin Husain had said, 'Then he (the Prophet) did Taslim.\")", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:482", "inBookReference": "Book 8, Hadith 129"}, {"id": 130, "hadithNumber": "483", "text": "Narrated Fudail bin Sulaiman: Musa bin `Uqba said, \"I saw Salim bin `Abdullah looking for some places on the way and prayed \nthere. He narrated that his father used to pray there, and had seen the Prophet (ﷺ) praying at those very \nplaces.\" \nNarrated Nafi` on the authority of Ibn `Umar who said, \"I used to pray at those places.\" Musa the \nnarrator added, \"I asked Salim on which he said, 'I agree with Nafi` concerning those places, except \nthe mosque situated at the place called Sharaf Ar-Rawha.\"", "grade": "Sahih", "narratedBy": "Narrated Fudail bin Sulaiman:", "reference": "https://sunnah.com/bukhari:483", "inBookReference": "Book 8, Hadith 130"}, {"id": 131, "hadithNumber": "484", "text": "The narrated Hadith is about the various places on the way from Medina to Mecca where the Prophet (ﷺ) prayed and is not translated.", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:484", "inBookReference": "Book 8, Hadith 131"}, {"id": 132, "hadithNumber": "485", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:485", "inBookReference": "Book 8, Hadith 132"}, {"id": 133, "hadithNumber": "486", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:486", "inBookReference": "Book 8, Hadith 133"}, {"id": 134, "hadithNumber": "487", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:487", "inBookReference": "Book 8, Hadith 134"}, {"id": 135, "hadithNumber": "488", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:488", "inBookReference": "Book 8, Hadith 135"}, {"id": 136, "hadithNumber": "489", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:489", "inBookReference": "Book 8, Hadith 136"}, {"id": 137, "hadithNumber": "490", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:490", "inBookReference": "Book 8, Hadith 137"}, {"id": 138, "hadithNumber": "491", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:491", "inBookReference": "Book 8, Hadith 138"}, {"id": 139, "hadithNumber": "492", "text": "See translation for hadith 484 above", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:492", "inBookReference": "Book 8, Hadith 139"}, {"id": 140, "hadithNumber": "493", "text": "Narrated Ibn `Abbas: Once I came riding a she-ass when I had just attained the age of puberty. Allah's Messenger (ﷺ) was offering \nthe prayer at Mina with no wall in front of him and I passed in front of some of the row. There I \ndismounted and let my she-ass loose to graze and entered the row and nobody objected to me about it.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:493", "inBookReference": "Book 8, Hadith 140"}, {"id": 141, "hadithNumber": "494", "text": "Narrated Ibn `Umar: Whenever Allah's Messenger (ﷺ) came out on `Id day, he used to order that a Harba [??] (a short spear) to be \nplanted in front of him (as a Sutra for his prayer) and then he used to pray facing it with the people \nbehind him and used to do the same while on a journey. After the Prophet (ﷺ) , this practice was adopted \nby the Muslim rulers (who followed his traditions).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:494", "inBookReference": "Book 8, Hadith 141"}, {"id": 142, "hadithNumber": "495", "text": "Narrated `Aun bin Abi Juhaifa: I heard my father saying, \"The Prophet (ﷺ) led us, and prayed a two-rak`at Zuhr prayer and then a tworak` \nat `Asr prayer at Al-Batha' [??] with a short spear (planted) in front of him (as a Sutra) while \nwomen and donkeys were passing in front of him (beyond that stick).", "grade": "Sahih", "narratedBy": "Narrated `Aun bin Abi Juhaifa:", "reference": "https://sunnah.com/bukhari:495", "inBookReference": "Book 8, Hadith 142"}, {"id": 143, "hadithNumber": "496", "text": "Narrated Sahl (bin Sa`d): The distance between the Musalla of Allah's Messenger (ﷺ) and the wall was just sufficient for a sheep to \npass through .", "grade": "Sahih", "narratedBy": "Narrated Sahl (bin Sa`d):", "reference": "https://sunnah.com/bukhari:496", "inBookReference": "Book 8, Hadith 143"}, {"id": 144, "hadithNumber": "497", "text": "Narrated Salama: The distance between the wall of the mosque and the pulpit was hardly enough for a sheep to pass \nthrough.", "grade": "Sahih", "narratedBy": "Narrated Salama:", "reference": "https://sunnah.com/bukhari:497", "inBookReference": "Book 8, Hadith 144"}, {"id": 145, "hadithNumber": "498", "text": "Narrated `Abdullah: The Prophet (ﷺ) used to get a Harba planted in front of him (as a Sutra) and pray behind it.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:498", "inBookReference": "Book 8, Hadith 145"}, {"id": 146, "hadithNumber": "499", "text": "Narrated `Aun bin Abi Juhaifa: that he had heard his father saying, \"Allah's Messenger (ﷺ) came to us at midday and water was brought for \nhis ablution. He performed ablution and led us in Zuhr and `Asr prayers with a short stpear (or stick) \nplanted in front of him (as a Sutra), while women and donkeys were passing beyond it.\"", "grade": "Sahih", "narratedBy": "Narrated `Aun bin Abi Juhaifa:", "reference": "https://sunnah.com/bukhari:499", "inBookReference": "Book 8, Hadith 146"}, {"id": 147, "hadithNumber": "500", "text": "Narrated Anas Ibn Malik: Whenever the Prophet (ﷺ) went for answering the call of nature, I and another boy used to go after him \nwith a staff, a stick or a short spear (or stick) and a tumbler of water and when he finished from \nanswering the call of nature we would hand that tumbler of water to him.", "grade": "Sahih", "narratedBy": "Narrated Anas Ibn Malik:", "reference": "https://sunnah.com/bukhari:500", "inBookReference": "Book 8, Hadith 147"}, {"id": 148, "hadithNumber": "501", "text": "Narrated Abu Juhaifa: Allah's Messenger (ﷺ) came out at midday and offered a two-rak`at Zuhr and `Asr prayers at Al-Batha and a \nshort spear (or stick) was planted in front of him (as a Sutra). He performed ablution and the people \ntook the remaining water left after his ablution and rubbed their bodies with it.", "grade": "Sahih", "narratedBy": "Narrated Abu Juhaifa:", "reference": "https://sunnah.com/bukhari:501", "inBookReference": "Book 8, Hadith 148"}, {"id": 149, "hadithNumber": "502", "text": "Narrated Yazid bin Al `Ubaid: I used to accompany Salama bin Al-Akwa` and he used to pray behind the pillar which was near the \nplace where the Qur'ans were kept. I said, \"O Abu Muslim! I see you always seeking to pray behind \nthis pillar.\" He replied, \"I saw Allah's Messenger (ﷺ) always seeking to pray near that pillar.\"", "grade": "Sahih", "narratedBy": "Narrated Yazid bin Al `Ubaid:", "reference": "https://sunnah.com/bukhari:502", "inBookReference": "Book 8, Hadith 149"}, {"id": 150, "hadithNumber": "503", "text": "Narrated Anas: I saw the most famous people amongst the companions of the Prophet (ﷺ) hurrying towards the pillars at \nthe Maghrib prayer before the Prophet (ﷺ) came for the prayer.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:503", "inBookReference": "Book 8, Hadith 150"}, {"id": 151, "hadithNumber": "504", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) entered the Ka`ba along with Usama bin Zaid, `Uthman bin Talha and Bilal and remained \nthere for a long time. When they came out, I was the first man to enter the Ka`ba. I asked Bilal \n\"Where did the Prophet (ﷺ) pray?\" Bilal replied, \"Between the two front Pillars.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:504", "inBookReference": "Book 8, Hadith 151"}, {"id": 152, "hadithNumber": "505", "text": "Narrated Nafi`: `Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) entered the Ka`ba along with Usama bin Zaid, Bilal and \n`Uthman bin Talha Al-Hajabi and closed the door and stayed there for some time. I asked Bilal when \nhe came out, 'What did the Prophet (ﷺ) do?' He replied, 'He offered prayer with one pillar to his left and \none to his right and three behind.' In those days the Ka`ba was supported by six pillars.\" Malik said: \n\"There were two pillars on his (the Prophet's) right side.\"", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:505", "inBookReference": "Book 8, Hadith 152"}, {"id": 153, "hadithNumber": "506", "text": "Narrated Nafi': Whenever 'Abdullah entered the Ka'bah, he used to go ahead leaving the door of the Ka'bah behind him. He would proceed on till the remaining distance between him and the opposite wall about three cubits. Then he would off prayer there where the Prophet (ﷺ) had offered Salat, as Bilal informed me. Ibn 'Umar said, \"It does not matter for any of us to offer prayers at any place inside the Ka'bah.\"", "grade": "Sahih", "narratedBy": "Narrated Nafi':", "reference": "https://sunnah.com/bukhari:506", "inBookReference": "Book 8, Hadith 153"}, {"id": 154, "hadithNumber": "507", "text": "Narrated Nafi`: \"The Prophet (ﷺ) used to make his she-camel sit across and he would pray facing it (as a Sutra).\" I asked, \n\"What would the Prophet (ﷺ) do if the she-camel was provoked and moved?\" He said, \"He would take its \ncamel-saddle and put it in front of him and pray facing its back part (as a Sutra). And Ibn `Umar used \nto do the same.\" (This indicates that one should not pray except behind a Sutra).", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:507", "inBookReference": "Book 8, Hadith 154"}, {"id": 155, "hadithNumber": "508", "text": "Narrated `Aisha: Do you make us (women) equal to dogs and donkeys? While I used to lie in my bed, the Prophet (ﷺ) \nwould come and pray facing the middle of the bed. I used to consider it not good to stand in front of \nhim in his prayers. So I used to slip away slowly and quietly from the foot of the bed till I got out of \nmy guilt.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:508", "inBookReference": "Book 8, Hadith 155"}, {"id": 156, "hadithNumber": "509", "text": "Narrated Abu Sa`id: The Prophet (ﷺ) said, (what is ascribed to him in the following Hadith): Narrated Abu Salih As-Samman: I saw Abu Sa`id Al-Khudri praying on a Friday, behind something which acted as a Sutra. A young \nman from Bani Abi Mu'ait [??] , wanted to pass in front of him, but Abu Sa`id repulsed him with a \npush on his chest. Finding no alternative he again tried to pass but Abu Sa`id pushed him with a \ngreater force. The young man abused Abu Sa`id and went to Marwan and lodged a complaint against \nAbu Sa`id and Abu Sa`id followed the young man to Marwan who asked him, \"O Abu Sa`id! What \nhas happened between you and the son of your brother?\" Abu Sa`id said to him, \"I heard the Prophet (ﷺ) \nsaying, 'If anybody amongst you is praying behind something as a Sutra and somebody tries to pass in \nfront of him, then he should repulse him and if he refuses, he should use force against him for he is a \nShaitan (a Satan).' \"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:509", "inBookReference": "Book 8, Hadith 156"}, {"id": 157, "hadithNumber": "510", "text": "Narrated Busr bin Sa`id: that Zaid bin Khalid sent him to Abi Juhaim to ask him what he had heard from Allah's Messenger (ﷺ) about \na person passing in front of another person who was praying. Abu Juhaim replied, \"Allah's Messenger (ﷺ) \nsaid, 'If the person who passes in front of another person in prayer knew the magnitude of his sin he \nwould prefer to wait for 40 (days, months or years) rather than to pass in front of him.\" Abu An-Nadr \nsaid, \"I do not remember exactly whether he said 40 days, months or years.\"", "grade": "Sahih", "narratedBy": "Narrated Busr bin Sa`id:", "reference": "https://sunnah.com/bukhari:510", "inBookReference": "Book 8, Hadith 157"}, {"id": 158, "hadithNumber": "511", "text": "Narrated `Aisha: The things which annul the prayers were mentioned before me. They said, \"Prayer is annulled by a \ndog, a donkey and a woman (if they pass in front of the praying people).\" I said, \"You have made us \n(i.e. women) dogs. I saw the Prophet (ﷺ) praying while I used to lie in my bed between him and the Qibla. \nWhenever I was in need of something, I would slip away. for I disliked to face him.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:511", "inBookReference": "Book 8, Hadith 158"}, {"id": 159, "hadithNumber": "512", "text": "Narrated `Aisha: The Prophet (ﷺ) used to pray while I was sleeping across in his bed in front of him. Whenever he wanted \nto pray witr, he would wake me up and I would pray witr.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:512", "inBookReference": "Book 8, Hadith 159"}, {"id": 160, "hadithNumber": "513", "text": "Narrated `Aisha: the wife of the Prophet, \"I used to sleep in front of Allah's Messenger (ﷺ) with my legs opposite his Qibla \n(facing him); and whenever he prostrated, he pushed my feet and I withdrew them and whenever he \nstood, I stretched them.\" `Aisha added, \"In those days there were no lamps in the houses.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:513", "inBookReference": "Book 8, Hadith 160"}, {"id": 161, "hadithNumber": "514", "text": "Narrated `Aisha: The things which annul prayer were mentioned before me (and those were): a dog, a donkey and a \nwoman. I said, \"You have compared us (women) to donkeys and dogs. By Allah! I saw the Prophet (ﷺ) \npraying while I used to lie in (my) bed between him and the Qibla. Whenever I was in need of \nsomething, I disliked to sit and trouble the Prophet. So, I would slip away by the side of his feet.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:514", "inBookReference": "Book 8, Hadith 161"}, {"id": 162, "hadithNumber": "515", "text": "Narrated `Aisha: (the wife of the Prophet) Allah's Messenger (ﷺ) used to get up at night and pray while I used to lie across \nbetween him and the Qibla on his family's bed.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:515", "inBookReference": "Book 8, Hadith 162"}, {"id": 163, "hadithNumber": "516", "text": "Narrated Abu Qatada Al-Ansari: Allah's Messenger (ﷺ) was praying and he was carrying Umama the daughters of Zainab, the daughter of \nAllah's Messenger (ﷺ) and she was the daughter of 'As bin Rabi`a bin `Abd Shams. When he prostrated, he \nput her down and when he stood, he carried her (on his neck).", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada Al-Ansari:", "reference": "https://sunnah.com/bukhari:516", "inBookReference": "Book 8, Hadith 163"}, {"id": 164, "hadithNumber": "517", "text": "Narrated Maimuna bint Al-Harith: My bed was beside the praying place (Musalla) of the Prophet (ﷺ) and sometimes his garment fell on me \nwhile I used to lie in my bed.", "grade": "Sahih", "narratedBy": "Narrated Maimuna bint Al-Harith:", "reference": "https://sunnah.com/bukhari:517", "inBookReference": "Book 8, Hadith 164"}, {"id": 165, "hadithNumber": "518", "text": "Narrated Maimuna: The Prophet (ﷺ) used to pray while I used to sleep beside him during my periods (menses) and in \nprostration his garment used to touch me.", "grade": "Sahih", "narratedBy": "Narrated Maimuna:", "reference": "https://sunnah.com/bukhari:518", "inBookReference": "Book 8, Hadith 165"}, {"id": 166, "hadithNumber": "519", "text": "Narrated `Aisha: It is not good that you people have made us (women) equal to dogs and donkeys. No doubt I saw \nAllah's Messenger (ﷺ) praying while I used to lie between him and the Qibla and when he wanted to \nprostrate, he pushed my legs and I withdrew them.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:519", "inBookReference": "Book 8, Hadith 166"}, {"id": 167, "hadithNumber": "520", "text": "Narrated `Amr bin Maimun [??]: `Abdullah bin Mas`ud said, \"While Allah's Messenger (ﷺ) was praying beside the Ka`ba, there were some \nQuraish people sitting in a gathering. One of them said, 'Don't you see this (who does deeds just to \nshow off)? Who amongst you can go and bring the dung, blood and the Abdominal contents \n(intestines, etc.) of the slaughtered camels of the family of so and so and then wait till he prostrates \nand put that in between his shoulders?' The most unfortunate amongst them (`Uqba bin Abi Mu'ait) \nwent (and brought them) and when Allah's Messenger (ﷺ) prostrated, he put them between his shoulders. The \nProphet remained in prostration and they laughed so much so that they fell on each other. A passerby \nwent to Fatima, who was a young girl in those days. She came running and the Prophet (ﷺ) was still in \nprostration. She removed them and cursed upon the Quraish on their faces. When Allah's Messenger (ﷺ) \ncompleted his prayer, he said, 'O Allah! Take revenge on Quraish.' He said so thrice and added, 'O \nAllah! take revenge on `Amr bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, \nUmaiya bin Khalaf, `Uqba bin Abi Mu'ait and `Umar a bin Al-Walid.\" `Abdullah added, \"By Allah! I \nsaw all of them dead in the battle field on the day of Badr and they were dragged and thrown in the \nQalib (a well) at Badr: Allah's Messenger (ﷺ) then said, 'Allah's curse has descended upon the people of the \nQalib (well).", "grade": "Sahih", "narratedBy": "Narrated `Amr bin Maimun [??]:", "reference": "https://sunnah.com/bukhari:520", "inBookReference": "Book 8, Hadith 167"}]}