{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 9, "bookName": "Chapter: The times of As-Salat (the prayers) and the superiority of offering Salat (prayers) in time", "hadiths": [{"id": 1, "hadithNumber": "521", "text": "Narrated Ibn Shihab: Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair went to him and said, \n\"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him \nand said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer \n(Fajr prayer) and Allah's Messenger (ﷺ) prayed too, then he prayed again (Zuhr prayer) and so did Allah's \nApostle and again he prayed (`Asr prayers and Allah's Messenger (ﷺ) did the same; again he prayed \n(Maghrib-prayer) and so did Allah's Messenger (ﷺ) and again prayed (`Isha prayer) and so did Allah's \nApostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" \n`Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Messenger (ﷺ) \nat the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud narrated like this on the \nauthority of his father.\" `Urwa added, \"Aisha told me that Allah's Messenger (ﷺ) used to pray `Asr prayer \nwhen the sunshine was still inside her residence (during the early time of `Asr).", "grade": "Sahih", "narratedBy": "Narrated Ibn Shihab:", "reference": "https://sunnah.com/bukhari:521", "inBookReference": "Book 9, Hadith 1"}, {"id": 2, "hadithNumber": "523", "text": "Narrated Ibn `Abbas: \"Once a delegation of `Abdul Qais came to Allah's Messenger (ﷺ) and said, \"We belong to such and such \nbranch of the tribe of Rabi'ah and we can only come to you in the sacred months. Order us to do \nsomething good so that we may take it from you and also invite to it those whom we have left behind (at home).\" So he said, \"I order you to do four things and forbid you from four \nthings:  To believe in Allah\" - and then he explained it to them \"to testify that none has the right to be \nworshipped but Allah and that I am Allah's Messenger (ﷺ), to establish the prayers (at the stated times), to pay the Zakat (obligatory charity), to hand me the Khumus (fifth) if you acquire spoils of war. And I forbid from (using) Dubba, Hantam, Muqaiyyar, and Naqir (all these were utensils used for the preparation of alcoholic drinks).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:523", "inBookReference": "Book 9, Hadith 2"}, {"id": 3, "hadithNumber": "524", "text": "Narrated Jarir bin `Abdullah: I gave the pledge of allegiance to Allah's Messenger (ﷺ) for to offer prayers perfectly, to pay Zakat regularly, \nand to give good advice to every Muslim.", "grade": "Sahih", "narratedBy": "Narrated Jarir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:524", "inBookReference": "Book 9, Hadith 3"}, {"id": 4, "hadithNumber": "525", "text": "Narrated Shaqiq: that he had heard Hudhaifa saying, \"Once I was sitting with `Umar and he said, 'Who amongst you \nremembers the statement of Allah's Messenger (ﷺ) about the afflictions?' I said, 'I know it as the Prophet (ﷺ) had \nsaid it.' `Umar said, 'No doubt you are bold.' I said, 'The afflictions caused for a man by his wife, \nmoney, children and neighbor are expiated by his prayers, fasting, charity and by enjoining (what is \ngood) and forbidding (what is evil).' `Umar said, 'I did not mean that but I asked about that affliction \nwhich will spread like the waves of the sea.' I (Hudhaifa) said, 'O leader of the faithful believers! You \nneed not be afraid of it as there is a closed door between you and it.' `Umar asked, Will the door be \nbroken or opened?' I replied, 'It will be broken.' `Umar said, 'Then it will never be closed again.' I was \nasked whether `Umar knew that door. I replied that he knew it as one knows that there will be night \nbefore the tomorrow morning. I narrated a Hadith that was free from any misstatement\" The subnarrator \nadded that they deputized Masruq to ask Hudhaifa (about the door). Hudhaifa said, \"The door \nwas `Umar himself.\"", "grade": "Sahih", "narratedBy": "Narrated Shaqiq:", "reference": "https://sunnah.com/bukhari:525", "inBookReference": "Book 9, Hadith 4"}, {"id": 5, "hadithNumber": "526", "text": "Narrated Ibn Mas`ud: A man kissed a woman (unlawfully) and then went to the Prophet (ﷺ) and informed him. Allah revealed: \nAnd offer prayers perfectly At the two ends of the day And in some hours of the night (i.e. the five \ncompulsory prayers). Verily! good deeds remove (annul) the evil deeds (small sins) (11.114). The \nman asked Allah's Messenger (ﷺ), \"Is it for me?\" He said, \"It is for all my followers.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Mas`ud:", "reference": "https://sunnah.com/bukhari:526", "inBookReference": "Book 9, Hadith 5"}, {"id": 6, "hadithNumber": "527", "text": "Narrated `Abdullah: I asked the Prophet (ﷺ) \"Which deed is the dearest to Allah?\" He replied, \"To offer the prayers at their \nearly stated fixed times.\" I asked, \"What is the next (in goodness)?\" He replied, \"To be good and \ndutiful to your parents\" I again asked, \"What is the next (in goodness)?\" He replied, 'To participate in \nJihad (religious fighting) in Allah's cause.\" `Abdullah added, \"I asked only that much and if I had \nasked more, the Prophet (ﷺ) would have told me more.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:527", "inBookReference": "Book 9, Hadith 6"}, {"id": 7, "hadithNumber": "528", "text": "Narrated Abu Huraira: I heard Allah's Messenger (ﷺ) saying, \"If there was a river at the door of anyone of you and he took a bath in \nit five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" \nThe Prophet (ﷺ) added, \"That is the example of the five prayers with which Allah blots out (annuls) evil \ndeeds.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:528", "inBookReference": "Book 9, Hadith 7"}, {"id": 8, "hadithNumber": "529", "text": "Narrated Ghailan: Anas said, \"I do not find (now-a-days) things as they were (practiced)\n     at the time of the Prophet.\" Somebody said \"The prayer (is as it \n     was.)\" Anas said, \"Have you not done in the prayer what you have \n     done?", "grade": "Sahih", "narratedBy": "Narrated Ghailan:", "reference": "https://sunnah.com/bukhari:529", "inBookReference": "Book 9, Hadith 8"}, {"id": 9, "hadithNumber": "530", "text": "Narrated Az-Zuhri that he visited Anas bin Malik at Damascus and found\n     him weeping and asked him why he was weeping. He replied, \"I do not \n     know anything which I used to know during the life-time of Allah's \n     Apostle except this prayer which is being lost (not offered as it \n     should be).\"", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:530", "inBookReference": "Book 9, Hadith 9"}, {"id": 10, "hadithNumber": "531", "text": "Narrated Anas: The Prophet (ﷺ) said, \"Whenever anyone of you offers his prayer he is speaking in private to his Lord. So \nhe should not spit to his right but under his left foot.\" Qatada said, \"He should not spit in front of him \nbut to his left or under his feet.\" And Shu`ba said, \"He should not spit in front of him, nor to his right \nbut to his left or under his foot.\" Anas said: The Prophet (ﷺ) said, \"He should neither spit in the direction \nof his Qibla nor to his right but to his left or under his foot.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:531", "inBookReference": "Book 9, Hadith 10"}, {"id": 11, "hadithNumber": "532", "text": "Narrated Anas: The Prophet (ﷺ) said, \"Do the prostration properly and do not put your forearms flat with elbows touching \nthe ground like a dog. And if you want to spit, do not spit in front, nor to the right for the person in \nprayer is speaking in private to his Lord.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:532", "inBookReference": "Book 9, Hadith 11"}, {"id": 12, "hadithNumber": "533", "text": "Narrated Abu Huraira and `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"If it is very hot, then pray the Zuhr prayer when it becomes (a bit) cooler, as the \nseverity of the heat is from the raging of the Hell-fire.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira and `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:533", "inBookReference": "Book 9, Hadith 12"}, {"id": 13, "hadithNumber": "535", "text": "Narrated Abu Dhar: The Mu'adh-dhin (call-maker) of the Prophet (ﷺ) pronounced the Adhan (call) for the Zuhr prayer but the \nProphet said, \"Let it be cooler, let it be cooler.\" Or said, 'Wait, wait, because the severity of heat is \nfrom the raging of the Hell-fire. In severe hot weather, pray when it becomes (a bit) cooler and the \nshadows of hillocks appear.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Dhar:", "reference": "https://sunnah.com/bukhari:535", "inBookReference": "Book 9, Hadith 13"}, {"id": 14, "hadithNumber": "536", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"In very hot weather delay the Zuhr prayer till it becomes (a bit) cooler because the \nseverity of heat is from the raging of the Hell-fire. The Hell-fire of Hell complained to its Lord saying: \nO Lord! My parts are eating (destroying) one another. So Allah allowed it to take two breaths, one in \nthe winter and the other in the summer. The breath in the summer is at the time when you feel the \nseverest heat and the breath in the winter is at the time when you feel the severest cold.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:536", "inBookReference": "Book 9, Hadith 14"}, {"id": 15, "hadithNumber": "538", "text": "Narrated Abu Sa`id: that Allah's Messenger (ﷺ) said, \"Pray Zuhr prayer when it becomes (a bit) cooler as the severity of heat is \nfrom the raging of the Hell-fire.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:538", "inBookReference": "Book 9, Hadith 15"}, {"id": 16, "hadithNumber": "539", "text": "Narrated Abu Dhar Al-Ghifar: We were with the Prophet (ﷺ) on a journey and the Mu'adh-dhin (call maker for the prayer) wanted to \npronounce the Adhan (call) for the Zuhr prayer. The Prophet (ﷺ) said, 'Let it become cooler.\" He again \n(after a while) wanted to pronounce the Adhan but the Prophet (ﷺ) said to him, \"Let it become cooler till \nwe see the shadows of hillocks.\" The Prophet (ﷺ) added, \"The severity of heat is from the raging of the \nHell-fire, and in very hot weather pray (Zuhr) when it becomes cooler.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Dhar Al-Ghifar:", "reference": "https://sunnah.com/bukhari:539", "inBookReference": "Book 9, Hadith 16"}, {"id": 17, "hadithNumber": "540", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) came out as the sun declined at midday and offered the Zuhr prayer. He then stood on \nthe pulpit and spoke about the Hour (Day of Judgment) and said that in it there would be tremendous \nthings. He then said, \"Whoever likes to ask me about anything he can do so and I shall reply as long as \nI am at this place of mine. Most of the people wept and the Prophet (ﷺ) said repeatedly, \"Ask me.\" \n`Abdullah bin Hudhafa As-Sahmi stood up and said, \"Who is my father?\" The Prophet (ﷺ) said, \"Your \nfather is Hudhafa.\" The Prophet (ﷺ) repeatedly said, \"Ask me.\" Then `Umar knelt before him and said, \n\"We are pleased with Allah as our Lord, Islam as our religion, and Muhammad as our Prophet.\" The \nProphet then became quiet and said, \"Paradise and Hell-fire were displayed in front of me on this wall \njust now and I have never seen a better thing (than the former) and a worse thing (than the latter).", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:540", "inBookReference": "Book 9, Hadith 17"}, {"id": 18, "hadithNumber": "541", "text": "Narrated Abu Al-Minhal: Abu Barza said, \"The Prophet (ﷺ) used to offer the Fajr (prayer) when one could recognize the person \nsitting by him (after the prayer) and he used to recite between 60 to 100 Ayat (verses) of the Qur'an. \nHe used to offer the Zuhr prayer as soon as the sun declined (at noon) and the `Asr at a time when a \nman might go and return from the farthest place in Medina and find the sun still hot. (The sub-narrator \nforgot what was said about the Maghrib). He did not mind delaying the `Isha prayer to one third of the \nnight or the middle of the night.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Minhal:", "reference": "https://sunnah.com/bukhari:541", "inBookReference": "Book 9, Hadith 18"}, {"id": 19, "hadithNumber": "542", "text": "Narrated Anas bin Malik: When we offered the Zuhr prayers behind Allah's Messenger (ﷺ) we used to prostrate on our clothes to \nprotect ourselves from the heat.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:542", "inBookReference": "Book 9, Hadith 19"}, {"id": 20, "hadithNumber": "543", "text": "Narrated Ibn `Abbas: \"The Prophet (ﷺ) prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers \nin Medina.\" Aiyub said, \"Perhaps those were rainy nights.\" Anas said, \"May be.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:543", "inBookReference": "Book 9, Hadith 20"}, {"id": 21, "hadithNumber": "544", "text": "Narrated Aisha: Allah's Messenger (ﷺ) used to offer the `Asr prayer when the sunshine had not disappeared from my \nchamber.", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:544", "inBookReference": "Book 9, Hadith 21"}, {"id": 22, "hadithNumber": "545", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) used to offer the `Asr prayers at a time when the sunshine was still inside my chamber \nand no shadow had yet appeared in it.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:545", "inBookReference": "Book 9, Hadith 22"}, {"id": 23, "hadithNumber": "546", "text": "Narrated Aisha: The Prophet (ﷺ) used to pray the `Asr prayers at a time when the sunshine was still inside my chamber \nand no shadow had yet appeared in it.", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:546", "inBookReference": "Book 9, Hadith 23"}, {"id": 24, "hadithNumber": "547", "text": "Narrated Saiyar bin Salama: I along with my father went to Abu- Barza Al-Aslami and my father asked him, \"How Allah's Messenger (ﷺ) \nused to offer the five compulsory congregational prayers?\" Abu- Barza said, \"The Prophet (ﷺ) used to \npray the Zuhr prayer which you (people) call the first one at midday when the sun had just declined \nThe `Asr prayer at a time when after the prayer, a man could go to the house at the farthest place in \nMedina (and arrive) while the sun was still hot. (I forgot about the Maghrib prayer). The Prophet (ﷺ) \nLoved to delay the `Isha which you call Al- `Atama [??] and he disliked sleeping before it and \nspeaking after it. After the Fajr prayer he used to leave when a man could recognize the one sitting \nbeside him and he used to recite between 60 to 100 Ayat (in the Fajr prayer) .", "grade": "Sahih", "narratedBy": "Narrated Saiyar bin Salama:", "reference": "https://sunnah.com/bukhari:547", "inBookReference": "Book 9, Hadith 24"}, {"id": 25, "hadithNumber": "548", "text": "Narrated Anas bin Malik: We used to pray the `Asr prayer and after that if someone happened to go to the tribe of Bani `Amr \nbin `Auf, he would find them still praying the `Asr (prayer).", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:548", "inBookReference": "Book 9, Hadith 25"}, {"id": 26, "hadithNumber": "549", "text": "Narrated Abu Bakr bin `Uthman bin Sahl bin Hunaif: that he heard Abu Umama saying: We prayed the Zuhr prayer with `Umar bin `Abdul `Aziz and then \nwent to Anas bin Malik and found him offering the `Asr prayer. I asked him, \"O uncle! Which prayer \nhave you offered?\" He said 'The `Asr and this is (the time of) the prayer of Allah s Apostle which we \nused to pray with him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Bakr bin `Uthman bin Sahl bin Hunaif:", "reference": "https://sunnah.com/bukhari:549", "inBookReference": "Book 9, Hadith 26"}, {"id": 27, "hadithNumber": "550", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) used to offer the `Asr prayer at a time when the sun was still hot and high and if a \nperson went to Al-`Awali (a place) of Medina, he would reach there when the sun was still high. Some \nof Al-`Awali of Medina were about four miles or so from the town.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:550", "inBookReference": "Book 9, Hadith 27"}, {"id": 28, "hadithNumber": "551", "text": "Narrated Anas bin Malik: We used to pray the `Asr and after that if one of US went to Quba' he would arrive there while the sun \nwas still high.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:551", "inBookReference": "Book 9, Hadith 28"}, {"id": 29, "hadithNumber": "552", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"Whoever misses the `Asr prayer (intentionally) then it is as if he lost his family \nand property.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:552", "inBookReference": "Book 9, Hadith 29"}, {"id": 30, "hadithNumber": "553", "text": "Narrated Abu Al-Mahh [??]: We were with Buraida in a battle on a cloudy day and he said, \"Offer the `Asr prayer early as the \nProphet said, \"Whoever leaves the `Asr prayer, all his (good) deeds will be annulled.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Mahh [??]:", "reference": "https://sunnah.com/bukhari:553", "inBookReference": "Book 9, Hadith 30"}, {"id": 31, "hadithNumber": "554", "text": "Narrated Qais: Jarir said, \"We were with the Prophet (ﷺ) and he looked at the moon--full-moon--and said, 'Certainly you \nwill see your Lord as you see this moon and you will have no trouble in seeing Him. So if you can \navoid missing (through sleep or business, etc.) a prayer before the sunrise (Fajr) and a prayer before \nsunset (`Asr), you must do so.' He then recited Allah's Statement: \nAnd celebrate the praises Of your Lord before the rising of the sun and before (its) setting.\" (50.39) \nIsma`il said, \"Offer those prayers and do not miss them.\"", "grade": "Sahih", "narratedBy": "Narrated Qais:", "reference": "https://sunnah.com/bukhari:554", "inBookReference": "Book 9, Hadith 31"}, {"id": 32, "hadithNumber": "555", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Angels come to you in succession by night and day and all of them get together \nat the time of the Fajr and `Asr prayers. Those who have passed the night with you (or stayed with \nyou) ascend (to the Heaven) and Allah asks them, though He knows everything about you, well, \"In \nwhat state did you leave my slaves?\" The angels reply: \"When we left them they were praying and \nwhen we reached them, they were praying.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:555", "inBookReference": "Book 9, Hadith 32"}, {"id": 33, "hadithNumber": "556", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"If anyone of you can get one rak`a of the `Asr prayer before sunset, he should \ncomplete his prayer. If any of you can get one rak`a of the Fajr prayer before sunrise, he should \ncomplete his prayer.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:556", "inBookReference": "Book 9, Hadith 33"}, {"id": 34, "hadithNumber": "557", "text": "Narrated Salim bin `Abdullah: My father said, \"I heard Allah's Messenger (ﷺ) saying, 'The period of your stay as compared to the previous \nnations is like the period equal to the time between the `Asr prayer and sunset. The people of the \nTorah were given the Torah and they acted (upon it) till midday then they were exhausted and were \ngiven one Qirat (of gold) each. And then the people of the Gospel were given the Gospel and they \nacted (upon it) till the `Asr prayer then they were exhausted and were! given one Qirat each. And then \nwe were given the Qur'an and we acted (upon it) till sunset and we were given two Qirats each. On \nthat the people of both the scriptures said, 'O our Lord! You have given them two Qirats and given us \none Qirat, though we have worked more than they.' Allah said, 'Have I usurped some of your right?' \nThey said, 'No.' Allah said: \"That is my blessing I bestow upon whomsoever I wish.\"", "grade": "Sahih", "narratedBy": "Narrated Salim bin `Abdullah:", "reference": "https://sunnah.com/bukhari:557", "inBookReference": "Book 9, Hadith 34"}, {"id": 35, "hadithNumber": "558", "text": "Narrated Abu Musa: The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night. They worked till midday and they said, \n'We are not in need of your reward.' So the man employed another batch and said to them, 'Complete \nthe rest of the day and yours will be the wages I had fixed (for the first batch). They worked until the \ntime of the `Asr prayer and said, 'Whatever we have done is for you.' He employed another batch. \nThey worked for the rest of the day till sunset, and they received the wages of the two former \nbatches.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/bukhari:558", "inBookReference": "Book 9, Hadith 35"}, {"id": 36, "hadithNumber": "559", "text": "Narrated Rafi` bin Khadij: We used to offer the Maghrib prayer with the Prophet (ﷺ) and after finishing the prayer one of us may go \naway and could still see as Par as the spots where one's arrow might reach when shot by a bow.", "grade": "Sahih", "narratedBy": "Narrated Rafi` bin Khadij:", "reference": "https://sunnah.com/bukhari:559", "inBookReference": "Book 9, Hadith 36"}, {"id": 37, "hadithNumber": "560", "text": "Narrated Jabir bin `Abdullah: The Prophet (ﷺ) used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the \nMaghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people \nassembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the \nprayer. And they or the Prophet (ﷺ) used to offer the Fajr Prayers when it still dark.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:560", "inBookReference": "Book 9, Hadith 37"}, {"id": 38, "hadithNumber": "561", "text": "Narrated Salama: We used to pray the Maghrib prayer with the Prophet (ﷺ) when the sun disappeared from the horizon.", "grade": "Sahih", "narratedBy": "Narrated Salama:", "reference": "https://sunnah.com/bukhari:561", "inBookReference": "Book 9, Hadith 38"}, {"id": 39, "hadithNumber": "562", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) prayed seven rak`at together and eight rak`at together.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:562", "inBookReference": "Book 9, Hadith 39"}, {"id": 40, "hadithNumber": "563", "text": "Narrated `Abdullah Al-Muzani: The Prophet (ﷺ) said, \"Do not be influenced by bedouins regarding the name of your Maghrib prayer \nwhich is called `Isha' by them.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah Al-Muzani:", "reference": "https://sunnah.com/bukhari:563", "inBookReference": "Book 9, Hadith 40"}, {"id": 41, "hadithNumber": "564", "text": "Narrated `Abdullah: \"One night Allah's Messenger (ﷺ) led us in the `Isha' prayer and that is the one called Al-`Atma [??] by the \npeople. After the completion of the prayer, he faced us and said, \"Do you know the importance of this \nnight? Nobody present on the surface of the earth tonight will be living after one hundred years from \nthis night.\" (See Hadith No. 575).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:564", "inBookReference": "Book 9, Hadith 41"}, {"id": 42, "hadithNumber": "565", "text": "Narrated Muhammad bin `Amr: We asked Jabir bin `Abdullah about the prayers of the Prophet (ﷺ) . He said, \"He used to pray Zuhr prayer \nat midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The \n`Isha was offered early if the people gathered, and used to be delayed if their number was less; and the \nmorning prayer was offered when it was still dark. \"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin `Amr:", "reference": "https://sunnah.com/bukhari:565", "inBookReference": "Book 9, Hadith 42"}, {"id": 43, "hadithNumber": "566", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) once delayed the `Isha' prayer and that was during the days when Islam still had not \nspread. The Prophet (ﷺ) did not come out till `Umar informed him that the women and children had slept. \nThen he came out and said to the people of the mosque: \"None amongst the dwellers of the earth has \nbeen waiting for it (`Isha prayer) except you.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:566", "inBookReference": "Book 9, Hadith 43"}, {"id": 44, "hadithNumber": "567", "text": "Narrated Abu Musa: My companions, who came with me in the boat and I landed at a place called Baqi [??] Buthan [??] . \nThe Prophet (ﷺ) was in Medina at that time. One of us used to go to the Prophet (ﷺ) by turns every night at \nthe time of the `Isha prayer. Once I along with my companions went to the Prophet (ﷺ) and he was busy in \nsome of his affairs, so the `Isha' prayer was delayed to the middle of the night He then came out and \nled the people (in prayer). After finishing from the prayer, he addressed the people present there \nsaying, \"Be patient! Don't go away. Have the glad tiding. It is from the blessing of Allah upon you \nthat none amongst mankind has prayed at this time save you.\" Or said, \"None except you has prayed \nat this time.\" Abu Musa added, 'So we returned happily after what we heard from Allah's Messenger (ﷺ) .\"", "grade": "Sahih", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/bukhari:567", "inBookReference": "Book 9, Hadith 44"}, {"id": 45, "hadithNumber": "568", "text": "Narrated Abu Barza: Allah's Messenger (ﷺ) disliked to sleep before the `Isha' prayer and to talk after it.", "grade": "Sahih", "narratedBy": "Narrated Abu Barza:", "reference": "https://sunnah.com/bukhari:568", "inBookReference": "Book 9, Hadith 45"}, {"id": 46, "hadithNumber": "569", "text": "Narrated Ibn Shihab from `Urwa: `Aisha said, \"Once Allah's Messenger (ﷺ) delayed the `Isha' prayer till `Umar reminded him by saying, \"The \nprayer!\" The women and children have slept. Then the Prophet (ﷺ) came out and said, 'None amongst the \ndwellers of the earth has been waiting for it (the prayer) except you.\" `Urwa said, \"Nowhere except in \nMedina the prayer used to be offered (in those days).\" He further said, \"The Prophet (ﷺ) used to offer the \n`Isha' prayer in the period between the disappearance of the twilight and the end of the first third of \nthe night.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Shihab from `Urwa:", "reference": "https://sunnah.com/bukhari:569", "inBookReference": "Book 9, Hadith 46"}, {"id": 47, "hadithNumber": "570", "text": "Narrated Ibn Juraij from Nafi`: `Abdullah bin `Umar said, \"Once Allah's Messenger (ﷺ) was busy (at the time of the `Isha'), so the prayer \nwas delayed so much so that we slept and woke up and slept and woke up again. The Prophet (ﷺ) came \nout and said, 'None amongst the dwellers of the earth but you have been waiting for the prayer.\" Ibn \n`Umar did not find any harm in praying it earlier or in delaying it unless he was afraid that sleep might \noverwhelm him and he might miss the prayer, and sometimes he used to sleep before the `Isha' prayer. \nIbn Juraij said, \"I said to `Ata', 'I heard Ibn `Abbas saying: Once Allah's Messenger (ﷺ) delayed the `Isha' \nprayer to such an extent that the people slept and got up and slept again and got up again. Then `Umar \nbin Al-Khattab I, stood up and reminded the Prophet (ﷺ) I of the prayer.' `Ata' said, 'Ibn `Abbas said: The \nProphet came out as if I was looking at him at this time, and water was trickling from his head and he \nwas putting his hand on his head and then said, 'Hadn't I thought it hard for my followers, I would \nhave ordered them to pray (`Isha' prayer) at this time.' I asked `Ata' for further information, how the \nProphet had kept his hand on his head as he was told by Ibn `Abbas. `Ata' separated his fingers \nslightly and put their tips on the side of the head, brought the fingers downwards approximating them \ntill the thumb touched the lobe of the ear at the side of the temple and the beard on the face. He neither \nslowed nor hurried in this action but he acted like that. The Prophet (ﷺ) said: \"Hadn't I thought it hard for \nmy followers I would have ordered them to pray at this time.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Juraij from Nafi`:", "reference": "https://sunnah.com/bukhari:570", "inBookReference": "Book 9, Hadith 47"}, {"id": 48, "hadithNumber": "572", "text": "Narrated Anas: The Prophet (ﷺ) delayed the `Isha' prayer till midnight and then he offered the prayer and said, \"The \npeople prayed and slept but you have been in prayer as long as you have been waiting for it (the \nprayer).\" Anas added: As if I am looking now at the glitter of the ring of the Prophet (ﷺ) on that night.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:572", "inBookReference": "Book 9, Hadith 48"}, {"id": 49, "hadithNumber": "573", "text": "Narrated Jarir bin `Abdullah: We were with the Prophet (ﷺ) on a full moon night. He looked at the moon and said, \"You will certainly \nsee your Lord as you see this moon, and there will be no trouble in seeing Him. So if you can avoid \nmissing (through sleep, business, etc.) a prayer before the rising of the sun (Fajr) and before its setting \n(`Asr) you must do so. He (the Prophet (ﷺ) ) then recited the following verse: \nAnd celebrate the praises Of Your Lord before The rising of the sun And before (its) setting.\" (50.39)", "grade": "Sahih", "narratedBy": "Narrated Jarir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:573", "inBookReference": "Book 9, Hadith 49"}, {"id": 50, "hadithNumber": "574", "text": "Narrated Abu Bakr bin Abi Musa: My father said, \"Allah's Messenger (ﷺ) said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to \nParadise.' \"", "grade": "Sahih", "narratedBy": "Narrated Abu Bakr bin Abi Musa:", "reference": "https://sunnah.com/bukhari:574", "inBookReference": "Book 9, Hadith 50"}, {"id": 51, "hadithNumber": "575", "text": "Narrated Anas: Zaid bin Thabit said, \"We took the \"Suhur\" (the meal taken before dawn while fasting is observed) \nwith the Prophet (ﷺ) and then stood up for the (morning) prayer.\" I asked him how long the interval \nbetween the two (Suhur and prayer) was. He replied, 'The interval between the two was just sufficient \nto recite fifty to Sixth 'Ayat.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:575", "inBookReference": "Book 9, Hadith 51"}, {"id": 52, "hadithNumber": "576", "text": "Narrated Qatada: Anas bin Malik said, \"The Prophet (ﷺ) and Zaid bin Thabit took the 'Suhur' together and after finishing \nthe meal, the Prophet (ﷺ) stood up and prayed (Fajr prayer).\" I asked Anas, \"How long was the interval \nbetween finishing their 'Suhur' and starting the prayer?\" He replied, \"The interval between the two \nwas just sufficient to recite fifty 'Ayat.\" (Verses of the Qur'an).", "grade": "Sahih", "narratedBy": "Narrated Qatada:", "reference": "https://sunnah.com/bukhari:576", "inBookReference": "Book 9, Hadith 52"}, {"id": 53, "hadithNumber": "577", "text": "Narrated Sahl bin Sa`d: I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) \nwith Allah's Messenger (ﷺ).", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Sa`d:", "reference": "https://sunnah.com/bukhari:577", "inBookReference": "Book 9, Hadith 53"}, {"id": 54, "hadithNumber": "578", "text": "Narrated `Aisha: The believing women covered with their veiling sheets used to attend the Fajr prayer with Allah's \nApostle, and after finishing the prayer they would return to their home and nobody could recognize \nthem because of darkness.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:578", "inBookReference": "Book 9, Hadith 54"}, {"id": 55, "hadithNumber": "579", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the \n(morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the \n(`Asr) prayer.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:579", "inBookReference": "Book 9, Hadith 55"}, {"id": 56, "hadithNumber": "580", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Whoever could get one rak`a of a prayer, (in its proper time) he has got the \nprayer.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:580", "inBookReference": "Book 9, Hadith 56"}, {"id": 57, "hadithNumber": "581", "text": "Narrated `Umar: \"The Prophet (ﷺ) forbade praying after the Fajr prayer till the sun rises and after the `Asr prayer till the \nsun sets.\" Narrated Ibn `Abbas: Some people told me the same narration (as above).", "grade": "Sahih", "narratedBy": "Narrated `Umar:", "reference": "https://sunnah.com/bukhari:581", "inBookReference": "Book 9, Hadith 57"}, {"id": 58, "hadithNumber": "582", "text": "Narrated Hisham's father: Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'Do not pray at the time of sunrise and at the time of sunset.' \" \nIbn `Umar said, \"Allah's Messenger (ﷺ) said, 'If the edge of the sun appears (above the horizon) delay the \nprayer till it becomes high, and if the edge of the sun disappears, delay the prayer till it sets \n(disappears completely).' \"", "grade": "Sahih", "narratedBy": "Narrated Hisham's father:", "reference": "https://sunnah.com/bukhari:582", "inBookReference": "Book 9, Hadith 58"}, {"id": 59, "hadithNumber": "584", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) forbade two kinds of sales, two kinds of dresses, and two prayers. He forbade offering \nprayers after the Fajr prayer till the rising of the sun and after the `Asr prayer till its setting. He also \nforbade \"Ishtimal-Assama [??] \" and \"al-Ihtiba\" in one garment in such a way that one's private parts \nare exposed towards the sky. He also forbade the sales called \"Munabadha\" and \"Mulamasa.\" (See \nHadith No. 354 and 355 Vol. 3).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:584", "inBookReference": "Book 9, Hadith 59"}, {"id": 60, "hadithNumber": "585", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"None of you should try to pray at sunrise or sunset.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:585", "inBookReference": "Book 9, Hadith 60"}, {"id": 61, "hadithNumber": "586", "text": "Narrated Abu Sa`id Al-Khudri: I heard Allah's Messenger (ﷺ) saying, \"There is no prayer after the morning prayer till the sun rises, and there \nis no prayer after the `Asr prayer till the sun sets.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:586", "inBookReference": "Book 9, Hadith 61"}, {"id": 62, "hadithNumber": "587", "text": "Narrated Muawiya: You offer a prayer which I did not see being offered by Allah's Messenger (ﷺ) when we were in his company \nand he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).", "grade": "Sahih", "narratedBy": "Narrated Muawiya:", "reference": "https://sunnah.com/bukhari:587", "inBookReference": "Book 9, Hadith 62"}, {"id": 63, "hadithNumber": "588", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) forbade the offering of two prayers: \n-1. after the morning prayer till the sunrises. \n-2. after the `Asr prayer till the sun sets.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:588", "inBookReference": "Book 9, Hadith 63"}, {"id": 64, "hadithNumber": "589", "text": "Narrated Ibn `Umar: I pray as I saw my companions praying. I do not forbid praying at any time during the day or night \nexcept at sunset and sunrise.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:589", "inBookReference": "Book 9, Hadith 64"}, {"id": 65, "hadithNumber": "590", "text": "Narrated `Aisha: By Allah, Who took away the Prophet. The Prophet (ﷺ) never missed them (two rak`at) after the `Asr \nprayer till he met Allah and he did not meet Allah till it became heavy for him to pray while standing \nso he used to offer most of the prayers while sitting. (She meant the two rak`at after `Asr) He used to \npray them in the house and never prayed them in the mosque lest it might be hard for his followers \nand he loved what was easy for them .", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:590", "inBookReference": "Book 9, Hadith 65"}, {"id": 66, "hadithNumber": "591", "text": "Narrated Hisham's father: `Aisha (addressing me) said, \"O son of my sister! The Prophet (ﷺ) never missed two prostrations (i.e. \nrak`at) after the `Asr prayer in my house.\"", "grade": "Sahih", "narratedBy": "Narrated Hisham's father:", "reference": "https://sunnah.com/bukhari:591", "inBookReference": "Book 9, Hadith 66"}, {"id": 67, "hadithNumber": "592", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) never missed two rak`at before the Fajr prayer and after the `Asr prayer openly and \nsecretly.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:592", "inBookReference": "Book 9, Hadith 67"}, {"id": 68, "hadithNumber": "593", "text": "Narrated `Aisha: Whenever the Prophet (ﷺ) come to me after the `Asr prayer, he always prayed two rak`at.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:593", "inBookReference": "Book 9, Hadith 68"}, {"id": 69, "hadithNumber": "594", "text": "Narrated Ibn Abu Malih [??]: I was with Buraida on a cloudy day and he said, \"Offer the `Asr prayer earlier as the Prophet (ﷺ) said, \n'Whoever leaves the `Asr prayer will have all his (good) deeds annulled.\" (See Hadith No. 527 and \n528)", "grade": "Sahih", "narratedBy": "Narrated Ibn Abu Malih [??]:", "reference": "https://sunnah.com/bukhari:594", "inBookReference": "Book 9, Hadith 69"}, {"id": 70, "hadithNumber": "595", "text": "Narrated `Abdullah bin Abi Qatada: My father said, \"One night we were traveling with the Prophet (ﷺ) and some people said, 'We wish that \nAllah's Messenger (ﷺ) would take a rest along with us during the last hours of the night.' He said, 'I am afraid \nthat you will sleep and miss the (Fajr) prayer.' Bilal said, 'I will make you get up.' So all slept and \nBilal rested his back against his Rahila and he too was overwhelmed (by sleep) and slept. The Prophet (ﷺ) \ngot up when the edge of the sun had risen and said, 'O Bilal! What about your statement?' He replied, \n'I have never slept such a sleep.' The Prophet (ﷺ) said, 'Allah captured your souls when He wished, and \nreleased them when He wished. O Bilal! Get up and pronounce the Adhan for the prayer.' The Prophet (ﷺ) \nperformed ablution and when the sun came up and became bright, he stood up and prayed.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abi Qatada:", "reference": "https://sunnah.com/bukhari:595", "inBookReference": "Book 9, Hadith 70"}, {"id": 71, "hadithNumber": "596", "text": "Narrated Jabir bin `Abdullah: On the day of Al-Khandaq (the battle of trench.) `Umar bin Al-Khattab came cursing the disbelievers \nof Quraish after the sun had set and said, \"O Allah's Messenger (ﷺ) I could not offer the `Asr prayer till the \nsun had set.\" The Prophet (ﷺ) said, \"By Allah! I, too, have not prayed.\" So we turned towards Buthan, and \nthe Prophet (ﷺ) performed ablution and we too performed ablution and offered the `Asr prayer after the \nsun had set, and then he offered the Maghrib prayer.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:596", "inBookReference": "Book 9, Hadith 71"}, {"id": 72, "hadithNumber": "597", "text": "Narrated Anas: The Prophet (ﷺ) said, \"If anyone forgets a prayer he should pray that prayer when he remembers it. There \nis no expiation except to pray the same.\" Then he recited: \"Establish prayer for My (i.e. Allah's) \nremembrance.\" (20.14).", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:597", "inBookReference": "Book 9, Hadith 72"}, {"id": 73, "hadithNumber": "598", "text": "Narrated Jabir: `Umar came cursing the disbelievers (of Quraish) on the day of Al-Khandaq (the battle of Trench) and \nsaid, \"I could not offer the `Asr prayer till the sun had set. Then we went to Buthan and he offered the \n(`Asr) prayer after sunset and then he offered the Maghrib prayer.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:598", "inBookReference": "Book 9, Hadith 73"}, {"id": 74, "hadithNumber": "599", "text": "Narrated Abu-l-Minhal: My father and I went to Abi Barza Al-Aslami and my father said to him, \"Tell us how Allah's Messenger (ﷺ) \nused to offer the compulsory congregational prayers.\" He said, \"He used to pray the Zuhr prayer, \nwhich you call the first prayer, as the sun declined at noon, the `Asr at a time when one of US could \ngo to his family at the farthest place in Medina while the sun was still hot. (The narrator forgot what \nAbu Barza had said about the Maghrib prayer), and the Prophet (ﷺ) preferred to pray the `Isha' late and \ndisliked to sleep before it or talk after it. And he used to return after finishing the morning prayer at \nsuch a time when it was possible for one to recognize the person sitting by his side and he (the \nProphet) used to recite 60 to 100 'Ayat' (verses) of the Qur'an in it.\"", "grade": "Sahih", "narratedBy": "Narrated Abu-l-Minhal:", "reference": "https://sunnah.com/bukhari:599", "inBookReference": "Book 9, Hadith 74"}, {"id": 75, "hadithNumber": "600", "text": "Narrated Qurra bin Khalid: Once he waited for Al-Hasan and he did not show up till it was about the usual time for him to start \nhis speech; then he came and apologized saying, \"Our neighbors invited us.\" Then he added, \n\"Narrated Anas, 'Once we waited for the Prophet (ﷺ) till it was midnight or about midnight. He came and \nled the prayer, and after finishing it, he addressed us and said, 'All the people prayed and then slept \nand you had been in prayer as long as you were waiting for it.\" Al-Hasan said, \"The people are \nregarded as performing good deeds as long as they are waiting for doing good deeds.\" Al-Hasan's \nstatement is a portion of Anas's [??] Hadith from the Prophet (ﷺ) .", "grade": "Sahih", "narratedBy": "Narrated Qurra bin Khalid:", "reference": "https://sunnah.com/bukhari:600", "inBookReference": "Book 9, Hadith 75"}, {"id": 76, "hadithNumber": "601", "text": "Narrated `Abdullah bin `Umar: The Prophet (ﷺ) prayed one of the `Isha' prayer in his last days and after finishing it with Taslim, he stood \nup and said, \"Do you realize (the importance of) this night? Nobody present on the \nsurface of the earth tonight would be living after the completion of one hundred years from this \nnight.\" \nThe people made a mistake in grasping the meaning of this statement of Allah's Messenger (ﷺ) and they \nindulged in those things which are said about these narrators (i.e. some said that the Day of \nResurrection will be established after 100 years etc.) But the Prophet (ﷺ) said, \"Nobody present on the \nsurface of earth tonight would be living after the completion of 100 years from this night\"; he meant \n\"When that century (people of that century) would pass away.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:601", "inBookReference": "Book 9, Hadith 76"}, {"id": 77, "hadithNumber": "602", "text": "Narrated Abu `Uthman: `Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet (ﷺ) said, \n'Whoever has food for two persons should take a third one from them (Suffa companions). And \nwhosoever has food for four persons he should take one or two from them' Abu Bakr took three men \nand the Prophet (ﷺ) took ten of them.\" \n`Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in \ndoubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my \nhouse and Abu Bakr's house). Abu Bakr took his supper with the Prophet (ﷺ) and remained there till the \n`Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet (ﷺ) till the Prophet (ﷺ) took his \nmeal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's \nwife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' \nShe said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur \nRahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu \nBakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then \nsaid (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath \nthat he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the \nguests of Suffa companions) took anything from the food, it increased from underneath. We all ate to \nour fill and the food was more than it was before its serving. \nAbu Bakr looked at it (the food) and found it as it was before serving or even more than that. He \naddressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my \neyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That \n(oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it \nand then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty \nbetween us and some people, and when the period of that treaty had elapsed the Prophet (ﷺ) divided us \ninto twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many \nmen were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"", "grade": "Sahih", "narratedBy": "Narrated Abu `Uthman:", "reference": "https://sunnah.com/bukhari:602", "inBookReference": "Book 9, Hadith 77"}]}