{"collection":"bukhari","collectionName":"Sahih al-Bukhari","book":20,"bookName":"Virtues of Prayer at Masjid Makkah and Madinah","hadiths":[{"id":1,"hadithNumber":"1","text":"I heard Abu Said saying four words. He said, \"I heard the Prophet (ﷺ) \n     (saying the following narrative).\" He had participated in twelve holy \n     battles with the Prophet.","grade":null,"narratedBy":"Narrated Quza'a:"},{"id":2,"hadithNumber":"2","text":"The Prophet (ﷺ) said, \"Do not set out on a journey\n     except for three Mosques i.e. Al-Masjid-AI-Haram, the Mosque of \n     Allah's Messenger (ﷺ) , and the Mosque of Al-Aqsa, (Mosque of Jerusalem).\"","grade":null,"narratedBy":"Narrated Abu Huraira:"},{"id":3,"hadithNumber":"3","text":"Allah's Messenger (ﷺ) said, \"One prayer in my Mosque is better than one thousand prayers in any other \nmosque excepting Al-Masjid-AI-Haram.\"","grade":null,"narratedBy":"Narrated Abu Huraira:"},{"id":4,"hadithNumber":"4","text":"Ibn `Umar never offered the Duha prayer except on two occasions: \n(1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would \nperform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. \n(2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he \ndisliked to leave it without offering a prayer. Ibn `Umar narrated that Allah's Messenger (ﷺ) used to visit the \nMosque of Quba (sometime) walking and (sometime) riding. And he (i.e. Ibn `Umar) used to say, \"I \ndo only what my companions used to do and I don't forbid anybody to pray at any time during the day \nor night except that one should not intend to pray at sunrise or sunset.\"","grade":null,"narratedBy":"Narrated Nafi`:"},{"id":5,"hadithNumber":"5","text":"Ibn `Umar said, \"The Prophet (ﷺ) used to go to the Mosque of Quba every Saturday (sometimes) walking \nand (sometimes) riding.\" `Abdullah (Ibn `Umar) used to do the same.","grade":null,"narratedBy":"Narrated `Abdullah bin Dinar:"},{"id":6,"hadithNumber":"6","text":"The Prophet (ﷺ) used to go to the Mosque of Quba (sometimes) walking and sometimes riding. Added \nNafi` (in another narration), \"He then would offer two rak`at (in the Mosque of Quba).\"","grade":null,"narratedBy":"Narrated Ibn `Umar:"},{"id":7,"hadithNumber":"7","text":"Allah's Messenger (ﷺ) said, \"Between my house and the pulpit there is a garden of the gardens of Paradise.\"","grade":null,"narratedBy":"Narrated `Abdullah bin Zaid Al-Mazini:"},{"id":8,"hadithNumber":"8","text":"The Prophet (ﷺ) said, \"Between my house and my pulpit there is a garden of the gardens of Paradise, and \nmy pulpit is on my fountain tank (i.e. Al-Kauthar).\"","grade":null,"narratedBy":"Narrated Abu Huraira:"},{"id":9,"hadithNumber":"9","text":"(freed slave of) Ziyad: I heard Abu Sa`id Al-khudri narrating four things from the Prophet (ﷺ) and I \nappreciated them very much. He said, conveying the words of the Prophet. \n(1) \"A woman should not go on a two day journey except with her husband or a Dhi-Mahram. \n(2) No fasting is permissible on two days: `Id-ul-Fitr and `Id-ul-Adha. \n(3) No prayer after two prayers, i.e. after the Fajr prayer till the sunrises and after the `Asr prayer till \nthe sun sets. \n(4) Do not prepare yourself for a journey except to three Mosques, i.e. Al-Masjid-AI-Haram, the \nMosque of Aqsa (Jerusalem) and my Mosque.\"","grade":null,"narratedBy":"Narrated Qaza'a Maula:"}]}