{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 28, "bookName": "Chapter: The penalty for hunting (by a Muhrim). And the Statement of Allah تعالى: \"...Kill not game while you are in the state of Ihram for Hajj or Umra (pilgrimage), and whosoever of you kills it intentionally, the penalty is an offering, brought to the Ka'bah, of an eatable animal (i.e., sheep, goat, cow, etc.) brought to the Ka'bah, equivalent to the one he killed... to the end of the Verse... And fear Allah to Whom you shall be gathered back.\" (V.5:95-96).", "hadiths": [{"id": 1, "hadithNumber": "1821", "text": "Narrated `Abdullah bin Abu Qatada: My father set out (for Mecca) in the year of Al-Hudaibiya, and his companions assumed Ihram, but he \ndid not. At that time the Prophet (ﷺ) was informed that an enemy wanted to attack him, so the Prophet (ﷺ) \nproceeded onwards. While my father was among his companions, some of them laughed among \nthemselves. (My father said), \"I looked up and saw an onager. I attacked, stabbed and caught it. I then \nsought my companions' help but they refused to help me. (Later) we all ate its meat. We were afraid \nthat we might be left behind (separated) from the Prophet (ﷺ) so I went in search of the Prophet (ﷺ) and made \nmy horse to run at a galloping speed at times and let it go slow at an ordinary speed at other times till I \nmet a man from the tribe of Bani Ghifar at midnight. I asked him, \"Where did you leave the Prophet (ﷺ) \n?\" He replied, \"I left him at Ta'hun and he had the intention of having the midday rest at As-Suqya. I \nfollowed the trace and joined the Prophet (ﷺ) and said, 'O Allah's Messenger (ﷺ)! Your people (companions) \nsend you their compliments, and (ask for) Allah's Blessings upon you. They are afraid lest they may \nbe left behind; so please wait for them.' I added, 'O Allah's Messenger (ﷺ)! I hunted an onager and some of \nits meat is with me. The Prophet (ﷺ) told the people to eat it though all of them were in the state of \nIhram.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu Qatada:", "reference": "https://sunnah.com/bukhari:1821", "inBookReference": "Book 28, Hadith 1"}, {"id": 2, "hadithNumber": "1822", "text": "Narrated `Abdullah bin Abu Qatada: That his father said \"We proceeded with the Prophet (ﷺ) in the year of Al-Hudaibiya and his companions \nassumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on \ntowards them. My companions saw an onager and some of them started laughing among themselves. I \nlooked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my \ncompanions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I \nfollowed Allah's Messenger (ﷺ) lest we should be left behind. At times I urged my horse to run at a galloping \nspeed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani \nGhifar at midnight. I asked him where he had left Allah's Messenger (ﷺ) . The man replied that he had left \nthe Prophet (ﷺ) at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. \nSo, I followed Allah's Messenger (ﷺ) till I reached him and said, \"O Allah's Messenger (ﷺ)! I have been sent by my \ncompanions who send you their greetings and compliments and ask for Allah's Mercy and Blessings \nupon you. They were afraid lest the enemy might intervene between you and them; so please wait for \nthem.\" So he did. Then I said, \"O Allah's Messenger (ﷺ)! We have hunted an onager and have some of it (i.e. \nits meat) left over.\" Allah's Messenger (ﷺ) told his companions to eat the meat although all of them were in a \nstate of Ihram.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu Qatada:", "reference": "https://sunnah.com/bukhari:1822", "inBookReference": "Book 28, Hadith 2"}, {"id": 3, "hadithNumber": "1823", "text": "Narrated Abu Qatada: We were in the company of the Prophet (ﷺ) at a place called Al-Qaha (which is at a distance of three \nstages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in \nthe company of the Prophet (ﷺ) at a place called Al-Qaha and some of us had assumed Ihram while the \nothers had not. I noticed that some of my companions were watching something, so I looked up and \nsaw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked \nthem to pick it up for me) but they said, \"We will not help you by any means as we are in a state of \nIhram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and \nslaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \n\"Do not eat it.\" So, I went to the Prophet (ﷺ) who was ahead of us and asked him about it, He replied, \"Eat \nit as it is Halal (i.e. it is legal to eat it).", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:1823", "inBookReference": "Book 28, Hadith 3"}, {"id": 4, "hadithNumber": "1824", "text": "Narrated `Abdullah bin Abu Qatada: That his father had told him that Allah's Messenger (ﷺ) set out for Hajj and so did his companions. He sent a \nbatch of his companions by another route and Abu Qatada was one of them. The Prophet (ﷺ) said to them, \n\"Proceed along the seashore till we meet all together.\" So, they took the route of the seashore, and \nwhen they started all of them assumed Ihram except Abu Qatada. While they were proceeding on, his \ncompanions saw a group of onagers. Abu Qatada chased the onagers and attacked and wounded a sheonager. \nThey got down and ate some of its meat and said to each other: \"How do we eat the meat of \nthe game while we are in a state of Ihram?\" So, we (they) carried the rest of the she-onager's meat, and \nwhen they met Allah's Messenger (ﷺ) they asked, saying, \"O Allah's Messenger (ﷺ)! We assumed Ihram with the \nexception of Abu Qatada and we saw (a group) of onagers. Abu Qatada attacked them and wounded a \nshe-onager from them. Then we got down and ate from its meat. Later, we said, (to each other), 'How \ndo we eat the meat of the game and we are in a state of Ihram?' So, we carried the rest of its meat. The \nProphet asked, \"Did anyone of you order Abu Qatada to attack it or point at it?\" They replied in the \nnegative. He said, \"Then eat what is left of its meat.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu Qatada:", "reference": "https://sunnah.com/bukhari:1824", "inBookReference": "Book 28, Hadith 4"}, {"id": 5, "hadithNumber": "1825", "text": "Narrated `Abdullah bin `Abbas: From As-Sa'b bin Jath-thama Al-Laithi that the latter presented an onager to Allah's Messenger (ﷺ) while he \nwas at Al-Abwa' or at Waddan, and he refused it. On noticing the signs of some unpleasant feeling of \ndisappointment on his (As-Sab's) face, the Prophet (ﷺ) said to him, \"I have only returned it because I am \nMuhrim.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:1825", "inBookReference": "Book 28, Hadith 5"}, {"id": 6, "hadithNumber": "1826", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"It is not sinful of a Muhrim to kill five kinds of animals.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:1826", "inBookReference": "Book 28, Hadith 6"}, {"id": 7, "hadithNumber": "1827", "text": "One of the wives of the Prophet (ﷺ) narrated: The Prophet (ﷺ) said, \"A Muhrim can kill (five kinds of animals.)\"", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:1827", "inBookReference": "Book 28, Hadith 7"}, {"id": 8, "hadithNumber": "1828", "text": "Narrated Hafsa: Allah's Messenger (ﷺ) said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the \nkite, the mouse, the scorpion and the rabid dog.\"", "grade": "Sahih", "narratedBy": "Narrated Hafsa:", "reference": "https://sunnah.com/bukhari:1828", "inBookReference": "Book 28, Hadith 8"}, {"id": 9, "hadithNumber": "1829", "text": "Narrated Aisha: Allah's Messenger (ﷺ) said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). \nThese are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:1829", "inBookReference": "Book 28, Hadith 9"}, {"id": 10, "hadithNumber": "1830", "text": "Narrated `Abdullah: While we were in the company of the Prophet (ﷺ) in a cave at Mina, when Surat-wal-Mursalat were \nrevealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. \nSuddenly a snake sprang at us and the Prophet (ﷺ) said (ordered us): \"Kill it.\" We ran to kill it but it \nescaped quickly. The Prophet (ﷺ) said, \"It has escaped your evil and you too have escaped its evil.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:1830", "inBookReference": "Book 28, Hadith 10"}, {"id": 11, "hadithNumber": "1831", "text": "Narrated `Aisha the wife of the Prophet: Allah's Messenger (ﷺ) called the salamander a bad animal, but I did not hear him ordering it to be killed.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha the wife of the Prophet:", "reference": "https://sunnah.com/bukhari:1831", "inBookReference": "Book 28, Hadith 11"}, {"id": 12, "hadithNumber": "1832", "text": "Narrated Sa`id bin Abu Sa`id Al-Maqburi: Abu Shuraih, Al-`Adawi said that he had said to `Amr bin Sa`id when he was sending the troops to \nMecca (to fight `Abdullah bin Az-Zubair), \"O Chief! Allow me to tell you what Allah's Messenger (ﷺ) said \non the day following the Conquest of Mecca. My ears heard that and my heart understood it \nthoroughly and I saw with my own eyes the Prophet (ﷺ) when he, after Glorifying and Praising Allah, \nstarted saying, 'Allah, not the people, made Mecca a sanctuary, so anybody who has belief in Allah \nand the Last Day should neither shed blood in it, nor should he cut down its trees. If anybody tells \n(argues) that fighting in it is permissible on the basis that Allah's Messenger (ﷺ) did fight in Mecca, say to \nhim, 'Allah allowed His Apostle and did not allow you.' \"Allah allowed me only for a few hours on \nthat day (of the conquest) and today its sanctity is valid as it was before. So, those who are present \nshould inform those who are absent (concerning this fact.\" Abu Shuraih was asked, \"What did `Amr \nreply?\" He said, (`Amr said) 'O Abu Shuraih! I know better than you in this respect Mecca does not \ngive protection to a sinner, a murderer or a thief.\"", "grade": "Sahih", "narratedBy": "Narrated Sa`id bin Abu Sa`id Al-Maqburi:", "reference": "https://sunnah.com/bukhari:1832", "inBookReference": "Book 28, Hadith 12"}, {"id": 13, "hadithNumber": "1833", "text": "Narrated Ibn `Abbas: \"The Prophet (ﷺ) said, 'Allah has made Mecca, a sanctuary, so it was a sanctuary before me and will \ncontinue to be a sanctuary after me. It was made legal for me (i.e. I was allowed to fight in it) for a \nfew hours of a day. It is not allowed to uproot its shrubs or to cut its trees, or to chase (or disturb) its \ngame, or to pick up its luqata (fallen things) except by a person who would announce that (what he has \nfound) publicly.' Al-`Abbas said, 'O Allah's Messenger (ﷺ)! Except Al-Idhkhir (a kind of grass) (for it is \nused) by our goldsmiths and for our graves.' The Prophet (ﷺ) then said, 'Except Al-Idhkhir.' \" `Ikrima said, \n'Do you know what \"chasing or disturbing\" the game means? It means driving it out of the shade to \noccupy its place.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1833", "inBookReference": "Book 28, Hadith 13"}, {"id": 14, "hadithNumber": "1834", "text": "Narrated Ibn `Abbas: On the day of the conquest of Mecca, the Prophet (ﷺ) said, \"There is no more emigration (from Mecca) \nbut Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No \ndoubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth \nand will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting \nwas not permissible in it for anyone before me, and even for me it was allowed only for a portion of a \nday. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be \nuprooted and its game should not be chased; and its luqata (fallen things) should not be picked up \nexcept by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" \nAl-`Abbas said, \"O Allah's Messenger (ﷺ)! Except Al-Idhkhir, (for it is used by their blacksmiths and for \ntheir domestic purposes).\" So, the Prophet (ﷺ) said, \"Except Al-Idhkhir.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1834", "inBookReference": "Book 28, Hadith 14"}, {"id": 15, "hadithNumber": "1835", "text": "Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped while he was in a state of Ihram.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1835", "inBookReference": "Book 28, Hadith 15"}, {"id": 16, "hadithNumber": "1836", "text": "Narrated Ibn Buhaina: The Prophet, while in the state of Ihram, was cupped at the middle of his head at Liha-Jamal.", "grade": "Sahih", "narratedBy": "Narrated Ibn Buhaina:", "reference": "https://sunnah.com/bukhari:1836", "inBookReference": "Book 28, Hadith 16"}, {"id": 17, "hadithNumber": "1837", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage \nwere held).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1837", "inBookReference": "Book 28, Hadith 17"}, {"id": 18, "hadithNumber": "1838", "text": "Narrated `Abdullah bin `Umar: A person stood up and asked, \"O Allah's: Apostle! What clothes may be worn in the state of Ihram?\" \nThe Prophet (ﷺ) replied, \"Do not wear a shirt or trousers, or any headgear (e.g. a turban), or a hooded \ncloak; but if somebody has no shoes he can wear leather stockings provided they are cut short off the \nankles, and also, do not wear anything perfumed with Wars or saffron, and the Muhrima (a woman in \nthe state of Ihram) should not cover her face, or wear gloves.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:1838", "inBookReference": "Book 28, Hadith 18"}, {"id": 19, "hadithNumber": "1839", "text": "Narrated Ibn `Abbas: A man was crushed to death by his she-camel and was brought to Allah's Messenger (ﷺ) who said, \"Give him \na bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will \nbe resurrected reciting Talbiya.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1839", "inBookReference": "Book 28, Hadith 19"}, {"id": 20, "hadithNumber": "1840", "text": "Narrated `Abdullah bin Hunain: `Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a \nMuhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin \n`Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of \nthe well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I \nam `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Messenger (ﷺ) \nused to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of \ncloth and lowered it till his head appeared before me, and then told somebody to pour water on his \nhead. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing \nthem from back to front and from front to back and said, \"I saw the Prophet (ﷺ) doing like this.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Hunain:", "reference": "https://sunnah.com/bukhari:1840", "inBookReference": "Book 28, Hadith 20"}, {"id": 21, "hadithNumber": "1841", "text": "Narrated Ibn `Abbas: I heard the Prophet (ﷺ) delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he \ncould wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below \nthe ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he \ncould wear trousers.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1841", "inBookReference": "Book 28, Hadith 21"}, {"id": 22, "hadithNumber": "1842", "text": "Narrated `Abdullah: Allah's Messenger (ﷺ) was asked what sort of clothes a Muhrim should wear. He replied, \"He should not \nwear a shirt, turbans, trousers, a hooded cloak, or a dress perfumed with saffron or Wars; and if \nslippers are not available he can wear Khuffs (socks made from thick fabric or leather) but he should \ncut them so that they reach below the ankles.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:1842", "inBookReference": "Book 28, Hadith 22"}, {"id": 23, "hadithNumber": "1843", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, \nand whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1843", "inBookReference": "Book 28, Hadith 23"}, {"id": 24, "hadithNumber": "1844", "text": "Narrated Al-Bara: The Prophet (ﷺ) assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca \nrefused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca \nany arms but sheathed.", "grade": "Sahih", "narratedBy": "Narrated Al-Bara:", "reference": "https://sunnah.com/bukhari:1844", "inBookReference": "Book 28, Hadith 24"}, {"id": 25, "hadithNumber": "1845", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, \nand Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit \nare for those people and also for those who come through these Mawaqit (from places other than the \nabove-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these \nMawaqit can assume Ihram from the place where they start; even the people of Mecca can assume \nIhram from Mecca.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1845", "inBookReference": "Book 28, Hadith 25"}, {"id": 26, "hadithNumber": "1846", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) entered Mecca in the year of its Conquest wearing an Arabian helmet on his head and \nwhen the Prophet (ﷺ) took it off, a person came and said, \"Ibn Khatal is holding the covering of the Ka`ba \n(taking refuge in the Ka`ba).\" The Prophet (ﷺ) said, \"Kill him.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:1846", "inBookReference": "Book 28, Hadith 26"}, {"id": 27, "hadithNumber": "1847", "text": "Narrated Ya'li: While I was with Allah's Messenger (ﷺ) there came to him a man wearing a cloak having a trace of yellowish \nperfume or a similar thing on it. `Umar used to say to me, \"Would you like to see the Prophet (ﷺ) at the \ntime when he is inspired divinely?\" So, it happened that he was inspired (then) and when the \ninspiration was over the Prophet (ﷺ) said (to that man), \"Do in your `Umra the same as you do in your \nHajj.\"", "grade": "Sahih", "narratedBy": "Narrated Ya'li:", "reference": "https://sunnah.com/bukhari:1847", "inBookReference": "Book 28, Hadith 27"}, {"id": 28, "hadithNumber": "1848", "text": "A man bit the hand of another man but in that process the latter broke one incisor tooth of the former, and the Prophet (ﷺ) forgave the latter.", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:1848", "inBookReference": "Book 28, Hadith 28"}, {"id": 29, "hadithNumber": "1849", "text": "Narrated Ibn `Abbas: While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1849", "inBookReference": "Book 28, Hadith 29"}, {"id": 30, "hadithNumber": "1850", "text": "Narrated Ibn `Abbas: While a man was standing with the Prophet (ﷺ) at `Arafat, he fell from his Mount and his neck was \ncrushed by it. The Prophet (ﷺ) said, \"Wash the deceased with water and Sidr and shroud him in two pieces \nof cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be reciting Talbiya.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1850", "inBookReference": "Book 28, Hadith 30"}, {"id": 31, "hadithNumber": "1851", "text": "Narrated Ibn `Abbas: A man was in the company of the Prophet (ﷺ) and his she-camel crushed his neck while he was in a state \nof Ihram and he died Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in his two \ngarments; neither perfume him nor cover his head, for he will be resurrected on the Day of \nResurrection, reciting Talbiya.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1851", "inBookReference": "Book 28, Hadith 31"}, {"id": 32, "hadithNumber": "1852", "text": "Narrated Ibn `Abbas: A woman from the tribe of Juhaina came to the Prophet (ﷺ) and said, \"My mother had vowed to perform \nHajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet (ﷺ) \nreplied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or \nnot? So, pay Allah's debt as He has more right to be paid.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1852", "inBookReference": "Book 28, Hadith 32"}, {"id": 33, "hadithNumber": "1853", "text": "Narrated Ibn `Abbas: A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet (ﷺ) ) and said, \n\"O Allah's Messenger (ﷺ)! My father has come under Allah's obligation of performing Hajj but he is a very \nold man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his \nbehalf?\" The Prophet (ﷺ) replied in the affirmative.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1853", "inBookReference": "Book 28, Hadith 33"}, {"id": 34, "hadithNumber": "1854", "text": "Narrated `Abdullah bin `Abbas: Al-Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al-Fadl \nstarted looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She \nsaid, \"My father has come under Allah's obligation of performing Hajj but he is a very old man and \ncannot sit properly on his Mount. Shall I perform Hajj on his behalf? The Prophet (ﷺ) replied in the \naffirmative. That happened during Hajjat-al-Wada` of the Prophet (ﷺ) .", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:1854", "inBookReference": "Book 28, Hadith 34"}, {"id": 35, "hadithNumber": "1855", "text": "Narrated 'Abdullah bin 'Abbas (ra): Al Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet (ﷺ) replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet (ﷺ).", "grade": "Sahih", "narratedBy": "Narrated 'Abdullah bin 'Abbas (ra):", "reference": "https://sunnah.com/bukhari:1855", "inBookReference": "Book 28, Hadith 35"}, {"id": 36, "hadithNumber": "1856", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1856", "inBookReference": "Book 28, Hadith 36"}, {"id": 37, "hadithNumber": "1857", "text": "Narrated `Abdullah bin `Abbas: I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Messenger (ﷺ) was \npraying at Mina. I passed in front of a part of the first row and then dismounted from it, and the \nanimal started grazing. I aligned with the people behind Allah's Messenger (ﷺ) (The sub-narrator added that \nhappened in Mina during the Prophet's Hajjat-al-Wada`.)", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:1857", "inBookReference": "Book 28, Hadith 37"}, {"id": 38, "hadithNumber": "1858", "text": "Narrated As-Sa'ib bin Yazid: (While in the company of my parents) I was made to perform Hajj with Allah's Messenger (ﷺ) and I was a \nseven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)", "grade": "Sahih", "narratedBy": "Narrated As-Sa'ib bin Yazid:", "reference": "https://sunnah.com/bukhari:1858", "inBookReference": "Book 28, Hadith 38"}, {"id": 39, "hadithNumber": "1859", "text": "Narrated Al-Ju'aid bin `Abdur-Rahman: I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid that he had performed Hajj (while \ncarried) with the belongings of the Prophet.", "grade": "Sahih", "narratedBy": "Narrated Al-Ju'aid bin `Abdur-Rahman:", "reference": "https://sunnah.com/bukhari:1859", "inBookReference": "Book 28, Hadith 39"}, {"id": 40, "hadithNumber": "1860", "text": "Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet(ﷺ)to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:1860", "inBookReference": "Book 28, Hadith 40"}, {"id": 41, "hadithNumber": "1861", "text": "Narrated Aisha (mother of the faithful believers): I said, \"O Allah's Messenger (ﷺ)! Shouldn't we participate in Holy battles and Jihad along with you?\" He \nreplied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" \n`Aisha added: Ever since I heard that from Allah's Messenger (ﷺ) I have determined not to miss Hajj.", "grade": "Sahih", "narratedBy": "Narrated Aisha (mother of the faithful believers):", "reference": "https://sunnah.com/bukhari:1861", "inBookReference": "Book 28, Hadith 41"}, {"id": 42, "hadithNumber": "1862", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with \nwhom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit \nher except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Messenger (ﷺ)! I intend to \ngo to such and such an army and my wife wants to perform Hajj.\" The Prophet (ﷺ) said (to him), \"Go \nalong with her (to Hajj).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1862", "inBookReference": "Book 28, Hadith 42"}, {"id": 43, "hadithNumber": "1863", "text": "Narrated Ibn `Abbas: When the Prophet (ﷺ) returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid \nyou to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he \nperformed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet (ﷺ) said \n(to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in \nreward).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:1863", "inBookReference": "Book 28, Hadith 43"}, {"id": 44, "hadithNumber": "1864", "text": "Narrated Qaza'a the slave of Ziyad: Abu Sa`id who participated in twelve Ghazawat with the Prophet (ﷺ) said, \"I heard four things from \nAllah's Messenger (ﷺ) (or I narrate them from the Prophet (ﷺ) ) which won my admiration and appreciation. \nThey are: \n-1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. \n-2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. \n-3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the \nmorning prayer till the sun rises. \n-4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in \nMedina), and Masjid-al-Aqsa (in Jerusalem).", "grade": "Sahih", "narratedBy": "Narrated Qaza'a the slave of Ziyad:", "reference": "https://sunnah.com/bukhari:1864", "inBookReference": "Book 28, Hadith 44"}, {"id": 45, "hadithNumber": "1865", "text": "Narrated Anas: The Prophet (ﷺ) saw an old man walking, supported by his two sons, and asked about him. The people \ninformed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old \nman's torturing himself,\" and ordered him to ride.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:1865", "inBookReference": "Book 28, Hadith 45"}, {"id": 46, "hadithNumber": "1866", "text": "Narrated `Uqba bin 'Amir: My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet (ﷺ) about \nit. So, I did and the Prophet (ﷺ) said, \"She should walk and also should ride.\" Narrated Abul-Khair from `Uqba as above.:", "grade": "Sahih", "narratedBy": "Narrated `Uqba bin 'Amir:", "reference": "https://sunnah.com/bukhari:1866", "inBookReference": "Book 28, Hadith 46"}]}