{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 32, "bookName": "Chapter: The superiority of the night of Qadr", "hadiths": [{"id": 1, "hadithNumber": "2014", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Whoever fasted the month of Ramadan out of sincere Faith (i.e. belief) and hoping \nfor a reward from Allah, then all his past sins will be forgiven, and whoever stood for the prayers in \nthe night of Qadr out of sincere Faith and hoping for a reward from Allah, then all his previous sins \nwill be forgiven .\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2014", "inBookReference": "Book 32, Hadith 1"}, {"id": 2, "hadithNumber": "2015", "text": "Narrated Ibn `Umar: Some men amongst the companions of the Prophet (ﷺ) were shown in their dreams that the night of Qadr \nwas in the last seven nights of Ramadan. Allah's Messenger (ﷺ) said, \"It seems that all your dreams agree \nthat (the Night of Qadr) is in the last seven nights, and whoever wants to search for it (i.e. the Night of \nQadr) should search in the last seven (nights of Ramadan).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2015", "inBookReference": "Book 32, Hadith 2"}, {"id": 3, "hadithNumber": "2016", "text": "Narrated Abu Salama: I asked Abu Sa`id, and he was a friend of mine, (about the Night of Qadr) and he said, \"We practiced \nI`tikaf (seclusion in the mosque) in the middle third of the month of Ramadan with the Prophet (ﷺ) . In the \nmorning of the 20th of Ramadan, the Prophet (ﷺ) came and addressed us and said, 'I was informed of (the \ndate of the Night of Qadr) but I was caused to forget it; so search for it in the odd nights of the last ten \nnights of the month of Ramadan. (In the dream) I saw myself prostrating in mud and water (as a sign). \nSo, whoever was in I`tikaf with me should return to it with me (for another 10-day's period)', and we \nreturned. At that time there was no sign of clouds in the sky but suddenly a cloud came and it rained \ntill rainwater started leaking through the roof of the mosque which was made of date-palm leaf stalks. \nThen the prayer was established and I saw Allah's Messenger (ﷺ) prostrating in mud and water and I saw the \ntraces of mud on his forehead.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Salama:", "reference": "https://sunnah.com/bukhari:2016", "inBookReference": "Book 32, Hadith 3"}, {"id": 4, "hadithNumber": "2017", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) said, \"Search for the Night of Qadr in the odd nights of the last ten days of Ramadan.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2017", "inBookReference": "Book 32, Hadith 4"}, {"id": 5, "hadithNumber": "2018", "text": "Narrated Abu Sa`id Al-Khudri: Allah's Messenger (ﷺ) used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after \npassing the twenty nights he used to go back to his house on the 21st, and the people who were in \nI`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, \nhe established the night prayers at the night in which he used to return home, and then he addressed \nthe people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf \nfor these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the \nmonth); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been \nshown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the \nlast ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the \nnight of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking \nthrough the roof of the mosque at the praying place of the Prophet (ﷺ) . I saw with my own eyes the \nProphet at the completion of the morning prayer leaving with his face covered with mud and water.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:2018", "inBookReference": "Book 32, Hadith 5"}, {"id": 6, "hadithNumber": "2019", "text": "Narrated `Aisha: The Prophet (ﷺ) said, \"Look for (the Night of Qadr).", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2019", "inBookReference": "Book 32, Hadith 6"}, {"id": 7, "hadithNumber": "2020", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) used to practice I`tikaf in the last ten nights of Ramadan and used to say, \"Look for \nthe Night of Qadr in the last ten nights of the month of Ramadan.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2020", "inBookReference": "Book 32, Hadith 7"}, {"id": 8, "hadithNumber": "2021", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) said, \"Look for the Night of Qadr in the last ten nights of Ramadan ,' on the night when \nnine or seven or five nights remain out of the last ten nights of Ramadan (i.e. 21, 23, 25, respectively).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2021", "inBookReference": "Book 32, Hadith 8"}, {"id": 9, "hadithNumber": "2022", "text": "Narrated Ibn `Abbas: Allah's Messenger (ﷺ) said, \"The Night of Qadr is in the last ten nights of the month (Ramadan), either on \nthe first nine or in the last (remaining) seven nights (of Ramadan).\" Ibn `Abbas added, \"Search for it \non the twenty-fourth (of Ramadan).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2022", "inBookReference": "Book 32, Hadith 9"}, {"id": 10, "hadithNumber": "2023", "text": "Narrated 'Ubada bin As-Samit: The Prophet (ﷺ) came out to inform us about the Night of Qadr but two Muslims were quarreling with \neach other. So, the Prophet (ﷺ) said, \"I came out to inform you about the Night of Qadr but such-and-such \npersons were quarreling, so the news about it had been taken away; yet that might be for your own \ngood, so search for it on the 29th, 27th and 25th (of Ramadan).", "grade": "Sahih", "narratedBy": "Narrated 'Ubada bin As-Samit:", "reference": "https://sunnah.com/bukhari:2023", "inBookReference": "Book 32, Hadith 10"}, {"id": 11, "hadithNumber": "2024", "text": "Narrated Aisha: With the start of the last ten days of Ramadan, the Prophet (ﷺ) used to tighten his waist belt (i.e. work \nhard) and used to pray all the night, and used to keep his family awake for the prayers.", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2024", "inBookReference": "Book 32, Hadith 11"}]}