{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 34, "bookName": "Chapter: What has come in the Statement of Allah تعالى: “Then when the (Jumu‘ah) Salat is ended, you may disperse through the land, and seek of the Bounty of Allah.... And Allah is the Best of Providers.” (V.62:10,11)", "hadiths": [{"id": 1, "hadithNumber": "2047", "text": "Narrated Abu Huraira: You people say that Abu Huraira tells many narrations from Allah's Messenger (ﷺ) and you also wonder why \nthe emigrants and Ansar do not narrate from Allah's Messenger (ﷺ) as Abu Huraira does. My emigrant \nbrothers were busy in the market while I used to stick to Allah's Messenger (ﷺ) content with what fills my \nstomach; so I used to be present when they were absent and I used to remember when they used to \nforget, and my Ansari brothers used to be busy with their properties and I was one of the poor men of \nSuffa. I used to remember the narrations when they used to forget. No doubt, Allah's Messenger (ﷺ) once \nsaid, \"Whoever spreads his garment till I have finished my present speech and then gathers it to \nhimself, will remember whatever I will say.\" So, I spread my colored garment which I was wearing \ntill Allah's Messenger (ﷺ) had finished his saying, and then I gathered it to my chest. So, I did not forget any \nof that narrations.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2047", "inBookReference": "Book 34, Hadith 1"}, {"id": 2, "hadithNumber": "2048", "text": "Narrated Ibrahim bin Sa`d from his father from his grandfather: `Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Messenger (ﷺ) established a \nbond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the \nrichest among the Ansar, so I will give you half of my wealth and you may look at my two wives and \nwhichever of the two you may choose I will divorce her, and when she has completed the prescribed \nperiod (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is \nthere any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- \nRahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, \nand then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of \nyellow (scent) on his body. Allah's Messenger (ﷺ) asked him whether he had got married. He replied in the \naffirmative. The Prophet (ﷺ) said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then \nthe Prophet (ﷺ) asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh \nto a date stone (or a date stone of gold)! The Prophet (ﷺ) said, 'Give a Walima (wedding banquet) even if \nwith one sheep .' \"", "grade": "Sahih", "narratedBy": "Narrated Ibrahim bin Sa`d from his father from his grandfather:", "reference": "https://sunnah.com/bukhari:2048", "inBookReference": "Book 34, Hadith 2"}, {"id": 3, "hadithNumber": "2049", "text": "Narrated Anas: When `Abdur-Rahman bin `Auf came to Medina, the Prophet (ﷺ) established a bond of brotherhood \nbetween him and Sa`d bin Ar-Rabi al-Ansari. Sa`d was a rich man, so he said to `Abdur-Rahman, \"I \nwill give you half of my property and will help you marry.\" `Abdur-Rahman said (to him), \"May \nAllah bless you in your family and property. Show me the market.\" So `Abdur-Rahman did not return \nfrom the market) till he gained some dried buttermilk (yogurt) and butter (through trading). He \nbrought that to his house-hold. We stayed for sometime (or as long as Allah wished), and then \n`Abdur-Rahman came, scented with yellowish perfume. The Prophet (ﷺ) said (to him) \"What is this?\" He \nreplied, \"I got married to an Ansari woman.\" The Prophet (ﷺ) asked, \"What did you pay her?\" He replied, \n\"A gold stone or gold equal to the weight of a date stone.\" The Prophet (ﷺ) said (to him), \"Give a wedding \nbanquet even if with one sheep.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2049", "inBookReference": "Book 34, Hadith 3"}, {"id": 4, "hadithNumber": "2050", "text": "Narrated Ibn `Abbas: `Ukaz, Majanna and Dhul-Majaz were marketplaces in the Pre-Islamic period of ignorance. When \nIslam came, Muslims felt that marketing there might be a sin. So, the Divine Inspiration came: \"There \nis no harm for you to seek the bounty of your Lord (in the seasons of Hajj).\" (2.198) Ibn `Abbas \nrecited the Verse in this way.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2050", "inBookReference": "Book 34, Hadith 4"}, {"id": 5, "hadithNumber": "2051", "text": "Narrated An-Nu`man bin Bashir: The Prophet (ﷺ) said \"Both legal and illegal things are obvious, and in between them are (suspicious) \ndoubtful matters. So whoever forsakes those doubtful things lest he may commit a sin, will definitely \navoid what is clearly illegal; and whoever indulges in these (suspicious) doubtful things bravely, is \nlikely to commit what is clearly illegal. Sins are Allah's Hima (i.e. private pasture) and whoever \npastures (his sheep) near it, is likely to get in it at any moment.\"", "grade": "Sahih", "narratedBy": "Narrated An-Nu`man bin Bashir:", "reference": "https://sunnah.com/bukhari:2051", "inBookReference": "Book 34, Hadith 5"}, {"id": 6, "hadithNumber": "2052", "text": "Narrated `Abdullah bin Abu Mulaika: `Uqba bin Al-Harith said that a black woman came and claimed that she had suckled both of them (i.e. \n`Uqba and his wife). So, he mentioned that to the Prophet (ﷺ) who turned his face from him and smiled \nand said, \"How (can you keep your wife), and it was said (that both of you were suckled by the same \nwoman)?\" His wife was the daughter of Abu Ihab-al-Tamimi.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu Mulaika:", "reference": "https://sunnah.com/bukhari:2052", "inBookReference": "Book 34, Hadith 6"}, {"id": 7, "hadithNumber": "2053", "text": "Narrated Aisha: `Utba bin Abu Waqqas took a firm promise from his brother Sa`d bin Abu Waqqas to take the son of \nthe slave-girl of Zam`a into his custody as he was his (i.e. `Utba's) son. In the year of the Conquest (of \nMecca) Sa`d bin Abu Waqqas took him, and said that he was his brother's son, and his brother took a \npromise from him to that effect. 'Abu bin Zam`a got up and said, \"He is my brother and the son of the \nslave-girl of my father and was born on my father's bed.\" Then they both went to the Prophet (ﷺ) Sa`d \nsaid, \"O Allah's Messenger (ﷺ)! He is the son of my brother and he has taken a promise from me that I will \ntake him.\" 'Abu bin Zam`a said, \"(He is) my brother and the son of my father's slave-girl and was born \non my father's bed.\" Allah's Messenger (ﷺ) said, \"The boy is for you. O 'Abu bin Zam`a.\" Then the Prophet (ﷺ) \nsaid, \"The son is for the bed (i.e. the man on whose bed he was born) and stones (disappointment and \ndeprivation) for the one who has done illegal sexual intercourse.\" The Prophet (ﷺ) told his wife Sauda bint \nZam`a to screen herself from that boy as he noticed a similarity between the boy and `Utba. So, the \nboy did not see her till he died.", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2053", "inBookReference": "Book 34, Hadith 7"}, {"id": 8, "hadithNumber": "2054", "text": "Narrated `Adi bin Hatim: I asked Allah's Messenger (ﷺ) about Al Mirad (i.e. a sharp-edged piece of wood or a piece of wood provided \nwith a piece of iron used for hunting). He replied, \"If the game is hit by its sharp edge, eat it, and if it \nis hit by its broad side, do not eat it, for it has been beaten to death.\" I asked, \"O Allah's Messenger (ﷺ)! I \nrelease my dog by the name of Allah and find with it at the game, another dog on which I have not \nmentioned the name of Allah, and I do not know which one of them caught the game.\" Allah's Messenger (ﷺ) \nsaid (to him), 'Don't eat it as you have mentioned the name of Allah on your dog and not on the other \ndog.\"", "grade": "Sahih", "narratedBy": "Narrated `Adi bin Hatim:", "reference": "https://sunnah.com/bukhari:2054", "inBookReference": "Book 34, Hadith 8"}, {"id": 9, "hadithNumber": "2055", "text": "Narrated Anas: The Prophet (ﷺ) passed by a fallen date and said, \"Were it not for my doubt that this might have been \ngiven in charity, I would have eaten it.\" And narrated Abu Huraira the Prophet (ﷺ) said, \"I found a datefruit \nfallen on my bed.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2055", "inBookReference": "Book 34, Hadith 9"}, {"id": 10, "hadithNumber": "2056", "text": "Narrated `Abbas bin Tamim: that his uncle said: \"The Prophet (ﷺ) was asked: If a person feels something during his prayer; should one \ninterrupt his prayer?\" The Prophet (ﷺ) said: No! You should not give it up unless you hear a sound or \nsmell something.\" Narrated Ibn Abi Hafsa: Az-Zuhri said, \"There is no need of repeating ablution \nunless you detect a smell or hear a sound.\"", "grade": "Sahih", "narratedBy": "Narrated `Abbas bin Tamim:", "reference": "https://sunnah.com/bukhari:2056", "inBookReference": "Book 34, Hadith 10"}, {"id": 11, "hadithNumber": "2057", "text": "Narrated `Aisha: Some people said, \"O Allah's Messenger (ﷺ)! Meat is brought to us by some people and we are not sure \nwhether the name of Allah has been mentioned on it or not (at the time of slaughtering the animals).\" \nAllah's Messenger (ﷺ) said (to them), \"Mention the name of Allah and eat it.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2057", "inBookReference": "Book 34, Hadith 11"}, {"id": 12, "hadithNumber": "2058", "text": "Narrated Jabir: While we were offering the prayer with the Prophet (ﷺ) a caravan carrying food came from Sham. The \npeople looked towards the caravan (and went to it) and only twelve persons remained with the \nProphet. So, the Divine Inspiration came; \"But when they see some bargain or some amusement, they \ndisperse headlong to it.\" (62.11)", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2058", "inBookReference": "Book 34, Hadith 12"}, {"id": 13, "hadithNumber": "2059", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"A time will come when one will not care how one gains one's money, legally or \nillegally.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2059", "inBookReference": "Book 34, Hadith 13"}, {"id": 14, "hadithNumber": "2060", "text": "Narrated Abu Al-Minhal: I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the \nProphet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam \nabout practicing money exchange. They replied, 'We were traders in the time of Allah's Messenger (ﷺ) and I \nasked Allah's Messenger (ﷺ) about money exchange. He replied, 'If it is from hand to hand, there is no harm \nin it; otherwise it is not permissible.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Minhal:", "reference": "https://sunnah.com/bukhari:2060", "inBookReference": "Book 34, Hadith 14"}, {"id": 15, "hadithNumber": "2062", "text": "Narrated 'Ubaid bin `Umair: Abu Musa asked `Umar to admit him but he was not admitted as `Umar was busy, so Abu Musa went \nback. When `Umar finished his job he said, \"Didn't I hear the voice of `Abdullah bin Qais? Let him \ncome in.\" `Umar was told that he had left. So, he sent for him and on his arrival, he (Abu Musa) said, \n\"We were ordered to do so (i.e. to leave if not admitted after asking permission thrice). `Umar told \nhim, \"Bring witness in proof of your statement.\" Abu Musa went to the Ansar's meeting places and \nasked them. They said, \"None amongst us will give this witness except the youngest of us, Abu Sa`id \nAl-Khudri. Abu Musa then took Abu Sa`id Al-Khudri (to `Umar) and `Umar said, surprisingly, \"Has \nthis order of Allah's Messenger (ﷺ) been hidden from me?\" (Then he added), \"I used to be busy trading in \nmarkets.\"", "grade": "Sahih", "narratedBy": "Narrated 'Ubaid bin `Umair:", "reference": "https://sunnah.com/bukhari:2062", "inBookReference": "Book 34, Hadith 15"}, {"id": 16, "hadithNumber": "2063", "text": "Abu Hurairah (ra) said, \"Allah's Messenger (ﷺ) mentioned a person from Bani Israel who travelled by sea and carried out his needs.\" Then he narrated the whole story. (See Hadith no. 2291)", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:2063", "inBookReference": "Book 34, Hadith 16"}, {"id": 17, "hadithNumber": "2064", "text": "Narrated Jabir: A caravan arrived (at Medina) while we were offering the Jumua prayer with the Prophet. The people \nleft out for the caravan, with the exception of twelve persons. Then this Verse was revealed: 'But \nwhen they see some bargain or some amusement, they disperse headlong to it and leave you \nstanding.\" (62.11)", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2064", "inBookReference": "Book 34, Hadith 17"}, {"id": 18, "hadithNumber": "2065", "text": "Narrated `Aisha: The Prophet (ﷺ) said, \"If a woman gives in charity from her house meals without wasting (i.e. being \nextravagant), she will get the reward for her giving, and her husband will also get the reward for his \nearning and the storekeeper will also get a similar reward. The acquisition of the reward of none of \nthem will reduce the reward of the others.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2065", "inBookReference": "Book 34, Hadith 18"}, {"id": 19, "hadithNumber": "2066", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"If a woman gives something (i.e. in charity) from her husband's earnings without \nhis permission, she will get half his reward.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2066", "inBookReference": "Book 34, Hadith 19"}, {"id": 20, "hadithNumber": "2067", "text": "Narrated Anas bin Malik: I heard Allah's Messenger (ﷺ) saying, \"whoever desires an expansion in his sustenance and age, should keep \ngood relations with his Kith and kin.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2067", "inBookReference": "Book 34, Hadith 20"}, {"id": 21, "hadithNumber": "2068", "text": "Narrated `Aisha: The Prophet (ﷺ) purchased food grains from a Jew on credit and mortgaged his iron armor to him.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2068", "inBookReference": "Book 34, Hadith 21"}, {"id": 22, "hadithNumber": "2069", "text": "Narrated Qatada: Anas went to the Prophet (ﷺ) with barley bread having some dissolved fat on it. The Prophet (ﷺ) had \nmortgaged his armor to a Jew in Medina and took from him some barley for his family. Anas heard \nhim saying, \"The household of Muhammad did not possess even a single Sa of wheat or food grains \nfor the evening meal, although he has nine wives to look after.\" (See Hadith No. 685)", "grade": "Sahih", "narratedBy": "Narrated Qatada:", "reference": "https://sunnah.com/bukhari:2069", "inBookReference": "Book 34, Hadith 22"}, {"id": 23, "hadithNumber": "2070", "text": "Narrated `Aisha: When Abu Bakr As-Siddiq was chosen Caliph, he said, \"My people know that my profession was not \nincapable of providing substance to my family. And as I will be busy serving the Muslim nation, my \nfamily will eat from the National Treasury of Muslims, and I will practice the profession of serving \nthe Muslims.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2070", "inBookReference": "Book 34, Hadith 23"}, {"id": 24, "hadithNumber": "2071", "text": "Narrated Aisha: The companions of Allah's Messenger (ﷺ) used to practice manual labor, so their sweat used to smell, and \nthey were advised to take a bath.", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2071", "inBookReference": "Book 34, Hadith 24"}, {"id": 25, "hadithNumber": "2072", "text": "Narrated Al-Miqdam: The Prophet (ﷺ) said, \"Nobody has ever eaten a better meal than that which one has earned by working \nwith one's own hands. The Prophet (ﷺ) of Allah, David used to eat from the earnings of his manual labor.\"", "grade": "Sahih", "narratedBy": "Narrated Al-Miqdam:", "reference": "https://sunnah.com/bukhari:2072", "inBookReference": "Book 34, Hadith 25"}, {"id": 26, "hadithNumber": "2073", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"The Prophet (ﷺ) David used not to eat except from the earnings of his manual \nlabor.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2073", "inBookReference": "Book 34, Hadith 26"}, {"id": 27, "hadithNumber": "2074", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"No doubt, it is\nbetter for any one of you to cut a bundle of\nwood and carry it over his back rather than to\nask someone who may or may not give\nhim.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2074", "inBookReference": "Book 34, Hadith 27"}, {"id": 28, "hadithNumber": "2075", "text": "Narrated Az-Zubair bin Al-Awwam: The Prophet (ﷺ) said, \"One would rather take a rope and cut wood and carry it than ask others).", "grade": "Sahih", "narratedBy": "Narrated Az-Zubair bin Al-Awwam:", "reference": "https://sunnah.com/bukhari:2075", "inBookReference": "Book 34, Hadith 28"}, {"id": 29, "hadithNumber": "2076", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) said, \"May Allah's mercy be on him who is lenient in his buying, selling, and in \ndemanding back his money.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2076", "inBookReference": "Book 34, Hadith 29"}, {"id": 30, "hadithNumber": "2077", "text": "Narrated Hudhaifa: The Prophet (ﷺ) said, \"Before your time the angels received the soul of a man and asked him, 'Did you do \nany good deeds (in your life)?' He replied, 'I used to order my employees to grant time to the rich \nperson to pay his debts at his convenience.' So Allah said to the angels; \"Excuse him.\" Rabi said that \n(the dead man said), 'I used to be easy to the rich and grant time to the poor.' Or, in another narration, \n'grant time to the well-off and forgive the needy,' or, 'accept from the well-off and forgive the needy.'", "grade": "Sahih", "narratedBy": "Narrated Hudhaifa:", "reference": "https://sunnah.com/bukhari:2077", "inBookReference": "Book 34, Hadith 30"}, {"id": 31, "hadithNumber": "2078", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"There was a merchant who used to lend the people, and whenever his debtor was in \nstraitened circumstances, he would say to his employees, 'Forgive him so that Allah may forgive us.' \nSo, Allah forgave him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2078", "inBookReference": "Book 34, Hadith 31"}, {"id": 32, "hadithNumber": "2079", "text": "Narrated Hakim bin Hizam: Allah's Messenger (ﷺ) said, \"The seller and the buyer have the right to keep or return goods as long as they \nhave not parted or till they part; and if both the parties spoke the truth and described the defects and \nqualities (of the goods), then they would be blessed in their transaction, and if they told lies or hid \nsomething, then the blessings of their transaction would be lost.\"", "grade": "Sahih", "narratedBy": "Narrated Hakim bin Hizam:", "reference": "https://sunnah.com/bukhari:2079", "inBookReference": "Book 34, Hadith 32"}, {"id": 33, "hadithNumber": "2080", "text": "Narrated Abu Sa`id: We used to be given mixed dates (from the booty) and used to sell (barter) two Sas of those dates) for \none Sa (of good dates). The Prophet (ﷺ) said (to us), \"No (bartering of) two Sas for one Sa nor two \nDirhams for one Dirham is permissible\", (as that is a kind of usury). (See Hadith No. 405).", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:2080", "inBookReference": "Book 34, Hadith 33"}, {"id": 34, "hadithNumber": "2081", "text": "Narrated Abu Mas`ud: An Ansari man, called Abu Shu'aib, came and told his butcher slave, \"Prepare meals sufficient for five \npersons, for I want to invite the Prophet (ﷺ) along with four other persons as I saw signs of hunger on his \nface.\" Abu Shu'aib invited them and another person came along with them. The Prophet (ﷺ) said (to Abu \nShu'aib), This man followed us, so if you allow him, he will join us, and if you want him to return, he \nwill go back.\" Abu Shu'aib said, \"No, I have allowed him (i.e. he, too, is welcomed to the meal).", "grade": "Sahih", "narratedBy": "Narrated Abu Mas`ud:", "reference": "https://sunnah.com/bukhari:2081", "inBookReference": "Book 34, Hadith 34"}, {"id": 35, "hadithNumber": "2082", "text": "Narrated Hakim bin Hizam: The Prophet (ﷺ) aid, \"The buyer and the seller have the option to cancel or to confirm the deal, as long as \nthey have not parted or till they part, and if they spoke the truth and told each other the defects of the \nthings, then blessings would be in their deal, and if they hid something and told lies, the blessing of \nthe deal would be lost.\"", "grade": "Sahih", "narratedBy": "Narrated Hakim bin Hizam:", "reference": "https://sunnah.com/bukhari:2082", "inBookReference": "Book 34, Hadith 35"}, {"id": 36, "hadithNumber": "2083", "text": "Narrated Abu Hurairah (ra): The Prophet (ﷺ) said \"Certainly a time will come when people will not bother to know from where they earned the money, by lawful means or unlawful means.\" (See Hadith no. 2050)", "grade": "Sahih", "narratedBy": "Narrated Abu Hurairah (ra):", "reference": "https://sunnah.com/bukhari:2083", "inBookReference": "Book 34, Hadith 36"}, {"id": 37, "hadithNumber": "2084", "text": "Narrated Aisha: When the last Verses of Surat al- Baqara were revealed, the Prophet (ﷺ) recited them in the mosque and \nproclaimed the trade of alcohol as illegal.", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2084", "inBookReference": "Book 34, Hadith 37"}, {"id": 38, "hadithNumber": "2085", "text": "Narrated Samura bin Jundab: The Prophet (ﷺ) said, \"This night I dreamt that two men came and took me to a Holy land whence we \nproceeded on till we reached a river of blood, where a man was standing, and on its bank was standing \nanother man with stones in his hands. The man in the middle of the river tried to come out, but the \nother threw a stone in his mouth and forced him to go back to his original place. So, whenever he tried \nto come out, the other man would throw a stone in his mouth and force him to go back to his former \nplace. I asked, 'Who is this?' I was told, 'The person in the river was a Riba-eater.\"", "grade": "Sahih", "narratedBy": "Narrated Samura bin Jundab:", "reference": "https://sunnah.com/bukhari:2085", "inBookReference": "Book 34, Hadith 38"}, {"id": 39, "hadithNumber": "2086", "text": "Narrated `Aun bin Abu Juhaifa: My father bought a slave who practiced the profession of cupping. (My father broke the slave's \ninstruments of cupping). I asked my father why he had done so. He replied, \"The Prophet (ﷺ) forbade the \nacceptance of the price of a dog or blood, and also forbade the profession of tattooing, getting tattooed \nand receiving or giving Riba, (usury), and cursed the picture-makers.\"", "grade": "Sahih", "narratedBy": "Narrated `Aun bin Abu Juhaifa:", "reference": "https://sunnah.com/bukhari:2086", "inBookReference": "Book 34, Hadith 39"}, {"id": 40, "hadithNumber": "2087", "text": "Narrated Abu Huraira: I heard Allah's Messenger (ﷺ) saying, \"The swearing (by the seller) may persuade the buyer to purchase the \ngoods but that will be deprived of Allah's blessing.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2087", "inBookReference": "Book 34, Hadith 40"}, {"id": 41, "hadithNumber": "2088", "text": "Narrated `Abdullah bin Abu `Aufa: A man displayed some goods in the market and swore by Allah that he had been offered so much for \nthat, that which was not offered, and he said so, so as to cheat a Muslim. On that occasion the \nfollowing Verse was revealed: \"Verily! Those who purchase a small gain at the cost of Allah's \ncovenant and their oaths (They shall have no portion in the Hereafter ..etc.)' (3.77)", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu `Aufa:", "reference": "https://sunnah.com/bukhari:2088", "inBookReference": "Book 34, Hadith 41"}, {"id": 42, "hadithNumber": "2089", "text": "Narrated `Ali: I got an old she-camel as my share from the booty, and the Prophet (ﷺ) had given me another from Al- \nKhumus. And when I intended to marry Fatima (daughter of the Prophet), I arranged that a goldsmith \nfrom the tribe of Bani Qainuqa' would accompany me in order to bring Idhkhir and then sell it to the \ngoldsmiths and use its price for my marriage banquet.", "grade": "Sahih", "narratedBy": "Narrated `Ali:", "reference": "https://sunnah.com/bukhari:2089", "inBookReference": "Book 34, Hadith 42"}, {"id": 43, "hadithNumber": "2090", "text": "Narrated Ibn `Abbas: Allah's Messenger (ﷺ) said, \"Allah made Mecca a sanctuary and it was neither permitted for anyone before, \nnor will it be permitted for anyone after me (to fight in it). And fighting in it was made legal for me \nfor a few hours of a day only. None is allowed to uproot its thorny shrubs or to cut down its trees or to \nchase its game or to pick up its Luqata (fallen things) except by a person who would announce it \npublicly.\" `Abbas bin `Abdul-Muttalib requested the Prophet, \"Except Al-Idhkhir, for our goldsmiths \nand for the roofs of our houses.\" The Prophet (ﷺ) said, \"Except Al-Idhkhir.\" `Ikrima said, \"Do you know \nwhat is meant by chasing its game? It is to drive it out of the shade and sit in its place.\" Khalid said, \n\"(`Abbas said: Al-Idhkhir) for our goldsmiths and our graves.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2090", "inBookReference": "Book 34, Hadith 43"}, {"id": 44, "hadithNumber": "2091", "text": "Narrated Khabbab: I was a blacksmith in the Pre-Islamic period, and 'Asi bin Wail owed me some money, so I went to \nhim to demand it. He said (to me), \"I will not pay you unless you disbelieve Muhammad.\" I said, \"I \nwill not disbelieve till Allah kills you and then you get resurrected.\" He said, \"Leave me till I die and \nget resurrected, then I will be given wealth and children and I will pay you your debt.\" On that \noccasion it was revealed to the Prophet: \n'Have you seen him who disbelieved in Our signs and says: Surely I will be given wealth and \nchildren? Has he known the unseen, or has he taken a covenant from the Beneficent (Allah)? (19.77- \n78)", "grade": "Sahih", "narratedBy": "Narrated Khabbab:", "reference": "https://sunnah.com/bukhari:2091", "inBookReference": "Book 34, Hadith 44"}, {"id": 45, "hadithNumber": "2092", "text": "Narrated 'Is-haq bin `Abdullah bin Abu Talha: I heard Anas bin Malik saying, \"A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. \" \nAnas bin Malik said, \"I accompanied Allah's Messenger (ﷺ) to that meal. He served the Prophet (ﷺ) with bread \nand soup made with gourd and dried meat. I saw the Prophet (ﷺ) taking the pieces of gourd from the \ndish.\" Anas added, \"Since that day I have continued to like gourd.\"", "grade": "Sahih", "narratedBy": "Narrated 'Is-haq bin `Abdullah bin Abu Talha:", "reference": "https://sunnah.com/bukhari:2092", "inBookReference": "Book 34, Hadith 45"}, {"id": 46, "hadithNumber": "2093", "text": "Narrated Abu Hazim: I heard Sahl bin Sa`d saying, \"A woman brought a Burda (i.e. a square piece of cloth having edging). I \nasked, 'Do you know what a Burda is?' They replied in the affirmative and said, \"It is a cloth sheet \nwith woven margins.\" Sahl went on, \"She addressed the Prophet (ﷺ) and said, 'I have woven it with my \nhands for you to wear.' The Prophet (ﷺ) took it as he was in need of it, and came to us wearing it as a \nwaist sheet. One of us said, 'O Allah's Messenger (ﷺ)! Give it to me to wear.' The Prophet (ﷺ) agreed to give it to \nhim. The Prophet (ﷺ) sat with the people for a while and then returned (home), wrapped that waist sheet \nand sent it to him. The people said to that man, 'You haven't done well by asking him for it when you \nknow that he never turns down anybody's request.' The man replied, 'By Allah, I have not asked him \nfor it except to use it as my shroud when I die.\" Sahl added; \"Later it (i.e. that sheet) was his shroud.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Hazim:", "reference": "https://sunnah.com/bukhari:2093", "inBookReference": "Book 34, Hadith 46"}, {"id": 47, "hadithNumber": "2094", "text": "Narrated Abu Hazim: Some men came to Sahl bin Sa`d to ask him about the pulpit. He replied, \"Allah's Messenger (ﷺ) sent for a \nwoman (Sahl named her) (this message): 'Order your slave carpenter to make pieces of wood (i.e. a \npulpit) for me so that I may sit on it while addressing the people.' So, she ordered him to make it from \nthe tamarisk of the forest. He brought it to her and she sent it to Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) \nordered it to be placed in the mosque: so, it was put and he sat on it.", "grade": "Sahih", "narratedBy": "Narrated Abu Hazim:", "reference": "https://sunnah.com/bukhari:2094", "inBookReference": "Book 34, Hadith 47"}, {"id": 48, "hadithNumber": "2095", "text": "Narrated Jabir bin `Abdullah: An Ansari woman said to Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! Shall I make something for you to sit \non, as I have a slave who is a carpenter?\" He replied, \"If you wish.\" So, she got a pulpit made for him. \nWhen it was Friday the Prophet (ﷺ) sat on that pulpit. The date-palm stem near which the Prophet (ﷺ) used to \ndeliver his sermons cried so much so that it was about to burst. The Prophet (ﷺ) came down from the \npulpit to the stem and embraced it and it started groaning like a child being persuaded to stop crying \nand then it stopped crying. The Prophet (ﷺ) said,\"It has cried because of (missing) what it use to hear of \nthe religions knowledge.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2095", "inBookReference": "Book 34, Hadith 48"}, {"id": 49, "hadithNumber": "2096", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) bought food grains from a Jew on credit and mortgaged his armor to him.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2096", "inBookReference": "Book 34, Hadith 49"}, {"id": 50, "hadithNumber": "2097", "text": "Narrated Jabir bin `Abdullah: I was with the Prophet (ﷺ) in a Ghazwa (Military Expedition) and my camel was slow and exhausted. The \nProphet came up to me and said, \"O Jabir.\" I replied, \"Yes?\" He said, \"What is the matter with you?\" I \nreplied, \"My camel is slow and tired, so I am left behind.\" So, he got down and poked the camel with \nhis stick and then ordered me to ride. I rode the camel and it became so fast that I had to hold it from \ngoing ahead of Allah's Messenger (ﷺ) . He then asked me, have you got married?\" I replied in the \naffirmative. He asked, \"A virgin or a matron?\" I replied, \"I married a matron.\" The Prophet (ﷺ) said, \n\"Why have you not married a virgin, so that you may play with her and she may play with you?\" Jabir \nreplied, \"I have sisters (young in age) so I liked to marry a matron who could collect them all and \ncomb their hair and look after them.\" The Prophet (ﷺ) said, \"You will reach, so when you have arrived (at \nhome), I advise you to associate with your wife (that you may have an intelligent son).\" Then he asked \nme, \"Would you like to sell your camel?\" I replied in the affirmative and the Prophet (ﷺ) purchased it for \none Uqiya of gold. Allah's Messenger (ﷺ) reached before me and I reached in the morning, and when I went \nto the mosque, I found him at the door of the mosque. He asked me, \"Have you arrived just now?\" I \nreplied in the affirmative. He said, \"Leave your camel and come into (the mosque) and pray two \nrak`at.\" I entered and offered the prayer. He told Bilal to weigh and give me one Uqiya of gold. So \nBilal weighed for me fairly and I went away. The Prophet (ﷺ) sent for me and I thought that he would \nreturn to me my camel which I hated more than anything else. But the Prophet (ﷺ) said to me, \"Take your \ncamel as well as its price.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2097", "inBookReference": "Book 34, Hadith 50"}, {"id": 51, "hadithNumber": "2098", "text": "Narrated Ibn `Abbas: `Ukaz, Majanna and Dhul-Majaz were markets in the Pre-Islamic period. When the people embraced \nIslam they considered it a sin to trade there. So, the following Holy Verse came:-- 'There is no harm \nfor you if you seek of the bounty of your Lord (Allah) in the Hajj season.\" (2.198) Ibn `Abbas recited \nit like this.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2098", "inBookReference": "Book 34, Hadith 51"}, {"id": 52, "hadithNumber": "2099", "text": "Narrated `Amr: Here (i.e. in Mecca) there was a man called Nawwas and he had camels suffering from the disease of \nexcessive and unquenchable thirst. Ibn `Umar went to the partner of Nawwas and bought those \ncamels. The man returned to Nawwas and told him that he had sold those camels. Nawwas asked him, \n\"To whom have you sold them?\" He replied, \"To such and such Sheikh.\" Nawwas said, \"Woe to you; \nBy Allah, that Sheikh was Ibn `Umar.\" Nawwas then went to Ibn `Umar and said to him, \"My partner \nsold you camels suffering from the disease of excessive thirst and he had not known you.\" Ibn `Umar \ntold him to take them back. When Nawwas went to take them, Ibn `Umar said to him, \"Leave them \nthere as I am happy with the decision of Allah's Messenger (ﷺ) that there is no oppression . \"", "grade": "Sahih", "narratedBy": "Narrated `Amr:", "reference": "https://sunnah.com/bukhari:2099", "inBookReference": "Book 34, Hadith 52"}, {"id": 53, "hadithNumber": "2100", "text": "Narrated Abu Qatada: We set out with Allah's Messenger (ﷺ) in the year of Hunain, (the Prophet (ﷺ) gave me an armor). I sold that \narmor and bought a garden in the region of the tribe of Bani Salama and that was the first property I \ngot after embracing Islam.", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:2100", "inBookReference": "Book 34, Hadith 53"}, {"id": 54, "hadithNumber": "2101", "text": "Narrated Abu Musa: Allah's Messenger (ﷺ) said, \"The example of a good companion (who sits with you) in comparison with a \nbad one, is like that of the musk seller and the blacksmith's bellows (or furnace); from the first you \nwould either buy musk or enjoy its good smell while the bellows would either burn your clothes or \nyour house, or you get a bad nasty smell thereof.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/bukhari:2101", "inBookReference": "Book 34, Hadith 54"}, {"id": 55, "hadithNumber": "2102", "text": "Narrated Anas bin Malik: Abu Taiba cupped Allah's Messenger (ﷺ) so he ordered that he be paid one Sa of dates and ordered his \nmasters to reduce his tax (as he was a slave and had to pay a tax to them).", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2102", "inBookReference": "Book 34, Hadith 55"}, {"id": 56, "hadithNumber": "2103", "text": "Narrated Ibn `Abbas: Once the Prophet (ﷺ) got his blood out (medically) and paid that person who had done it. If it had been \nillegal, the Prophet (ﷺ) would not have paid him.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2103", "inBookReference": "Book 34, Hadith 56"}, {"id": 57, "hadithNumber": "2104", "text": "Narrated `Abdullah bin `Umar: Once the Prophet (ﷺ) sent to `Umar a silken two-piece garment, and when he saw `Umar wearing it, he \nsaid to him, \"I have not sent it to you to wear. It is worn by him who has no share in the Hereafter, and \nI have sent it to you so that you could benefit by it (i.e. sell it).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2104", "inBookReference": "Book 34, Hadith 57"}, {"id": 58, "hadithNumber": "2105", "text": "Narrated Aisha: (mother of the faithful believers) I bought a cushion with pictures on it. When Allah's Messenger (ﷺ) saw it, \nhe kept standing at the door and did not enter the house. I noticed the sign of disgust on his face, so I \nsaid, \"O Allah's Messenger (ﷺ)! I repent to Allah and H is Apostle . (Please let me know) what sin I have \ndone.\" Allah's Messenger (ﷺ) said, \"What about this cushion?\" I replied, \"I bought it for you to sit and recline \non.\" Allah's Messenger (ﷺ) said, \"The painters (i.e. owners) of these pictures will be punished on the Day of \nResurrection. It will be said to them, 'Put life in what you have created (i.e. painted).' \" The Prophet (ﷺ) \nadded, \"The angels do not enter a house where there are pictures.\"", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2105", "inBookReference": "Book 34, Hadith 58"}, {"id": 59, "hadithNumber": "2106", "text": "Narrated Anas: The Prophet (ﷺ) said, \"O Bani Najjar! Suggest a price for your garden.\" Part of it was a ruin and it \ncontained some date palms.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2106", "inBookReference": "Book 34, Hadith 59"}, {"id": 60, "hadithNumber": "2107", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"The buyer and the seller have the option to cancel or confirm the bargain before \nthey separate from each other or if the sale is optional.\" Nafi` said, \"Ibn `Umar used to separate \nquickly from the seller if he had bought a thing which he liked.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2107", "inBookReference": "Book 34, Hadith 60"}, {"id": 61, "hadithNumber": "2108", "text": "Narrated Hakim bin Hizam\": The Prophet (ﷺ) said, \"The buyer and the seller have the option of canceling or confirming the deal unless \nthey separate.\"", "grade": "Sahih", "narratedBy": "Narrated Hakim bin Hizam\":", "reference": "https://sunnah.com/bukhari:2108", "inBookReference": "Book 34, Hadith 61"}, {"id": 62, "hadithNumber": "2109", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"The seller and the buyer have the option of canceling or confirming the deal \nunless they separate, or one of them says to the other, 'Choose (i.e. decide to cancel or confirm the \nbargain now).\" Perhaps he said, 'Or if it is an optional sale.' \" Ibn `Umar, Shuraih, Ash-Shu`bi, Tawus, \nAta, and Ibn Abu Mulaika agree upon this judgment.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2109", "inBookReference": "Book 34, Hadith 62"}, {"id": 63, "hadithNumber": "2110", "text": "Narrated Hakim bin Hizam: The Prophet (ﷺ) said, \"The buyer and the seller have the option of canceling or confirming the bargain \nunless they separate, and if they spoke the truth and made clear the defects of the goods, them they \nwould be blessed in their bargain, and if they told lies and hid some facts, their bargain would be \ndeprived of Allah's blessings.\"", "grade": "Sahih", "narratedBy": "Narrated Hakim bin Hizam:", "reference": "https://sunnah.com/bukhari:2110", "inBookReference": "Book 34, Hadith 63"}, {"id": 64, "hadithNumber": "2111", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"Both the buyer and the seller have the option of canceling or confirming a \nbargain unless they separate, or the sale is optional.\" (See Hadith No.320).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2111", "inBookReference": "Book 34, Hadith 64"}, {"id": 65, "hadithNumber": "2112", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"Both the buyer and the seller have the option of canceling or confirming the \nbargain, as long as they are still together; and unless they separate or one of them gives the other the \noption of keeping or returning the things and a decision is concluded then, in which case the bargain is considered final. If they separate after the bargain and none of them has rejected it, then the bargain is rendered final.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2112", "inBookReference": "Book 34, Hadith 65"}, {"id": 66, "hadithNumber": "2113", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"No deal is settled and finalized unless the buyer and the seller separate, except if \nthe deal is optional (whereby the validity of the bargain depends on the stipulations agreed upon).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2113", "inBookReference": "Book 34, Hadith 66"}, {"id": 67, "hadithNumber": "2114", "text": "Narrated Hakim bin Hizam: The Prophet (ﷺ) said, \"Both the buyer and the seller have the option of canceling or confirming the \nbargain unless they separate.\" The sub-narrator, Hammam said, \"I found this in my book: 'Both the \nbuyer and the seller give the option of either confirming or canceling the bargain three times, and if \nthey speak the truth and mention the defects, then their bargain will be blessed, and if they tell lies and \nconceal the defects, they might gain some financial gain but they will deprive their sale of (Allah's) \nblessings.\"", "grade": "Sahih", "narratedBy": "Narrated Hakim bin Hizam:", "reference": "https://sunnah.com/bukhari:2114", "inBookReference": "Book 34, Hadith 67"}, {"id": 68, "hadithNumber": "2115", "text": "Narrated Ibn 'Umar (ra) : We were accompanying the Prophet (ﷺ) on a journey and I was riding an unmanageable camel belonging to 'Umar (ra), and I could not bring it under my control. So, it used to go ahead of the party and 'Umar would check it and force it to retreat, and again it went ahead and again 'Umar forced it to retreat. The Prophet (ﷺ) asked 'Umar to sell that camel to him. 'Umar replied, \"It is for you O Allah's Messenger !\" Allah's Messenger (ﷺ) told 'Umar to sell that camel to him (not to give it as gift). So, 'Umar sold it to  Allah's Messenger (ﷺ). Then the Prophet (ﷺ) said to 'Abdullah bin 'Umar \"This camel is for you O 'Abdullah (as a present) and you could do with it whatever you like.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn 'Umar (ra) :", "reference": "https://sunnah.com/bukhari:2115", "inBookReference": "Book 34, Hadith 68"}, {"id": 69, "hadithNumber": "2116", "text": "Narrated  'Abdullah bin 'Umar (ra): I bartered my property in Khaibar to 'Uthman (chief of the faithful believers) for his property in Al-Wadi. When we finished the deal, I left immediately and got out of his house lest he should cancel the deal, for the tradition was that they buyer and the seller had the option of canceling the bargain unless they separated.  When out deal was completed, I came to know that I have been unfair to 'Uthman, for by selling him my land I caused him to be in a land of Thamud, at a distance of three days journey from Al-Madina, while he made me neared to Al-Madina, at a distance of three days journey from my former land.", "grade": "Sahih", "narratedBy": "Narrated  'Abdullah bin 'Umar (ra):", "reference": "https://sunnah.com/bukhari:2116", "inBookReference": "Book 34, Hadith 69"}, {"id": 70, "hadithNumber": "2117", "text": "Narrated `Abdullah bin `Umar: A person came to the Prophet (ﷺ) and told him that he was always betrayed in purchasing. The Prophet (ﷺ) \ntold him to say at the time of buying, \"No cheating.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2117", "inBookReference": "Book 34, Hadith 70"}, {"id": 71, "hadithNumber": "2118", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) said, \"An army will invade the Ka`ba and when the invaders reach Al-Baida', all the \nground will sink and swallow the whole army.\" I said, \"O Allah's Messenger (ﷺ)! How will they sink into the \nground while amongst them will be their markets (the people who worked in business and not \ninvaders) and the people not belonging to them?\" The Prophet (ﷺ) replied, \"all of those people will sink \nbut they will be resurrected and judged according to their intentions.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2118", "inBookReference": "Book 34, Hadith 71"}, {"id": 72, "hadithNumber": "2119", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"The congregational prayer of anyone amongst you is more than twenty (five or \ntwenty seven) times in reward than his prayer in the market or in his house, for if he performs ablution \ncompletely and then goes to the mosque with the sole intention of performing the prayer, and nothing \nurges him to proceed to the mosque except the prayer, then, on every step which he takes towards the \nmosque, he will be raised one degree or one of his sins will be forgiven. The angels will keep on \nasking Allah's forgiveness and blessings for everyone of you so long as he keeps sitting at his praying \nplace. The angels will say, 'O Allah, bless him! O Allah, be merciful to him!' as long as he does not do \nHadath or a thing which gives trouble to the other.\" The Prophet (ﷺ) further said, \"One is regarded in \nprayer so long as one is waiting for the prayer.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2119", "inBookReference": "Book 34, Hadith 72"}, {"id": 73, "hadithNumber": "2120", "text": "Narrated Anas bin Malik: While the Prophet (ﷺ) was in the market, somebody, called, \"O Abul-Qasim.\" The Prophet (ﷺ) turned to him. \nThe man said, \"I have called to this (i.e. another man).\" The Prophet (ﷺ) said, \"Name yourselves by my \nname but not by my Kunya (name).\" (In Arabic world it is the custom to call the man as the father of \nhis eldest son, e.g. Abul-Qasim.) \n(See Hadith No. 737, Vol. 4)", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2120", "inBookReference": "Book 34, Hadith 73"}, {"id": 74, "hadithNumber": "2121", "text": "Narrated Anas: A man at Al-Baqi' called, \"O Abul-Qasim!\" The Prophet (ﷺ) turned to him and the man said (to the \nProphet ), \"I did not intend to call you.\" The prophet said, \"Name yourselves by my name but not by \nmy Kunya (name).", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2121", "inBookReference": "Book 34, Hadith 74"}, {"id": 75, "hadithNumber": "2122", "text": "Narrated Abu Huraira Ad-Dausi: Once the Prophet (ﷺ) went out during the day. Neither did he talk to me nor I to him till he reached the \nmarket of Bani Qainuqa and then he sat in the compound of Fatima's house and asked about the small \nboy (his grandson Al-Hasan) but Fatima kept the boy in for a while. I thought she was either changing \nhis clothes or giving the boy a bath. After a while the boy came out running and the Prophet (ﷺ) embraced \nand kissed him and then said, 'O Allah! Love him, and love whoever loves him.'", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira Ad-Dausi:", "reference": "https://sunnah.com/bukhari:2122", "inBookReference": "Book 34, Hadith 75"}, {"id": 76, "hadithNumber": "2123", "text": "Narrated Nafi`: Ibn `Umar told us that the people used to buy food from the caravans in the lifetime of the Prophet. \nThe Prophet (ﷺ) used to forbid them to sell it at the very place where they had purchased it (but they were \nto wait) till they carried it to the market where foodstuff was sold. Ibn `Umar said, 'The Prophet (ﷺ) also \nforbade the reselling of foodstuff by somebody who had bought it unless he had received it with exact \nfull measure.'", "grade": "Sahih", "narratedBy": "Narrated Nafi`:", "reference": "https://sunnah.com/bukhari:2123", "inBookReference": "Book 34, Hadith 76"}, {"id": 77, "hadithNumber": "2125", "text": "Narrated Ata bin Yasar: I met `Abdullah bin `Amr bin Al-`As and asked him, \"Tell me about the description of Allah's Messenger (ﷺ) \nwhich is mentioned in Torah (i.e. Old Testament.\") He replied, 'Yes. By Allah, he is described in \nTorah with some of the qualities attributed to him in the Qur'an as follows: \n\"O Prophet ! We have sent you as a witness (for Allah's True religion) And a giver of glad tidings (to \nthe faithful believers), And a warner (to the unbelievers) And guardian of the illiterates. You are My \nslave and My messenger (i.e. Apostle). I have named you \"Al-Mutawakkil\" (who depends upon \nAllah). You are neither discourteous, harsh Nor a noisemaker in the markets And you do not do evil to \nthose Who do evil to you, but you deal With them with forgiveness and kindness. Allah will not let \nhim (the Prophet) Die till he makes straight the crooked people by making them say: \"None has the \nright to be worshipped but Allah,\" With which will be opened blind eyes And deaf ears and enveloped \nhearts.\"", "grade": "Sahih", "narratedBy": "Narrated Ata bin Yasar:", "reference": "https://sunnah.com/bukhari:2125", "inBookReference": "Book 34, Hadith 77"}, {"id": 78, "hadithNumber": "2126", "text": "Narrated `Abdullah ibn `Umar: Allah's Messenger (ﷺ) said, \"He who buys foodstuff should not sell it till he is satisfied with the measure \nwith which he has bought it.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah ibn `Umar:", "reference": "https://sunnah.com/bukhari:2126", "inBookReference": "Book 34, Hadith 78"}, {"id": 79, "hadithNumber": "2127", "text": "Narrated Jabir: `Abdullah bin `Amr bin Haram died and was in debt to others. I asked the Prophet (ﷺ) to intercede with \nhis creditors for some reduction in the debts. The Prophet (ﷺ) requested them (to reduce the debts) but \nthey refused. The Prophet (ﷺ) said to me, \"Go and put your dates (In heaps) according to their different \nkinds. The Ajwa on one side, the cluster of Ibn Zaid on another side, etc.. Then call me.\" I did that and \ncalled the Prophet (ﷺ) He came and sat at the head or in the middle of the heaps and ordered me. Measure \n(the dates) for the people (creditors).\" I measured for them till I paid all the debts. My dates remained \nas it nothing had been taken from them. In other narrations, Jabir said; The Prophet (ﷺ) said, \"He (i.e. \n`Abdullah) continued measuring for them till he paid all the debts.\" The Prophet (ﷺ) said (to `Abdullah), \n\"Cut (clusters) for him (i.e. one of the creditors) and measure for him fully.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2127", "inBookReference": "Book 34, Hadith 79"}, {"id": 80, "hadithNumber": "2128", "text": "Narrated Al-Miqdam bin Ma'diyakrib: The Prophet (ﷺ) said, \"Measure your foodstuff and you will be blessed.\"", "grade": "Sahih", "narratedBy": "Narrated Al-Miqdam bin Ma'diyakrib:", "reference": "https://sunnah.com/bukhari:2128", "inBookReference": "Book 34, Hadith 80"}, {"id": 81, "hadithNumber": "2129", "text": "Narrated `Abdullah bin Zaid: The Prophet (ﷺ) said, \"The Prophet (ﷺ) Abraham made Mecca a sanctuary, and asked for Allah's blessing in \nit. I made Medina a sanctuary as Abraham made Mecca a sanctuary and I asked for Allah's Blessing in \nits measures the Mudd and the Sa as Abraham did for Mecca.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Zaid:", "reference": "https://sunnah.com/bukhari:2129", "inBookReference": "Book 34, Hadith 81"}, {"id": 82, "hadithNumber": "2130", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) said, \"O Allah bestow your blessings on their measures, bless their Mudd and Sa.\" \nThe Prophet (ﷺ) meant the people of Medina.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2130", "inBookReference": "Book 34, Hadith 82"}, {"id": 83, "hadithNumber": "2131", "text": "Narrated Salim: that his father said. \"I saw those, who used to buy foodstuff without measuring or weighing in the life \ntime of the Prophet (ﷺ) being punished if they sold it before carrying it to their own houses.\"", "grade": "Sahih", "narratedBy": "Narrated Salim:", "reference": "https://sunnah.com/bukhari:2131", "inBookReference": "Book 34, Hadith 83"}, {"id": 84, "hadithNumber": "2132", "text": "Narrated Tawus: Ibn `Abbas said, \"Allah's Messenger (ﷺ) forbade the selling of foodstuff before its measuring and \ntransferring into one's possession.\" I asked Ibn `Abbas, \"How is that?\" Ibn `Abbas replied, \"It will be \njust like selling money for money, as the foodstuff has not been handed over to the first purchaser who \nis the present seller.\"", "grade": "Sahih", "narratedBy": "Narrated Tawus:", "reference": "https://sunnah.com/bukhari:2132", "inBookReference": "Book 34, Hadith 84"}, {"id": 85, "hadithNumber": "2133", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"He who buys foodstuff should not sell it till he has received it.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2133", "inBookReference": "Book 34, Hadith 85"}, {"id": 86, "hadithNumber": "2134", "text": "Narrated Az-Zuhri from Malik bin Aus: That the latter said, \"Who has change?\" Talha said, \"I (will have change) when our storekeeper comes \nfrom the forest.\" \n\nMalik bin Aus narrated from `Umar bin Al-Khattab: Allah's Messenger (ﷺ) said, \"The bartering of gold for gold is Riba \n(usury), except if it is from hand to hand and equal in amount, and wheat grain for wheat grain is \nusury except if it is form hand to hand and equal in amount, and dates for dates is usury except if it is \nfrom hand to hand and equal in amount, and barley for barley is usury except if it is from hand to hand \nand equal in amount.\"", "grade": "Sahih", "narratedBy": "Narrated Az-Zuhri from Malik bin Aus:", "reference": "https://sunnah.com/bukhari:2134", "inBookReference": "Book 34, Hadith 86"}, {"id": 87, "hadithNumber": "2135", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) forbade the selling of foodstuff before receiving it. I consider that all types of sellings \nshould be done similarly.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2135", "inBookReference": "Book 34, Hadith 87"}, {"id": 88, "hadithNumber": "2136", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"The buyer of foodstuff should not sell it before it has been measured for him.\" \nIsma`il narrated instead, \"He should not sell it before receiving it.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2136", "inBookReference": "Book 34, Hadith 88"}, {"id": 89, "hadithNumber": "2137", "text": "Narrated Ibn `Umar: I saw the people buy foodstuff randomly (i.e. blindly without measuring it) in the lifetime of Allah's \nApostle and they were punished (by beating), if they tried to sell it before carrying it to their own \nhouses.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2137", "inBookReference": "Book 34, Hadith 89"}, {"id": 90, "hadithNumber": "2138", "text": "Narrated Aisha: Rarely did the Prophet (ﷺ) fail to visit Abu Bakr's house everyday, either in the morning or in the evening. \nWhen the permission for migration to Medina was granted, all of a sudden the Prophet (ﷺ) came to us at \nnoon and Abu Bakr was informed, who said, \"Certainly the Prophet (ﷺ) has come for some urgent \nmatter.\" The Prophet (ﷺ) said to Abu Bark, when the latter entered \"Let nobody stay in your home.\" Abu \nBakr said, \"O Allah's Messenger (ﷺ)! There are only my two daughters (namely `Aisha and Asma') present.\" \nThe Prophet (ﷺ) said, \"I feel (am informed) that I have been granted the permission for migration.\" Abu \nBakr said, \"I will accompany you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"You will accompany me.\" \nAbu Bakr then said \"O Allah's Messenger (ﷺ)! I have two she-camels I have prepared specially for migration, \nso I offer you one of them. The Prophet (ﷺ) said, \"I have accepted it on the condition that I will pay its \nprice.\"", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2138", "inBookReference": "Book 34, Hadith 90"}, {"id": 91, "hadithNumber": "2139", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"Do not urge somebody to return what he has already bought (i.e. in optional \nsale) from another seller so as to sell him your own goods.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2139", "inBookReference": "Book 34, Hadith 91"}, {"id": 92, "hadithNumber": "2140", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) forbade the selling of things by a town dweller on behalf of a desert dweller; and \nsimilarly Najsh was forbidden. And one should not urge somebody to return the goods to the seller so \nas to sell him his own goods; nor should one demand the hand of a girl who has already been engaged \nto someone else; and a woman should not try to cause some other woman to be divorced in order to \ntake her place.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2140", "inBookReference": "Book 34, Hadith 92"}, {"id": 93, "hadithNumber": "2141", "text": "Narrated Jabir bin `Abdullah: A man decided that a slave of his would be manumitted after his death and later on he was in need of \nmoney, so the Prophet (ﷺ) took the slave and said, \"Who will buy this slave from me?\" Nu'aim bin \n`Abdullah bought him for such and such price and the Prophet (ﷺ) gave him the slave.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2141", "inBookReference": "Book 34, Hadith 93"}, {"id": 94, "hadithNumber": "2142", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) forbade Najsh.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2142", "inBookReference": "Book 34, Hadith 94"}, {"id": 95, "hadithNumber": "2143", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) forbade the sale called 'Habal-al-Habala which was a kind of sale practiced in the Pre- \nIslamic Period of ignorance. One would pay the price of a she-camel which was not born yet would be \nborn by the immediate offspring of an extant she-camel.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2143", "inBookReference": "Book 34, Hadith 95"}, {"id": 96, "hadithNumber": "2144", "text": "Narrated Abu Sa`id: Allah's Messenger (ﷺ) forbade the selling by Munabadha, i.e. to sell one's garment by casting it to the buyer \nnot allowing him to examine or see it. Similarly he forbade the selling by Mulamasa. Mulamasa is to \nbuy a garment, for example, by merely touching it, not looking at it.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:2144", "inBookReference": "Book 34, Hadith 96"}, {"id": 97, "hadithNumber": "2145", "text": "Narrated Abu Huraira: The Prophet (ﷺ) forbade two kinds of dressing; (one of them) is to sit with one's legs drawn up while \nwrapped in one garment. (The other) is to lift that garment on one's shoulders. And also forbade two \nkinds of sale: Al-Limais and An-Nibadh.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2145", "inBookReference": "Book 34, Hadith 97"}, {"id": 98, "hadithNumber": "2146", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) forbade selling by Mulamasa and Munabadha.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2146", "inBookReference": "Book 34, Hadith 98"}, {"id": 99, "hadithNumber": "2147", "text": "Narrated Abu Sa`id: The Prophet (ﷺ) forbade two kinds of dresses and two kinds of sale, i.e., Mulamasa and Munabadha.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:2147", "inBookReference": "Book 34, Hadith 99"}, {"id": 100, "hadithNumber": "2148", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Don't keep camels and sheep unmilked for a long time, for whoever buys such an \nanimal has the option to milk it and then either to keep it or return it to the owner along with one Sa of \ndates.\" Some narrated from Ibn Seereen (that the Prophet (ﷺ) had said), \"One Sa of wheat, and he has the \noption for three days.\" And some narrated from Ibn Seereen, \" ... a Sa of dates,\" not mentioning the \noption for three days. But a Sa of dates is mentioned in most narrations.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2148", "inBookReference": "Book 34, Hadith 100"}, {"id": 101, "hadithNumber": "2149", "text": "Narrated `Abdullah bin Mas`ud: Whoever buys a sheep which has not been milked for a long time, has the option of returning it along \nwith one Sa of dates; and the Prophet (ﷺ) forbade going to meet the seller on the way (as he has no \nknowledge of the market price and he may sell his goods at a low price).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Mas`ud:", "reference": "https://sunnah.com/bukhari:2149", "inBookReference": "Book 34, Hadith 101"}, {"id": 102, "hadithNumber": "2150", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Do not go forward to meet the caravan (to buy from it on the way before it \nreaches the town). And do not urge buyers to cancel their purchases to sell them (your own goods) \nyourselves, and do not practice Najsh. A town dweller should not sell the goods for the desert dweller. \nDo not leave sheep unmilked for a long time, when they are on sale, and whoever buys such an animal \nhas the option of returning it, after milking it, along with a Sa of dates or keeping it. it has been kept \nunmilked for a long period by the seller (to deceive others).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2150", "inBookReference": "Book 34, Hadith 102"}, {"id": 103, "hadithNumber": "2151", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Whoever buys a sheep which has been kept unmilked for a long period, and \nmilks it, can keep it if he is satisfied, and if he is not satisfied, he can return it, but he should pay one \nSa of dates for the milk.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2151", "inBookReference": "Book 34, Hadith 103"}, {"id": 104, "hadithNumber": "2152", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"If a slave-girl commits illegal sexual intercourse and it is proved beyond doubt, \nthen her owner should lash her and should not blame her after the legal punishment. And then if she \nrepeats the illegal sexual intercourse he should lash her again and should not blame her after the legal \npunishment, and if she commits it a third time, then he should sell her even for a hair rope.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2152", "inBookReference": "Book 34, Hadith 104"}, {"id": 105, "hadithNumber": "2153", "text": "Narrated Abu Huraira and Zaid bin Khalid: Allah's Messenger (ﷺ) was asked about the slave-girl, if she was a virgin and committed illegal sexual \nintercourse. The Prophet (ﷺ) said, \"If she committed illegal sexual intercourse, lash her, and if she did it a \nsecond time, then lash her again, and if she repeated the third time, then sell her even for a hair rope.\" \nIbn Shihab said, \"I don't know whether to sell her after the third or fourth offense.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira and Zaid bin Khalid:", "reference": "https://sunnah.com/bukhari:2153", "inBookReference": "Book 34, Hadith 105"}, {"id": 106, "hadithNumber": "2155", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) came to me and I told him about the slave-girl (Barirah) Allah's Messenger (ﷺ) said, \"Buy \r\nand manumit her, for the Wala is for the one who manumits.\" In the evening the Prophet (ﷺ) got up and \r\nglorified Allah as He deserved and then said, \"Why do some people impose conditions which are not \r\npresent in Allah's Book (Laws)? Whoever imposes such a condition as is not in Allah's Laws, then \r\nthat condition is invalid even if he imposes one hundred conditions, for Allah's conditions are more \r\nbinding and reliable.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2155", "inBookReference": "Book 34, Hadith 106"}, {"id": 107, "hadithNumber": "2156", "text": "Narrated `Abdullah bin `Umar: Aisha wanted to buy Barirah and he (the Prophet) went out for the prayer. When he returned, she told \r\nhim that they (her masters) refused to sell her except on the condition that her Wala' would go to \r\nthem. The Prophet (ﷺ) replied, 'The Wala' would go to him who manumits.' \" Hammam asked Nafi` \r\nwhether her (Barirah's) husband was a free man or a slave. He replied that he did not know.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2156", "inBookReference": "Book 34, Hadith 107"}, {"id": 108, "hadithNumber": "2157", "text": "Narrated Jarir: I have given a pledge of allegiance to Allah's Messenger (ﷺ) for to testify that None has the right to be \nworshipped but Allah, and Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to \nlisten to and obey (Allah's and His Prophet's orders), and to give good advice to every Muslim.", "grade": "Sahih", "narratedBy": "Narrated Jarir:", "reference": "https://sunnah.com/bukhari:2157", "inBookReference": "Book 34, Hadith 108"}, {"id": 109, "hadithNumber": "2158", "text": "Narrated Tawus: Ibn `Abbas said, \"Allah's Messenger (ﷺ) said, 'Do not go to meet the caravans on the way (for buying their \ngoods without letting them know the market price); a town dweller should not sell the goods of a \ndesert dweller on behalf of the latter.' I asked Ibn `Abbas, 'What does he mean by not selling the goods \nof a desert dweller by a town dweller?' He said, 'He should not become his broker.' \"", "grade": "Sahih", "narratedBy": "Narrated Tawus:", "reference": "https://sunnah.com/bukhari:2158", "inBookReference": "Book 34, Hadith 109"}, {"id": 110, "hadithNumber": "2159", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) forbade the selling of the goods of a desert dweller by a town person.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2159", "inBookReference": "Book 34, Hadith 110"}, {"id": 111, "hadithNumber": "2160", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"A buyer should not urge a seller to restore a purchase so as to buy it himself, \nand do not practice Najsh; and a town dweller should not sell goods of a desert dweller.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2160", "inBookReference": "Book 34, Hadith 111"}, {"id": 112, "hadithNumber": "2161", "text": "Narrated Anas bin Malik: We were forbidden that a town dweller should sell goods of a desert dweller.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2161", "inBookReference": "Book 34, Hadith 112"}, {"id": 113, "hadithNumber": "2162", "text": "Narrated Abu Huraira: The Prophet (ﷺ) forbade the meeting (of caravans) on the way and the selling of goods by an inhabitant of \nthe town on behalf of a desert dweller.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2162", "inBookReference": "Book 34, Hadith 113"}, {"id": 114, "hadithNumber": "2163", "text": "Narrated Tawus: I asked Ibn `Abbas, \"What is the meaning of, 'No town dweller should sell (or buy) for a desert \ndweller'?\" Ibn `Abbas said, \"It means he should not become his broker.\"", "grade": "Sahih", "narratedBy": "Narrated Tawus:", "reference": "https://sunnah.com/bukhari:2163", "inBookReference": "Book 34, Hadith 114"}, {"id": 115, "hadithNumber": "2164", "text": "Narrated `Abdullah: Whoever buys an animal which has been kept unmilked for a long time, could return it, but has to pay \na Sa of dates along with it. And the Prophet (ﷺ) forbade meeting the owners of goods on the way away \nfrom the market.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2164", "inBookReference": "Book 34, Hadith 115"}, {"id": 116, "hadithNumber": "2165", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"You should not try to cancel the purchases of one another (to get a benefit \nthereof), and do not go ahead to meet the caravan (for buying the goods) (but wait) till it reaches the \nmarket.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2165", "inBookReference": "Book 34, Hadith 116"}, {"id": 117, "hadithNumber": "2166", "text": "Narrated `Abdullah: We used to go ahead to meet the caravan and used to buy foodstuff from them. The Prophet (ﷺ) forbade \nus to sell it till it was carried to the market.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2166", "inBookReference": "Book 34, Hadith 117"}, {"id": 118, "hadithNumber": "2167", "text": "Narrated `Abdullah: Some people used to buy foodstuff at the head of the market and used to sell it on the spot. Allah's \nApostle forbade them to sell it till they brought it to (their) places.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2167", "inBookReference": "Book 34, Hadith 118"}, {"id": 119, "hadithNumber": "2168", "text": "Narrated `Urwa: Aisha said, \"Barira came to me and said, 'I have agreed with my masters to pay them nine Uqiyas (of \ngold) (in installments) one Uqiya per year; please help me.' I said, 'I am ready to pay the whole \namount now provided your masters agree that your Wala' will be for me.' So, Barira went to her \nmasters and told them about that offer but they refused to accept it. She returned, and at that time, \nAllah's Messenger (ﷺ) was sitting (present). Barira said, 'I told them of the offer but they did not accept it \nand insisted on having the Wala'.' The Prophet (ﷺ) heard that.\" `Aisha narrated the whole story to the \nProphet. He said to her, \"Buy her and stipulate that her Wala' would be yours as the Wala' is for the \nmanumitter.\" `Aisha did so. Then Allah's Messenger (ﷺ) stood up in front of the people, and after glorifying \nAllah he said, \"Amma Ba`du (i.e. then after)! What about the people who impose conditions which are \nnot in Allah's Book (Laws)? Any condition that is not in Allah's Book (Laws) is invalid even if they \nwere one hundred conditions, for Allah's decisions are the right ones and His conditions are the strong \nones (firmer) and the Wala' will be for the manumitter.\"", "grade": "Sahih", "narratedBy": "Narrated `Urwa:", "reference": "https://sunnah.com/bukhari:2168", "inBookReference": "Book 34, Hadith 119"}, {"id": 120, "hadithNumber": "2169", "text": "Narrated `Abdullah bin `Umar: Aisha, (mother of the faithful believers) wanted to buy a slave girl and manumit her, but her masters \nsaid that they would sell her only on the condition that her Wala' would be for them. `Aisha told \nAllah's Messenger (ﷺ) of that. He said, \"What they stipulate should not hinder you from buying her, as the \nWala' is for the manumitted.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2169", "inBookReference": "Book 34, Hadith 120"}, {"id": 121, "hadithNumber": "2170", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"The selling of wheat for wheat is Riba (usury) except if it is handed from hand to \nhand and equal in amount. Similarly the selling of barley for barley, is Riba except if it is from hand to \nhand and equal in amount, and dates for dates is usury except if it is from hand to hand and equal in \namount. (See Riba-Fadl in the glossary).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2170", "inBookReference": "Book 34, Hadith 121"}, {"id": 122, "hadithNumber": "2171", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) forbade Muzabana; and Muzabana is the selling of fresh dates for dried old dates by \nmeasure, and the selling of fresh grapes for dried grapes by measure.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2171", "inBookReference": "Book 34, Hadith 122"}, {"id": 123, "hadithNumber": "2172", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) forbade Muzabana; and Muzabana is the selling of fresh fruit (without measuring it) for \nsomething by measure on the basis that if that thing turns to be more than the fruit, the increase would \nbe for the seller of the fruit, and if it turns to be less, that would be of his lot. \nNarrated Ibn `Umar from Zaid bin Thabit that the Prophet (ﷺ) allowed the selling of the fruits on the trees \nafter estimation (when they are ripe).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2172", "inBookReference": "Book 34, Hadith 123"}, {"id": 124, "hadithNumber": "2174", "text": "Narrated Ibn Shihab: that Malik bin Aus said, \"I was in need of change for one-hundred Dinars. Talha bin 'Ubaidullah \ncalled me and we discussed the matter, and he agreed to change (my Dinars). He took the gold pieces \nin his hands and fidgeted with them, and then said, \"Wait till my storekeeper comes from the forest.\" \n`Umar was listening to that and said, \"By Allah! You should not separate from Talha till you get the \nmoney from him, for Allah's Messenger (ﷺ) said, 'The selling of gold for gold is Riba (usury) except if the \nexchange is from hand to hand and equal in amount, and similarly, the selling of wheat for wheat is \nRiba (usury) unless it is from hand to hand and equal in amount, and the selling of barley for barley is \nusury unless it is from hand to hand and equal in amount, and dates for dates, is usury unless it is from \nhand to hand and equal in amount\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Shihab:", "reference": "https://sunnah.com/bukhari:2174", "inBookReference": "Book 34, Hadith 124"}, {"id": 125, "hadithNumber": "2175", "text": "Narrated Abu Bakra: Allah's Messenger (ﷺ) said, \"Don't sell gold for gold unless equal in weight, nor silver for silver unless equal \nin weight, but you could sell gold for silver or silver for gold as you like.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Bakra:", "reference": "https://sunnah.com/bukhari:2175", "inBookReference": "Book 34, Hadith 125"}, {"id": 126, "hadithNumber": "2176", "text": "Narrated Abu Sa`id: (Concerning exchange) that he heard Allah's Messenger (ﷺ) saying, \"Do not sell gold for gold unless equal in \nweight, and do not sell silver unless equal in weight.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id:", "reference": "https://sunnah.com/bukhari:2176", "inBookReference": "Book 34, Hadith 126"}, {"id": 127, "hadithNumber": "2177", "text": "Narrated Abu Sa`id Al-Khudri: Allah's Messenger (ﷺ) said, \"Do not sell gold for gold unless equivalent in weight, and do not sell less \namount for greater amount or vice versa; and do not sell silver for silver unless equivalent in weight, \nand do not sell less amount for greater amount or vice versa and do not sell gold or silver that is not \npresent at the moment of exchange for gold or silver that is present.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:2177", "inBookReference": "Book 34, Hadith 127"}, {"id": 128, "hadithNumber": "2178", "text": "Narrated Abu Salih Az-Zaiyat: I heard Abu Sa`id Al-Khudri saying, \"The selling of a Dinar for a Dinar, and a Dirham for a Dirham \n(is permissible).\" I said to him, \"Ibn `Abbas does not say the same.\" Abu Sa`id replied, \"I asked Ibn \n`Abbas whether he had heard it from the Prophet (ﷺ) s or seen it in the Holy Book. Ibn `Abbas replied, \"I \ndo not claim that, and you know Allah's Messenger (ﷺ) better than I, but Usama informed me that the \nProphet had said, 'There is no Riba (in money exchange) except when it is not done from hand to hand \n(i.e. when there is delay in payment).' \"", "grade": "Sahih", "narratedBy": "Narrated Abu Salih Az-Zaiyat:", "reference": "https://sunnah.com/bukhari:2178", "inBookReference": "Book 34, Hadith 128"}, {"id": 129, "hadithNumber": "2180", "text": "Narrated Abu Al-Minhal: I asked Al-Bara' bin `Azib and Zaid bin Arqam about money exchanges. Each of them said, \"This is \nbetter than I,\" and both of them said, \"Allah's Messenger (ﷺ) forbade the selling of silver for gold on credit. \"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Minhal:", "reference": "https://sunnah.com/bukhari:2180", "inBookReference": "Book 34, Hadith 129"}, {"id": 130, "hadithNumber": "2182", "text": "Narrated `Abdur-Rahman bin Abu Bakra: that his father said, \"The Prophet (ﷺ) forbade the selling of gold for gold and silver for silver except if \nthey are equivalent in weight, and allowed us to sell gold for silver and vice versa as we wished.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdur-Rahman bin Abu Bakra:", "reference": "https://sunnah.com/bukhari:2182", "inBookReference": "Book 34, Hadith 130"}, {"id": 131, "hadithNumber": "2183", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"Do not sell fruits of dates until they become free from all the dangers of being \nspoilt or blighted; and do not sell fresh dates for dry dates.\" \nNarrated Salim and `Abdullah from Zaid bin Habit' \"Later on Allah's Messenger (ﷺ) permitted the selling of \nripe fruits on trees for fresh dates or dried dates in Bai'-al-'Araya, and did not allow it for any other \nkind of sale.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2183", "inBookReference": "Book 34, Hadith 131"}, {"id": 132, "hadithNumber": "2185", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) forbade Muzabana; and Muzabana means the selling of fresh dates (on the trees) for \ndried dates by measure and also the selling of fresh grapes for dried grapes by measure.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2185", "inBookReference": "Book 34, Hadith 132"}, {"id": 133, "hadithNumber": "2186", "text": "Narrated Abu Sa`id Al-Khudri: Allah's Messenger (ﷺ) forbade Muzabana and Muhaqala; and Muzabana means the selling of ripe dates for \ndates still on the trees.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:2186", "inBookReference": "Book 34, Hadith 133"}, {"id": 134, "hadithNumber": "2187", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) forbade Muzabana and Muhaqala.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2187", "inBookReference": "Book 34, Hadith 134"}, {"id": 135, "hadithNumber": "2188", "text": "Narrated Zaid bin Thabit: Allah's Messenger (ﷺ) al lowed the owner of 'Araya to sell the fruits on the trees by means of estimation.", "grade": "Sahih", "narratedBy": "Narrated Zaid bin Thabit:", "reference": "https://sunnah.com/bukhari:2188", "inBookReference": "Book 34, Hadith 135"}, {"id": 136, "hadithNumber": "2189", "text": "Narrated Jabir: The Prophet (ﷺ) forbade the selling of fruits unless they get ripe, and none of them should be sold except \nfor Dinar or Dirham (i.e. money), except the 'Araya trees (the dates of which could be sold for dates).", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2189", "inBookReference": "Book 34, Hadith 136"}, {"id": 137, "hadithNumber": "2190", "text": "Narrated Abu Huraira: The Prophet (ﷺ) allowed the sale of the dates of 'Araya provided they were about five Awsuq (singular: \nWasaq which means sixty Sa's) or less (in amount).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2190", "inBookReference": "Book 34, Hadith 137"}, {"id": 138, "hadithNumber": "2191", "text": "Narrated Sahl bin Abu Hathma: Allah's Messenger (ﷺ) forbade the selling of fruits (fresh dates) for dried dates but allowed the sale of fruits \non the 'Araya by estimation and their new owners might eat their dates fresh. Sufyan (in another \nnarration) said, \"I told Yahya (a sub-narrator) when I was a mere boy, 'Meccans say that the Prophet (ﷺ) \nallowed them the sale of the fruits on 'Araya by estimation.' Yahya asked, 'How do the Meccans know \nabout it?' I replied, 'They narrated it (from the Prophet (ﷺ) ) through Jabir.' On that, Yahya kept quiet.\" \nSufyan said, \"I meant that Jabir belonged to Medina.\" Sufyan was asked whether in Jabir's narration \nthere was any prohibition of selling fruits before their benefit is evident (i.e. no dangers of being spoilt \nor blighted). He replied that there was none.", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Abu Hathma:", "reference": "https://sunnah.com/bukhari:2191", "inBookReference": "Book 34, Hadith 138"}, {"id": 139, "hadithNumber": "2192", "text": "Narrated Ibn `Umar from Zaid bin Thabit: Allah's Messenger (ﷺ) allowed the sale of 'Araya by estimating the dates on them for measured amounts of \ndried dates. Musa bin `Uqba said, \"Al- 'Araya were distinguished date palms; one could come and buy \nthem (i.e. their fruits).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar from Zaid bin Thabit:", "reference": "https://sunnah.com/bukhari:2192", "inBookReference": "Book 34, Hadith 139"}, {"id": 140, "hadithNumber": "2193", "text": "Zaid bin Thabit (ra) said, \"In the lifetime of Allah's Messenger (ﷺ), the people used to trade with fruits. When they cut their date-fruits and the purchasers came to recieve their rights, the seller would say, 'My dates have got rotten, they are blighted with disease, they are afflicted with Qusham (a disease which causes the fruit to fall before ripening).' They would go on complaining of defects in their purchases. Allah's Messenger (ﷺ) said, \"Do not sell the fruits before their benefit is evident (i.e. free from all the dangers of being spoiled or blighted), by way of advice for they quarrelled too much.\" Kharija bin Zaid bin Thabit said that Zaid bin Thabit (ra) used not to sell the fruits of his land till Pleiades appeared and one could distinguish the yellow fruits from the red (ripe) ones.", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:2193", "inBookReference": "Book 34, Hadith 140"}, {"id": 141, "hadithNumber": "2194", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) forbade the sale of fruits till their benefit is evident. He forbade both the seller and the \nbuyer (such sale).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2194", "inBookReference": "Book 34, Hadith 141"}, {"id": 142, "hadithNumber": "2195", "text": "Narrated Anas: Allah's Messenger (ﷺ) forbade the sale of date fruits till they were ripe. Abu `Abdullah (Al-Bukhari) said, \n\"That means till they were red (can be eaten).", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2195", "inBookReference": "Book 34, Hadith 142"}, {"id": 143, "hadithNumber": "2196", "text": "Narrated Jabir bin `Abdullah: The Prophet (ﷺ) forbade the s of (date) fruits till they were red or yellow and fit for eating.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2196", "inBookReference": "Book 34, Hadith 143"}, {"id": 144, "hadithNumber": "2197", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) forbade the sale of fruits till their benefit is evident; and the sale of date palms till the \ndates are almost ripe. He was asked what 'are almost ripe' meant. He replied, \"Got red and yellow.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2197", "inBookReference": "Book 34, Hadith 144"}, {"id": 145, "hadithNumber": "2198", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) forbade the sale of fruits till they are almost ripe. He was asked what is meant by 'are almost ripe.' He replied, \"Till they become red.\" Allah's Messenger (ﷺ) further said, \"If Allah spoiled the fruits, what right would one have to take the money of one's brother (i.e. other people)?\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2198", "inBookReference": "Book 34, Hadith 145"}, {"id": 146, "hadithNumber": "2199", "text": "Narrated Ibn Shihab: If somebody bought fruits before their benefit \n     is evident and then the fruits were spoiled with blights, the loss \n     would be suffered by the owner (not the buyer). Narrated Salim bin 'Abdullah from Ibn Umar:  Allah's Messenger (ﷺ) said, \"Do\n     not sell or buy fruits before their benefit was evident and do not \n     sell fresh fruits (dates) for dried dates.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Shihab:", "reference": "https://sunnah.com/bukhari:2199", "inBookReference": "Book 34, Hadith 146"}, {"id": 147, "hadithNumber": "2200", "text": "Narrated `Aisha: The Prophet (ﷺ) bought some foodstuff from a Jew on credit and mortgaged his armor to him.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2200", "inBookReference": "Book 34, Hadith 147"}, {"id": 148, "hadithNumber": "2201", "text": "Narrated Abu Sa`id Al-Khudri and Abu Huraira: Allah's Messenger (ﷺ) appointed somebody as a governor of Khaibar. That governor brought to him an \nexcellent kind of dates (from Khaibar). The Prophet (ﷺ) asked, \"Are all the dates of Khaibar like this?\" He \nreplied, \"By Allah, no, O Allah's Messenger (ﷺ)! But we barter one Sa of this (type of dates) for two Sas of \ndates of ours and two Sas of it for three of ours.\" Allah's Messenger (ﷺ) said, \"Do not do so (as that is a kind \nof usury) but sell the mixed dates (of inferior quality) for money, and then buy good dates with that \nmoney.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri and Abu Huraira:", "reference": "https://sunnah.com/bukhari:2201", "inBookReference": "Book 34, Hadith 148"}, {"id": 149, "hadithNumber": "2203", "text": "Narrated Nafi', the freed slave of Ibn 'Umar: If pollinated date-palms are sold and nothing is mentioned (in the contract) about their fruits, the fruits will go to the person who has pollinated them, and so will be the case with the slave and the cultivator. Nafi' mentioned those three things.", "grade": "Sahih", "narratedBy": "Narrated Nafi', the freed slave of Ibn 'Umar:", "reference": "https://sunnah.com/bukhari:2203", "inBookReference": "Book 34, Hadith 149"}, {"id": 150, "hadithNumber": "2204", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"If somebody sells pollinated date palms, the fruits will be for the seller unless \nthe buyer stipulates that they will be for himself (and the seller agrees).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2204", "inBookReference": "Book 34, Hadith 150"}, {"id": 151, "hadithNumber": "2205", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) forbade Al-Muzabana, i.e. to sell ungathered dates of one's garden for measured dried \ndates or fresh ungathered grapes for measured dried grapes; or standing crops for measured quantity \nof foodstuff. He forbade all such bargains.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2205", "inBookReference": "Book 34, Hadith 151"}, {"id": 152, "hadithNumber": "2206", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"Whoever pollinates date palms and then sells them, the fruits will belong to him \nunless the buyer stipulates that the fruits should belong to him (and the seller agrees).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2206", "inBookReference": "Book 34, Hadith 152"}, {"id": 153, "hadithNumber": "2207", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) forbade Muhaqala, Mukhadara, Mulamasa, Munabadha and Muzabana. (See glossary \nand previous Hadiths for the meanings of these terms.)", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2207", "inBookReference": "Book 34, Hadith 153"}, {"id": 154, "hadithNumber": "2208", "text": "Narrated Humaid: Anas said, \"The Prophet (ﷺ) forbade the selling of dates till they were almost ripe.\" We asked Anas, \n\"What does 'almost ripe' mean?\" He replied, \"They get red and yellow. The Prophet (ﷺ) added, 'If Allah \ndestroyed the fruits present on the trees, what right would the seller have to take the money of his \nbrother (somebody else)?' \"", "grade": "Sahih", "narratedBy": "Narrated Humaid:", "reference": "https://sunnah.com/bukhari:2208", "inBookReference": "Book 34, Hadith 154"}, {"id": 155, "hadithNumber": "2209", "text": "Narrated Ibn `Umar: I was with the Prophet (ﷺ) while he was eating fresh dates. He said, \"From the trees there is a tree which \nresembles a faithful believer.\" I wanted to say that it was the date palm, but I was the youngest among \nthem (so I kept quiet). He added, \"It is the date palm.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2209", "inBookReference": "Book 34, Hadith 155"}, {"id": 156, "hadithNumber": "2210", "text": "Narrated Anas bin Malik: Abu Taiba cupped Allah's Messenger (ﷺ) and so Allah's Messenger (ﷺ) ordered that a Sa of dates be paid to him and \nordered his masters (for he was a slave) to reduce his tax.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2210", "inBookReference": "Book 34, Hadith 156"}, {"id": 157, "hadithNumber": "2211", "text": "Narrated `Aisha: Hind, the mother of Mu'awiya said to Allah's Messenger (ﷺ), \"Abu Sufyan (her husband) is a miser. Am I \nallowed to take from his money secretly?\" The Prophet (ﷺ) said to her, \"You and your sons may take what \nis sufficient reasonably and fairly.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2211", "inBookReference": "Book 34, Hadith 157"}, {"id": 158, "hadithNumber": "2212", "text": "Narrated Hisham bin `Urwa from his father: who heard Aisha saying, \"The Holy Verse; 'Whoever amongst the guardians is rich, he should take no \nwages (from the property of the orphans) but If he is poor, let him have for himself what is just and \nreasonable (according to his labors)' (4.6) was revealed concerning the guardian of the orphans who \nlooks after them and manages favorably their financial affairs; If the guardian Is poor, he could have \nfrom It what Is just and reasonable, (according to his labors).", "grade": "Sahih", "narratedBy": "Narrated Hisham bin `Urwa from his father:", "reference": "https://sunnah.com/bukhari:2212", "inBookReference": "Book 34, Hadith 158"}, {"id": 159, "hadithNumber": "2213", "text": "Narrated Jabir: Allah's Messenger (ﷺ) gave preemption (to the partner) in every joint property, but if the boundaries of the \nproperty were demarcated or the ways and streets were fixed, then there was no pre-emption.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2213", "inBookReference": "Book 34, Hadith 159"}, {"id": 160, "hadithNumber": "2214", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) decided the validity of preemption in every joint undivided property, but if the \nboundaries were well marked or the ways and streets were fixed, then there was no pre-emption.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2214", "inBookReference": "Book 34, Hadith 160"}, {"id": 161, "hadithNumber": "161", "text": "Narrated Mussaddad from `Abdul Wahid: the same as above but said, \"... in every joint undivided thing...\" Narrated Hisham from Ma`mar the \nsame as above but said, \" ... in every property... \"", "grade": "Sahih", "narratedBy": "Narrated Mussaddad from `Abdul Wahid:", "reference": "https://sunnah.com/bukhari:2214b", "inBookReference": "Book 34, Hadith 161"}, {"id": 162, "hadithNumber": "2215", "text": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"While three persons were walking, rain began to fall and they had to enter a cave in \na mountain. A big rock rolled over and blocked the mouth of the cave. They said to each other, \n'Invoke Allah with the best deed you have performed (so Allah might remove the rock)'. One of them \nsaid, 'O Allah! My parents were old and I used to go out for grazing (my animals). On my return I \nwould milk (the animals) and take the milk in a vessel to my parents to drink. After they had drunk \nfrom it, I would give it to my children, family and wife. One day I was delayed and on my return I \nfound my parents sleeping, and I disliked to wake them up. The children were crying at my feet \n(because of hunger). That state of affairs continued till it was dawn. O Allah! If You regard that I did \nit for Your sake, then please remove this rock so that we may see the sky.' So, the rock was moved a \nbit. \nThe second said, 'O Allah! You know that I was in love with a cousin of mine, like the deepest love a \nman may have for a woman, and she told me that I would not get my desire fulfilled unless I paid her \none-hundred Dinars (gold pieces). So, I struggled for it till I gathered the desired amount, and when I \nsat in between her legs, she told me to be afraid of Allah, and asked me not to deflower her except \nrightfully (by marriage). So, I got up and left her. O Allah! If You regard that I did if for Your sake, \nkindly remove this rock.' So, two-thirds of the rock was removed. Then the third man said, 'O Allah! \nNo doubt You know that once I employed a worker for one Faraq (three Sa's) of millet, and when I \nwanted to pay him, he refused to take it, so I sowed it and from its yield I bought cows and a \nshepherd. After a time that man came and demanded his money. I said to him: Go to those cows and \nthe shepherd and take them for they are for you. He asked me whether I was joking with him. I told \nhim that I was not joking with him, and all that belonged to him. O Allah! If You regard that I did it \nsincerely for Your sake, then please remove the rock.' So, the rock was removed completely from the \nmouth of the cave.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2215", "inBookReference": "Book 34, Hadith 162"}, {"id": 163, "hadithNumber": "2216", "text": "Narrated `Abdur-Rahman bin Abu Bakr: We were with the Prophet (ﷺ) when a tall pagan with long matted unkempt hair came driving his sheep. \nThe Prophet (ﷺ) asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" \nThe Prophet (ﷺ) bought one sheep from him.", "grade": "Sahih", "narratedBy": "Narrated `Abdur-Rahman bin Abu Bakr:", "reference": "https://sunnah.com/bukhari:2216", "inBookReference": "Book 34, Hadith 163"}, {"id": 164, "hadithNumber": "2217", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"The Prophet (ﷺ) Abraham emigrated with Sarah and entered a village where there was \na king or a tyrant. (The king) was told that Abraham had entered (the village) accompanied by a \nwoman who was one of the most charming women. So, the king sent for Abraham and asked, 'O \nAbraham! Who is this lady accompanying you?' Abraham replied, 'She is my sister (i.e. in religion).' \nThen Abraham returned to her and said, 'Do not contradict my statement, for I have informed them \nthat you are my sister. By Allah, there are no true believers on this land except you and 1.' Then \nAbraham sent her to the king. When the king got to her, she got up and performed ablution, prayed \nand said, 'O Allah! If I have believed in You and Your Apostle, and have saved my private parts from \neverybody except my husband, then please do not let this pagan overpower me.' On that the king fell \nin a mood of agitation and started moving his legs. Seeing the condition of the king, Sarah said, 'O \nAllah! If he should die, the people will say that I have killed him.' The king regained his power, and \nproceeded towards her but she got up again and performed ablution, prayed and said, 'O Allah! If I \nhave believed in You and Your Apostle and have kept my private parts safe from all except my \nhusband, then please do not let this pagan overpower me.' The king again fell in a mood of agitation \nand started moving his legs. On seeing that state of the king, Sarah said, 'O Allah! If he should die, the \npeople will say that I have killed him.' The king got either two or three attacks, and after recovering \nfrom the last attack he said, 'By Allah! You have sent a satan to me. Take her to Abraham and give her \nAjar.' So she came back to Abraham and said, 'Allah humiliated the pagan and gave us a slave-girl for \nservice.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2217", "inBookReference": "Book 34, Hadith 164"}, {"id": 165, "hadithNumber": "2218", "text": "Narrated `Aisha: Sa`d bin Abi Waqqas and 'Abu bin Zam`a quarreled over a boy. Sa`d said, \"O Allah's Messenger (ﷺ)! This \nboy is the son of my brother (`Utba bin Abi Waqqas) who took a promise from me that I would take \nhim as he was his (illegal) son. Look at him and see whom he resembles.\" 'Abu bin Zam`a said, \"O \nAllah's Messenger (ﷺ)! This is my brother and was born on my father's bed from his slave-girl.\" Allah's \nApostle cast a look at the boy and found definite resemblance to `Utba and then said, \"The boy is for \nyou, O 'Abu bin Zam`a. The child goes to the owner of the bed and the adulterer gets nothing but the \nstones (despair, i.e. to be stoned to death). Then the Prophet (ﷺ) said, \"O Sauda bint Zama! Screen \nyourself from this boy.\" So, Sauda never saw him again.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2218", "inBookReference": "Book 34, Hadith 165"}, {"id": 166, "hadithNumber": "2219", "text": "Narrated Sa`d that his father said: `Abdur-Rahman bin `Auf said to Suhaib, 'Fear Allah and do not ascribe yourself to somebody other \nthan your father.' Suhaib replied, 'I would not like to say it even if I were given large amounts of \nmoney, but I say I was kidnapped in my childhood.' \"", "grade": "Sahih", "narratedBy": "Narrated Sa`d that his father said:", "reference": "https://sunnah.com/bukhari:2219", "inBookReference": "Book 34, Hadith 166"}, {"id": 167, "hadithNumber": "2220", "text": "Narrated `Urwa bin Az-Zubair: Hakim bin Hizam said, \"O Allah's Messenger (ﷺ)! I used to do good deeds in the Pre-Islamic period of \nIgnorance, e.g., keeping good relations with my Kith and kin, manumitting slaves and giving alms. \nShall I receive a reward for all that?\" Allah's Messenger (ﷺ) replied, \"You embraced Islam with all the good \ndeeds which you did in the past.\"", "grade": "Sahih", "narratedBy": "Narrated `Urwa bin Az-Zubair:", "reference": "https://sunnah.com/bukhari:2220", "inBookReference": "Book 34, Hadith 167"}, {"id": 168, "hadithNumber": "2221", "text": "Narrated `Abdullah bin `Abbas: Once Allah's Messenger (ﷺ) passed by a dead sheep and said to the people, \"Wouldn't you benefit by its \nskin?\" The people replied that it was dead. The Prophet (ﷺ) said, \"But its eating only is illegal.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:2221", "inBookReference": "Book 34, Hadith 168"}, {"id": 169, "hadithNumber": "2222", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is, son of Mary (Jesus) will shortly descend \namongst you people (Muslims) as a just ruler and will break the Cross and kill the pig and abolish the \nJizya (a tax taken from the non-Muslims, who are in the protection, of the Muslim government). Then \nthere will be abundance of money and nobody will accept charitable gifts.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2222", "inBookReference": "Book 34, Hadith 169"}, {"id": 170, "hadithNumber": "2223", "text": "Narrated Ibn `Abbas: Once `Umar was informed that a certain man sold alcohol. `Umar said, \"May Allah curse him! \nDoesn't he know that Allah's Messenger (ﷺ) said, 'May Allah curse the Jews, for Allah had forbidden them to \neat the fat of animals but they melted it and sold it.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2223", "inBookReference": "Book 34, Hadith 170"}, {"id": 171, "hadithNumber": "2224", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"May Allah curse the Jews, because Allah made fat illegal for them but they sold \nit and ate its price. \"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2224", "inBookReference": "Book 34, Hadith 171"}, {"id": 172, "hadithNumber": "2225", "text": "Narrated Sa`id bin Abu Al-Hasan: While I was with Ibn `Abbas a man came and said, \"O father of `Abbas! My sustenance is from my \nmanual profession and I make these pictures.\" Ibn `Abbas said, \"I will tell you only what I heard from \nAllah's Messenger (ﷺ) . I heard him saying, 'Whoever makes a picture will be punished by Allah till he puts \nlife in it, and he will never be able to put life in it.' \" Hearing this, that man heaved a sigh and his face \nturned pale. Ibn `Abbas said to him, \"What a pity! If you insist on making pictures I advise you to \nmake pictures of trees and any other unanimated objects.\"", "grade": "Sahih", "narratedBy": "Narrated Sa`id bin Abu Al-Hasan:", "reference": "https://sunnah.com/bukhari:2225", "inBookReference": "Book 34, Hadith 172"}, {"id": 173, "hadithNumber": "2226", "text": "Narrated `Aisha: When the last verses of Surat-al-Baqara were revealed, the Prophet (ﷺ) went out (of his house to the \nMosque) and said, \"The trade of alcohol has become illegal.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2226", "inBookReference": "Book 34, Hadith 173"}, {"id": 174, "hadithNumber": "2227", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Allah says, 'I will be against three persons on the Day of Resurrection: \n-1. One who makes a covenant in My Name, but he proves treacherous. \n-2. One who sells a free person (as a slave) and eats the price, \n-3. And one who employs a laborer and gets the full work done by him but does not pay him his \nwages.' \"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2227", "inBookReference": "Book 34, Hadith 174"}, {"id": 175, "hadithNumber": "2228", "text": "Narrated Anas: Amongst the captives was Safiya. First she was given to Dihya Al-Kalbi and then to the Prophet.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2228", "inBookReference": "Book 34, Hadith 175"}, {"id": 176, "hadithNumber": "2229", "text": "Narrated Abu Sa`id Al-Khudri: that while he was sitting with Allah's Messenger (ﷺ) he said, \"O Allah's Messenger (ﷺ)! We get female captives as \nour share of booty, and we are interested in their prices, what is your opinion about coitus interrupt \nus?\" The Prophet (ﷺ) said, \"Do you really do that? It is better for you not to do it. No soul that which \nAllah has destined to exist, but will surely come into existence.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:2229", "inBookReference": "Book 34, Hadith 176"}, {"id": 177, "hadithNumber": "2230", "text": "Narrated Jabir: The Prophet (ﷺ) sold a Mudabbar (on behalf of his master who was still living and in need of money).", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2230", "inBookReference": "Book 34, Hadith 177"}, {"id": 178, "hadithNumber": "2231", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) sold a Mudabbar.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2231", "inBookReference": "Book 34, Hadith 178"}, {"id": 179, "hadithNumber": "2232", "text": "Narrated Zaid bin Khalid and Abu Huraira: that Allah's Messenger (ﷺ) was asked about an unmarried slave-girl who committed illegal sexual \nintercourse. They heard him saying, \"Flog her, and if she commits illegal sexual intercourse after that, \nflog her again, and on the third (or the fourth) offense, sell her.\"", "grade": "Sahih", "narratedBy": "Narrated Zaid bin Khalid and Abu Huraira:", "reference": "https://sunnah.com/bukhari:2232", "inBookReference": "Book 34, Hadith 179"}, {"id": 180, "hadithNumber": "2234", "text": "Narrated Abu Huraira: I heard the Prophet (ﷺ) saying, \"If a slave-girl of yours commits illegal sexual intercourse and her illegal \nsexual intercourse is proved, she should be lashed, and after that nobody should blame her, and if she \ncommits illegal sexual intercourse the second time, she should be lashed and nobody should blame her \nafter that, and if she does the offense for the third time and her illegal sexual intercourse is proved, she \nshould be sold even for a hair rope.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2234", "inBookReference": "Book 34, Hadith 180"}, {"id": 181, "hadithNumber": "2235", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) came to Khaibar and when Allah made him victorious and he conquered the town by \nbreaking the enemy's defense, the beauty of Safiya bint Huyai bin Akhtab was mentioned to him and \nher husband had been killed while she was a bride. Allah's Messenger (ﷺ) selected her for himself and he set \nout in her company till he reached Sadd-ar-Rawha' where her menses were over and he married her. \nThen Hais (a kind of meal) was prepared and served on a small leather sheet (used for serving meals). \nAllah's Messenger (ﷺ) then said to me, \"Inform those who are around you (about the wedding banquet).\" So \nthat was the marriage banquet given by Allah's Messenger (ﷺ) for (his marriage with) Safiya. After that we \nproceeded to Medina and I saw that Allah's Messenger (ﷺ) was covering her with a cloak while she was \nbehind him. Then he would sit beside his camel and let Safiya put her feet on his knees to ride (the \ncamel).", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:2235", "inBookReference": "Book 34, Hadith 181"}, {"id": 182, "hadithNumber": "2236", "text": "Narrated Jabir bin `Abdullah: I heard Allah's Messenger (ﷺ), in the year of the Conquest of Mecca, saying, \"Allah and His Apostle made \nillegal the trade of alcohol, dead animals, pigs and idols.\" The people asked, \"O Allah's Messenger (ﷺ)! What \nabout the fat of dead animals, for it was used for greasing the boats and the hides; and people use it for \nlights?\" He said, \"No, it is illegal.\" Allah's Messenger (ﷺ) further said, \"May Allah curse the Jews, for Allah \nmade the fat (of animals) illegal for them, yet they melted the fat and sold it and ate its price.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2236", "inBookReference": "Book 34, Hadith 182"}, {"id": 183, "hadithNumber": "2237", "text": "Narrated Abu Mas`ud Al-Ansari: Allah's Messenger (ﷺ) forbade taking the price of a dog, money earned by prostitution and the earnings of a \nsoothsayer.", "grade": "Sahih", "narratedBy": "Narrated Abu Mas`ud Al-Ansari:", "reference": "https://sunnah.com/bukhari:2237", "inBookReference": "Book 34, Hadith 183"}, {"id": 184, "hadithNumber": "2238", "text": "Narrated `Aun bin Abu Juhaifa: I saw my father buying a slave whose profession was cupping, and ordered that his instruments (of \ncupping) be broken. I asked him the reason for doing so. He replied, \"Allah's Messenger (ﷺ) prohibited \ntaking money for blood, the price of a dog, and the earnings of a slave-girl by prostitution; he cursed \nher who tattoos and her who gets tattooed, the eater of Riba (usury), and the maker of pictures.\"", "grade": "Sahih", "narratedBy": "Narrated `Aun bin Abu Juhaifa:", "reference": "https://sunnah.com/bukhari:2238", "inBookReference": "Book 34, Hadith 184"}]}