{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 35, "bookName": "Chapter: As-Salam by a definite known specified measure", "hadiths": [{"id": 1, "hadithNumber": "2239", "text": "Narrated Ibn `Abbas: Allah's Messenger (ﷺ) came to Medina and the people used to pay in advance the price of fruits to be \ndelivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or \ntwo to three years.) The Prophet (ﷺ) said, \"Whoever pays money in advance for dates (to be delivered \nlater) should pay it for known specified weight and measure (of the dates).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2239", "inBookReference": "Book 35, Hadith 1"}, {"id": 2, "hadithNumber": "2", "text": "Narrated Ibn Abi Najih: as above, mentioning only specific measure.", "grade": "Sahih", "narratedBy": "Narrated Ibn Abi Najih:", "reference": "https://sunnah.com/bukhari:2239b", "inBookReference": "Book 35, Hadith 2"}, {"id": 3, "hadithNumber": "2240", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) came to Medina and the people used to pay in advance the price of dates to be delivered \nwithin two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be \ndelivered later should pay it for a specified measure at specified weight for a specified period.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2240", "inBookReference": "Book 35, Hadith 3"}, {"id": 4, "hadithNumber": "4", "text": "Narrated Ibn Abi Najih: as above, saying, \"He should pay the price in advance for a specified measure and for a specified \nperiod.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Abi Najih:", "reference": "https://sunnah.com/bukhari:2240b", "inBookReference": "Book 35, Hadith 4"}, {"id": 5, "hadithNumber": "2241", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) came (to Medina) and he told the people (regarding the payment of money in advance \nthat they should pay it) for a known specified measure and a known specified weight and a known \nspecified period.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2241", "inBookReference": "Book 35, Hadith 5"}, {"id": 6, "hadithNumber": "2242", "text": "Narrated Shu`ba: Muhammad or `Abdullah bin Abu Al-Mujalid said, \"Abdullah bin Shaddad and Abu Burda differed \nregarding As-Salam, so they sent me to Ibn Abi `Aufa and I asked him about it. He replied, 'In the \nlifetime of Allah's Messenger (ﷺ), Abu Bakr and `Umar, we used to pay in advance the prices of wheat, \nbarley, dried grapes and dates to be delivered later. I also asked Ibn Abza and he, too, replied as \nabove.' \"", "grade": "Sahih", "narratedBy": "Narrated Shu`ba:", "reference": "https://sunnah.com/bukhari:2242", "inBookReference": "Book 35, Hadith 6"}, {"id": 7, "hadithNumber": "2244", "text": "Narrated Muhammad bin Al-Mujalid: `Abdullah bin Shaddad and Abu Burda sent me to `Abdullah bin Abi `Aufa and told me to ask \n`Abdullah whether the people in the lifetime of the Prophet (ﷺ) used to pay in advance for wheat (to be \ndelivered later). `Abdullah replied, \"We used to pay in advance to the peasants of Sham for wheat, \nbarley and olive oil of a known specified measure to be delivered in a specified period.\" I asked (him), \n\"Was the price paid (in advance) to those who had the things to be delivered later?\" `Abdullah bin \n`Aufa replied, \"We did not use to ask them about that.\" Then they sent me to `Abdur Rahman bin \nAbza and I asked him. He replied, \"The companions of the Prophet (ﷺ) used to practice Salam in the \nlifetime of the Prophet; and we did not use to ask them whether they had standing crops or not.\"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin Al-Mujalid:", "reference": "https://sunnah.com/bukhari:2244", "inBookReference": "Book 35, Hadith 7"}, {"id": 8, "hadithNumber": "2245", "text": "Narrated Muhammad bin Abi Al-Mujalid: as above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). \nNarrated Ash-Shaibani--\"And also for oil.\" Narrated Ash-Shaibani: who said \"We used to pay in advance for wheat barley and dried grapes.\"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin Abi Al-Mujalid:", "reference": "https://sunnah.com/bukhari:2245", "inBookReference": "Book 35, Hadith 8"}, {"id": 9, "hadithNumber": "2246", "text": "Narrated Abu Bakhtari at-Tai: I asked Ibn `Abbas about Salam for (the fruits of) date-palms. He replied \"The Prophet (ﷺ) forbade the \nsale a dates on the trees till they became fit for eating and could be weighed.\" A man asked what to be \nweighed (as the dates were still on the trees). Another man sitting beside Ibn `Abbas replied, \"Till they \nare cut and stored.\" Narrated Abu Al-Bakhtari: I heard Ibn `Abbas (saying) that the Prophet (ﷺ) forbade ... \netc. as above.", "grade": "Sahih", "narratedBy": "Narrated Abu Bakhtari at-Tai:", "reference": "https://sunnah.com/bukhari:2246", "inBookReference": "Book 35, Hadith 9"}, {"id": 10, "hadithNumber": "2247", "text": "Narrated Abu Al-Bakhtari: I asked Ibn `Umar about Salam (the fruits of) date-palms. He replied, \"The Prophet (ﷺ) forbade the sale of \ndates till their benefit becomes evident and fit for eating and also the sale of silver (for gold) on \ncredit.\" I asked Ibn `Abbas about Salam for dates and he replied, \"The Prophet (ﷺ) forbade the sale of \ndates till they were fit for eating and could be estimated.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Bakhtari:", "reference": "https://sunnah.com/bukhari:2247", "inBookReference": "Book 35, Hadith 10"}, {"id": 11, "hadithNumber": "2249", "text": "Narrated Abu Al-Bakhtari: I asked Ibn `Umar about Salam for dates. Ibn `Umar replied, \"The Prophet (ﷺ) forbade the sale (the fruits) \nof date-palms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also \nasked Ibn `Abbas about it. Ibn `Abbas replied, \"The Prophet (ﷺ) forbade the sale of dates till they were fit \nfor eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the \ntrees)?\" A man sitting by Ibn `Abbas said, \"It means till they are cut and stored.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Bakhtari:", "reference": "https://sunnah.com/bukhari:2249", "inBookReference": "Book 35, Hadith 11"}, {"id": 12, "hadithNumber": "2251", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) bought some foodstuff (barley) from a Jew on credit and mortgaged his iron armor to \nhim (the armor stands for a guarantor).", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2251", "inBookReference": "Book 35, Hadith 12"}, {"id": 13, "hadithNumber": "2252", "text": "Narrated Al-A`mash: We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet (ﷺ) \nbought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and \nhe mortgaged his iron armor to him.\"", "grade": "Sahih", "narratedBy": "Narrated Al-A`mash:", "reference": "https://sunnah.com/bukhari:2252", "inBookReference": "Book 35, Hadith 13"}, {"id": 14, "hadithNumber": "2253", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) came to Medina and the people used to pay in advance the prices of fruits to be delivered \nwithin two to three years. The Prophet (ﷺ) said (to them), \"Buy fruits by paying their prices in advance on \ncondition that the fruits are to be delivered to you according to a fixed specified measure within a \nfixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2253", "inBookReference": "Book 35, Hadith 14"}, {"id": 15, "hadithNumber": "2254", "text": "Narrated Muhammad bin Abi Al-Mujalid: Abu Burda and `Abdullah bin Shaddad sent me to `Abdur Rahman bin Abza and `Abdullah bin Abi \n`Aufa to ask them about the Salaf (Salam). They said, \"We used to get war booty while we were with \nAllah's Messenger (ﷺ) and when the peasants of Sham came to us we used to pay them in advance for wheat, \nbarley, and oil to be delivered within a fixed period.\" I asked them, \"Did the peasants own standing \ncrops or not?\" They replied, \"We never asked them about it.\"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin Abi Al-Mujalid:", "reference": "https://sunnah.com/bukhari:2254", "inBookReference": "Book 35, Hadith 15"}, {"id": 16, "hadithNumber": "2256", "text": "Narrated `Abdullah: The people used to sell camels on the basis of Habal-al-Habala. The Prophet (ﷺ) forbade such sale. Nafi` \nexplained Habal-al-Habala by saying. \"The camel is to be delivered to the buyer after the she-camel \ngives birth.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2256", "inBookReference": "Book 35, Hadith 16"}]}