{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 38, "bookName": "Chapter: Al-Hawala (the transference of a debt from one person to another. It is an agreement whereby a debtor is released from a debt by another becoming responsible for it). Can Hawala be rejected by the creditors after accepting it?", "hadiths": [{"id": 1, "hadithNumber": "2287", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy man is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2287", "inBookReference": "Book 38, Hadith 1"}, {"id": 2, "hadithNumber": "2288", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy person is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2288", "inBookReference": "Book 38, Hadith 2"}, {"id": 3, "hadithNumber": "2289", "text": "Narrated Salama bin Al-Akwa: Once, while we were sitting in the company of Prophet, a dead man was \n     brought. The Prophet (ﷺ) was requested to lead the funeral prayer for the \n     deceased. He said, \"Is he in debt?\" The people replied in the \n     negative. He said, \"Has he left any wealth?\" They said, \"No.\" So, he \n     led his funeral prayer. Another dead man was brought and the people \n     said, \"O Allah's Messenger (ﷺ)! Lead his funeral prayer.\" The Prophet (ﷺ) said, \n     \"Is he in debt?\" They said, \"Yes.\" He said, \"Has he left any wealth?\" \n     They said, ''Three Dinars.\" So, he led the prayer. Then a third dead \n     man was brought and the people said (to the Prophet (ﷺ) ), Please lead his\n     funeral prayer.\" He said, \"Has he left any wealth?\" They said, \"No.\" \n     He asked, \"Is he in debt?\" They said, (\"Yes! He has to pay) three \n     Diners.', He (refused to pray and) said, \"Then pray for your (dead) \n     companion.\" Abu Qatada said, \"O Allah's Messenger (ﷺ)! Lead his funeral \n     prayer, and I will pay his debt.\" So, he led the prayer.", "grade": "Sahih", "narratedBy": "Narrated Salama bin Al-Akwa:", "reference": "https://sunnah.com/bukhari:2289", "inBookReference": "Book 38, Hadith 3"}]}