{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 43, "bookName": "Chapter: Whoever buys a thing on credit", "hadiths": [{"id": 1, "hadithNumber": "2385", "text": "Narrated Jabir bin `Abdullah: While I was in the company of the Prophet (ﷺ) in one of his Ghazawat, he asked, \"What is wrong with \nyour camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, \nI took the camel to him in the morning and he paid me its price.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2385", "inBookReference": "Book 43, Hadith 1"}, {"id": 2, "hadithNumber": "2386", "text": "Narrated Al-A`mash: When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from \nAswad that `Aisha had said, \"The Prophet (ﷺ) bought some foodstuff on credit from a Jew and mortgaged \nan iron armor to him.\"", "grade": "Sahih", "narratedBy": "Narrated Al-A`mash:", "reference": "https://sunnah.com/bukhari:2386", "inBookReference": "Book 43, Hadith 2"}, {"id": 3, "hadithNumber": "2387", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Whoever takes the money of the people with the intention of repaying it, Allah will \nrepay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2387", "inBookReference": "Book 43, Hadith 3"}, {"id": 4, "hadithNumber": "2388", "text": "Narrated Abu Dhar: Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not \nlike to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains \nof it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar \nwhich I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have \nlittle reward in the Hereafter except those who spend their money here and there (in Allah's Cause), \nand they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a \nvoice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his \nreturn I said, \"O Allah's Messenger (ﷺ)! (What was) that noise which I heard?\" He said, \"Did you hear \nanything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers \ndies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such \nthings (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Dhar:", "reference": "https://sunnah.com/bukhari:2388", "inBookReference": "Book 43, Hadith 4"}, {"id": 5, "hadithNumber": "2389", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"If I had gold equal to the mountain of Uhud, it would not please me that it \nshould remain with me for more than three days, except an amount which I would keep for repaying \ndebts.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2389", "inBookReference": "Book 43, Hadith 5"}, {"id": 6, "hadithNumber": "2390", "text": "Narrated Abu Huraira: A man demanded his debts from Allah's Messenger (ﷺ) in such a rude manner that the companions of the \nProphet intended to harm him, but the Prophet (ﷺ) said, \"Leave him, no doubt, for he (the creditor) has the \nright to demand it (harshly). Buy a camel and give it to him.\" They said, \"The camel that is available \nis older than the camel he demands. \"The Prophet (ﷺ) said, \"Buy it and give it to him, for the best among \nyou are those who repay their debts handsomely. \"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2390", "inBookReference": "Book 43, Hadith 6"}, {"id": 7, "hadithNumber": "2391", "text": "Narrated Hudhaifa: I heard the Prophet (ﷺ) saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your \nlife time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and \n(used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I \nheard the same (Hadith) from the Prophet.\"", "grade": "Sahih", "narratedBy": "Narrated Hudhaifa:", "reference": "https://sunnah.com/bukhari:2391", "inBookReference": "Book 43, Hadith 7"}, {"id": 8, "hadithNumber": "2392", "text": "Narrated Abu Huraira: A man came to the Prophet (ﷺ) and demanded a camel (the Prophet (ﷺ) owed him). Allah's Messenger (ﷺ) told his \ncompanions to give him (a camel). They said, \"We do not find except an older camel (than what he \ndemands). (The Prophet (ﷺ) ordered them to give him that camel). The man said, \"You have paid me in \nfull and may Allah also pay you in full.\" Allah's Messenger (ﷺ) said, \"Give him, for the best amongst the \npeople is he who repays his debts in the most handsome manner.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2392", "inBookReference": "Book 43, Hadith 8"}, {"id": 9, "hadithNumber": "2393", "text": "Narrated Abu Huraira: The Prophet (ﷺ) owed a camel of a certain age to a man who came to demand it back. The Prophet (ﷺ) \nordered his companions to give him. They looked for a camel of the same age but found nothing but a \ncamel one year older. The Prophet (ﷺ) told them to give it to him. The man said, \"You have paid me in \nfull, and may Allah pay you in full.\" The Prophet (ﷺ) said, \"The best amongst you is he who pays his \ndebts in the most handsome manner.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2393", "inBookReference": "Book 43, Hadith 9"}, {"id": 10, "hadithNumber": "2394", "text": "Narrated Jabir bin `Abdullah: I went to the Prophet (ﷺ) while he was in the Mosque. (Mas`ar thinks, that Jabir went in the forenoon.) \nAfter the Prophet (ﷺ) told me to pray two rak`at, he repaid me the debt he owed me and gave me an extra \namount.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2394", "inBookReference": "Book 43, Hadith 10"}, {"id": 11, "hadithNumber": "2395", "text": "Narrated Jabir bin `Abdullah: My father was martyred on the day (of the battle) of Uhud, and he was in debt. His creditors \ndemanded their rights persistently. I went to the Prophet (and informed him about it). He told them to \ntake the fruits of my garden and exempt my father from the debts but they refused to do so. So, the \nProphet did not give them my garden and told me that he would come to me the next morning. He \ncame to us early in the morning and wandered among the date-palms and invoked Allah to bless their \nfruits. I then plucked the dates and paid the creditors, and there remained some of the dates for us.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2395", "inBookReference": "Book 43, Hadith 11"}, {"id": 12, "hadithNumber": "2396", "text": "Narrated Jabir bin `Abdullah: When my father died he owed a Jew thirty Awsuq (of dates). I requested him to give me respite for \nrepaying but he refused. I requested Allah's Messenger (ﷺ) to intercede with the Jew. Allah's Messenger (ﷺ) went to \nthe Jew and asked him to accept the fruits of my trees in place of the debt but the Jew refused. Allah's \nApostle entered the garden of the date-palms, wandering among the trees and ordered me (saying), \n\"Pluck (the fruits) and give him his due.\" So, I plucked the fruits for him after the departure of Allah's \nApostle and gave his thirty Awsuq, and still had seventeen Awsuq extra for myself. Jabir said: I went \nto Allah's Messenger (ﷺ) to inform of what had happened, but found him praying the `Asr prayer. After the \nprayer I told him about the extra fruits which remained. Allah's Messenger (ﷺ) told me to inform (`Umar) Ibn \nAl-Khattab about it. When I went to `Umar and told him about it, `Umar said, \"When Allah's Messenger (ﷺ) \nwalked in your garden, I was sure that Allah would definitely bless it.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2396", "inBookReference": "Book 43, Hadith 12"}, {"id": 13, "hadithNumber": "2397", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all \nsins, and from being in debt.\" Someone said, O Allah's Messenger (ﷺ)! (I see you) very often you seek refuge \nwith Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and \nbreaks his promises when he promises.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2397", "inBookReference": "Book 43, Hadith 13"}, {"id": 14, "hadithNumber": "2398", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"If someone leaves some property, it will be for the inheritors, and if he leaves some \nweak offspring, it will be for us to support them.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2398", "inBookReference": "Book 43, Hadith 14"}, {"id": 15, "hadithNumber": "2399", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"I am closer to the believers than their selves in this world and in the Hereafter, and \nif you like, you can read Allah's Statement: \"The Prophet (ﷺ) is closer to the believers than their own \nselves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors \n(from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they \nshould come to me as I am the guardian of the deceased.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2399", "inBookReference": "Book 43, Hadith 15"}, {"id": 16, "hadithNumber": "2400", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2400", "inBookReference": "Book 43, Hadith 16"}, {"id": 17, "hadithNumber": "2401", "text": "Narrated Abu Huraira: A man came to the Prophet (ﷺ) and demanded his debts and used harsh words. The companions of the \nProphet wanted to harm him, but the Prophet (ﷺ) said, \"Leave him, as the creditor (owner of the right) has \nthe right to speak.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2401", "inBookReference": "Book 43, Hadith 17"}, {"id": 18, "hadithNumber": "2402", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"If a man finds his very things with a bankrupt, he has more right to take them \nback than anyone else.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2402", "inBookReference": "Book 43, Hadith 18"}, {"id": 19, "hadithNumber": "2403", "text": "Narrated Jabir bin `Abdullah: A man pledged that his slave would be manumitted after his death. The Prophet (ﷺ) asked, \"Who will buy \nthe slave from me?\" Nu'aim bin `Abdullah bought the slave and the Prophet (ﷺ) took its price and gave it \nto the owner.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2403", "inBookReference": "Book 43, Hadith 19"}, {"id": 20, "hadithNumber": "2404", "text": "Narrated Abu Hurairah (ra): Allah's Messenger (ﷺ) mentioned an Israeli man who asked another Israeli to lend him money, and the latter gave it to him for a fixed period. (Abu Hurairah mentioned the rest of narration) [See  chapter: Kafala in loans and debts. Hadith 2291]", "grade": "Sahih", "narratedBy": "Narrated Abu Hurairah (ra):", "reference": "https://sunnah.com/bukhari:2404", "inBookReference": "Book 43, Hadith 20"}, {"id": 21, "hadithNumber": "2405", "text": "Narrated Jabir: When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down \nsome of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. \nThe Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and \n'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) \ncame and sat beside the dates and started measuring to each his due till he paid them fully, and the \namount of dates remained as it was before, as if he had not touched them. \n(On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of \nour camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He \nsaid, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took \nthe permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly \nmarried.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \n\"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, \nso I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then \nsaid (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of \nthe camel, he admonished me for it. On that I told him about its slowness and exhaustion and about \nwhat the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him \nwith the camel in the morning and he gave me its price, the camel itself, and my share from the war \nbooty as he gave the other people.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:2405", "inBookReference": "Book 43, Hadith 21"}, {"id": 22, "hadithNumber": "2407", "text": "Narrated Ibn `Umar: A man came to the Prophet (ﷺ) and said, \"I am often betrayed in bargaining.\" The Prophet (ﷺ) advised him, \n\"When you buy something, say (to the seller), 'No deception.\" The man used to say so afterwards.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2407", "inBookReference": "Book 43, Hadith 22"}, {"id": 23, "hadithNumber": "2408", "text": "Narrated Al-Mughira bin Shu`ba: The Prophet (ﷺ) said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your \ndaughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men \n(begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, \n(2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by \nextravagance).", "grade": "Sahih", "narratedBy": "Narrated Al-Mughira bin Shu`ba:", "reference": "https://sunnah.com/bukhari:2408", "inBookReference": "Book 43, Hadith 23"}, {"id": 24, "hadithNumber": "2409", "text": "Narrated `Abdullah bin `Umar: I heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian, and responsible for what is in his \ncustody. The ruler is a guardian of his subjects and responsible for them; a husband is a guardian of \nhis family and is responsible for it; a lady is a guardian of her husband's house and is responsible for \nit, and a servant is a guardian of his master's property and is responsible for it.\" I heard that from \nAllah's Messenger (ﷺ) and I think that the Prophet (ﷺ) also said, \"A man is a guardian of is father's property and \nis responsible for it, so all of you are guardians and responsible for your wards and things under your \ncare.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2409", "inBookReference": "Book 43, Hadith 24"}]}