{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 52, "bookName": "Chapter: What is said regarding the rule that the plaintiff has to produce a proof", "hadiths": [{"id": 1, "hadithNumber": "2637", "text": "Narrated `Urwa bin Al-Musaiyab Alqama bin Waqqas and Ubaidullah bin `Abdullah: About the story of `Aisha and their narrations were similar attesting each other, when the liars said \r\nwhat they invented about `Aisha, and the Divine Inspiration was delayed, Allah's Messenger (ﷺ) sent for `Ali \r\nand Usama to consult them in divorcing his wife (i.e. `Aisha). Usama said, \"Keep your wife, as we \r\nknow nothing about her except good.\" Barirah said, \"I cannot accuse her of any defect except that she \r\nis still a young girl who sleeps, neglecting her family's dough which the domestic goats come to eat \r\n(i.e. she was too simpleminded to deceive her husband).\" Allah's Messenger (ﷺ) said, \"Who can help me to \r\ntake revenge over the man who has harmed me by defaming the reputation of my family? By Allah, I \r\nhave not known about my family-anything except good, and they mentioned (i.e. accused) a man \r\nabout whom I did not know anything except good.\"", "grade": "Sahih", "narratedBy": "Narrated `Urwa bin Al-Musaiyab Alqama bin Waqqas and Ubaidullah bin `Abdullah:", "reference": "https://sunnah.com/bukhari:2637", "inBookReference": "Book 52, Hadith 1"}, {"id": 2, "hadithNumber": "2638", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) and Ubai bin Ka`b Al-Ansari went to the garden where Ibn Saiyad used to live. When \nAllah's Messenger (ﷺ) entered (the garden), he (i.e. Allah's Messenger (ﷺ) ) started hiding himself behind the date108 \npalms as he wanted to hear secretly the talk of Ibn Saiyad before the latter saw him. Ibn Saiyad \nwrapped with a soft decorated sheet was lying on his bed murmuring. Ibn Saiyad's mother saw the \nProphet hiding behind the stems of the date-palms. She addressed Ibn Saiyad saying, \"O Saf, this is \nMuhammad.\" Hearing that Ibn Saiyad stopped murmuring (or got cautious), the Prophet (ﷺ) said, \"If she \nhad left him undisturbed, he would have revealed his reality.\" (See Hadith No. 290, Vol 4 for details)", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2638", "inBookReference": "Book 52, Hadith 2"}, {"id": 3, "hadithNumber": "2639", "text": "Narrated Aisha: The wife of Rifa`a Al-Qurazi came to the Prophet (ﷺ) and said, \"I was Rifa`a's wife, but he divorced me \nand it was a final irrevocable divorce. Then I married `Abdur-Rahman bin Az-Zubair but he is \nimpotent.\" The Prophet (ﷺ) asked her 'Do you want to remarry Rifa`a? You cannot unless you had a \ncomplete sexual relation with your present husband.\" Abu Bakr was sitting with Allah's Messenger (ﷺ) and \nKhalid bin Sa`id bin Al-`As was at the door waiting to be admitted. He said, \"O Abu Bakr! Do you \nhear what this (woman) is revealing frankly before the Prophet (ﷺ) ?\"", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2639", "inBookReference": "Book 52, Hadith 3"}, {"id": 4, "hadithNumber": "2640", "text": "Narrated `Abdullah bin Abu Mulaika from `Uqba bin Al-Harith: `Uqba married the daughter of Abu Ihab bin `Aziz, and then a woman came and said, \"I suckled \n`Uqba and his wife.\" `Uqba said to her, \"I do not know that you have suckled me, and you did not \ninform me.\" He then sent someone to the house of Abu Ihab to inquire about that but they did not \nknow that she had suckled their daughter. Then `Uqba went to the Prophet (ﷺ) in Medina and asked him \nabout it. The Prophet (ﷺ) said to him, \"How (can you keep your wife) after it has been said (that both of \nyou were suckled by the same woman)?\" So, he divorced her and she was married to another \n(husband).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu Mulaika from `Uqba bin Al-Harith:", "reference": "https://sunnah.com/bukhari:2640", "inBookReference": "Book 52, Hadith 4"}, {"id": 5, "hadithNumber": "2641", "text": "Narrated `Umar bin Al-Khattab: People were (sometimes) judged by the revealing of a Divine Inspiration during the lifetime of Allah's \nApostle but now there is no longer any more (new revelation). Now we judge you by the deeds you \npractice publicly, so we will trust and favor the one who does good deeds in front of us, and we will \nnot call him to account about what he is really doing in secret, for Allah will judge him for that; but \nwe will not trust or believe the one who presents to us with an evil deed even if he claims that his \nintentions were good.", "grade": "Sahih", "narratedBy": "Narrated `Umar bin Al-Khattab:", "reference": "https://sunnah.com/bukhari:2641", "inBookReference": "Book 52, Hadith 5"}, {"id": 6, "hadithNumber": "2642", "text": "Narrated Anas: A funeral procession passed in front of the Prophet (ﷺ) and the people praised the deceased. The Prophet (ﷺ) \nsaid, \"It has been affirmed (Paradise).\" Then another funeral procession passed by and the people \ntalked badly of the deceased. The Prophet (ﷺ) said, \"It has been affirmed (Hell).\" Allah's Messenger (ﷺ) was \nasked, \"O Allah's Messenger (ﷺ)! You said it has been affirmed for both?\" The Prophet (ﷺ) said, \"The testimony \nof the people (is accepted), (for) the believer are Allah's witnesses on the earth.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2642", "inBookReference": "Book 52, Hadith 6"}, {"id": 7, "hadithNumber": "2643", "text": "Narrated Abu Al-Aswad: Once I went to Medina where there was an outbreak of disease and the people were dying rapidly. I \nwas sitting with `Umar and a funeral procession passed by. The people praised the deceased. `Umar \nsaid, \"It has been affirmed\" (Paradise). Then another funeral procession passed by. The people praised \nthe deceased. `Umar said, \"It has been affirmed.\" (Paradise). Then another funeral procession passed \nby. The people praised the deceased. `Umar said, \"It has been affirmed (Paradise).\" Then a third \nfuneral procession passed by and the people talked badly of the deceased. `Umar said, \"It has been \naffirmed (Hell).\" I asked `Umar, \"O chief of the believers! What has been affirmed?\" He said, \"I have \nsaid what the Prophet (ﷺ) said. He said, 'Allah will admit into paradise any Muslim whose good character \nis attested by four persons.' We asked the Prophet, 'If there were three witnesses only?' He said, 'Even \nthree.' We asked, 'If there were two only?' He said, 'Even two.' But we did not ask him about one \nwitness.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Aswad:", "reference": "https://sunnah.com/bukhari:2643", "inBookReference": "Book 52, Hadith 7"}, {"id": 8, "hadithNumber": "2644", "text": "Narrated Aisha: Aflah asked the permission to visit me but I did not allow him. He said, \"Do you veil yourself before \nme although I am your uncle?\" `Aisha said, \"How is that?\" Aflah replied, \"You were suckled by my \nbrother's wife with my brother's milk.\" I asked Allah's Messenger (ﷺ) about it, and he said, \"Aflah is right, so \npermit him to visit you.\"", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2644", "inBookReference": "Book 52, Hadith 8"}, {"id": 9, "hadithNumber": "2645", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) said about Hamza's daughter, \"I am not legally permitted to marry her, as foster relations \nare treated like blood relations (in marital affairs). She is the daughter of my foster brother.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2645", "inBookReference": "Book 52, Hadith 9"}, {"id": 10, "hadithNumber": "2646", "text": "Narrated `Amra bint `Abdur-Rahman: That `Aisha the wife of the Prophet (ﷺ) told her uncle that once, while the Prophet (ﷺ) was in her house, she \nheard a man asking Hafsa's permission to enter her house. `Aisha said, \"I said, 'O Allah's Messenger (ﷺ)! I \nthink the man is Hafsa's foster uncle.' \" `Aisha added, \"O Allah's Messenger (ﷺ)! There is a man asking the \npermission to enter your house.\" Allah's Messenger (ﷺ) replied, \"I think the man is Hafsa's foster uncle.\" \n`Aisha said, \"If so-and-so were living (i.e. her foster uncle) would he be allowed to visit me?\" Allah's \nApostle said, \"Yes, he would, as the foster relations are treated like blood relations (in marital affairs).", "grade": "Sahih", "narratedBy": "Narrated `Amra bint `Abdur-Rahman:", "reference": "https://sunnah.com/bukhari:2646", "inBookReference": "Book 52, Hadith 10"}, {"id": 11, "hadithNumber": "2647", "text": "Narrated Aisha: Once the Prophet (ﷺ) came to me while a man was in my house. He said, \"O `Aisha! Who is this (man)?\" \nI replied, \"My foster brothers\" He said, \"O `Aisha! Be sure about your foster brothers, as fostership is \nonly valid if it takes place in the suckling period (before two years of age).", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2647", "inBookReference": "Book 52, Hadith 11"}, {"id": 12, "hadithNumber": "2648", "text": "Narrated `Urwa bin Az-Zubair: A woman committed theft in the Ghazwa of the Conquest (of Mecca) and she was taken to the \nProphet who ordered her hand to be cut off. `Aisha said, \"Her repentance was perfect and she was \nmarried (later) and used to come to me (after that) and I would present her needs to Allah's Messenger (ﷺ).\"", "grade": "Sahih", "narratedBy": "Narrated `Urwa bin Az-Zubair:", "reference": "https://sunnah.com/bukhari:2648", "inBookReference": "Book 52, Hadith 12"}, {"id": 13, "hadithNumber": "2649", "text": "Narrated Zaid bin Khalid: Allah's Messenger (ﷺ) ordered that an unmarried man who committed illegal sexual intercourse be scourged \none hundred lashes and sent into exile for one year.", "grade": "Sahih", "narratedBy": "Narrated Zaid bin Khalid:", "reference": "https://sunnah.com/bukhari:2649", "inBookReference": "Book 52, Hadith 13"}, {"id": 14, "hadithNumber": "2650", "text": "Narrated An-Nu`man bin Bashir: My mother asked my father to present me a gift from his property; and he gave it to me after some \nhesitation. My mother said that she would not be satisfied unless the Prophet (ﷺ) was made a witness to it. \nI being a young boy, my father held me by the hand and took me to the Prophet (ﷺ) . He said to the \nProphet, \"His mother, bint Rawaha, requested me to give this boy a gift.\" The Prophet (ﷺ) said, \"Do you \nhave other sons besides him?\" He said, \"Yes.\" The Prophet (ﷺ) said, \"Do not make me a witness for \ninjustice.\" Narrated Ash-Shu`bi that the Prophet (ﷺ) said, \"I will not become a witness for injustice.\"", "grade": "Sahih", "narratedBy": "Narrated An-Nu`man bin Bashir:", "reference": "https://sunnah.com/bukhari:2650", "inBookReference": "Book 52, Hadith 14"}, {"id": 15, "hadithNumber": "2651", "text": "Narrated Zahdam bin Mudrab: I heard `Imran bin Husain saying, \"The Prophet (ﷺ) said, 'The best people are those living in my \ngeneration, then those coming after them, and then those coming after (the second generation).\" \n`Imran said \"I do not know whether the Prophet (ﷺ) mentioned two or three generations after your present \ngeneration. The Prophet (ﷺ) added, 'There will be some people after you, who will be dishonest and will \nnot be trustworthy and will give witness (evidences) without being asked to give witness, and will \nvow but will not fulfill their vows, and obesity will appear among them.\"", "grade": "Sahih", "narratedBy": "Narrated Zahdam bin Mudrab:", "reference": "https://sunnah.com/bukhari:2651", "inBookReference": "Book 52, Hadith 15"}, {"id": 16, "hadithNumber": "2652", "text": "Narrated `Abdullah: The Prophet (ﷺ) said, \"The people of my generation are the best, then those who follow them, and then \nwhose who follow the latter. After that there will come some people whose witness will go ahead of \ntheir oaths, and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"We used to \nbe beaten for taking oaths by saying, 'I bear witness by the Name of Allah or by the Covenant of \nAllah.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2652", "inBookReference": "Book 52, Hadith 16"}, {"id": 17, "hadithNumber": "2653", "text": "Narrated Anas: The Prophet (ﷺ) was asked about the great sins He said, \"They are:-- \n(1 ) To join others in worship with Allah, \n(2) To be undutiful to one's parents. \n(3) To kill a person (which Allah has forbidden to kill) (i.e. to commit the crime of murdering). \n(4) And to give a false witness.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:2653", "inBookReference": "Book 52, Hadith 17"}, {"id": 18, "hadithNumber": "2654", "text": "Narrated Abu Bakra: The Prophet (ﷺ) said thrice, \"Should I inform you out the greatest of the great sins?\" They said, \"Yes, O \nAllah's Messenger (ﷺ)!\" He said, \"To join others in worship with Allah and to be undutiful to one's parents.\" \nThe Prophet (ﷺ) then sat up after he had been reclining (on a pillow) and said, \"And I warn you against \ngiving a false witness, and he kept on saying that warning till we thought he would not stop. (See \nHadith No. 7, Vol. 8)", "grade": "Sahih", "narratedBy": "Narrated Abu Bakra:", "reference": "https://sunnah.com/bukhari:2654", "inBookReference": "Book 52, Hadith 18"}, {"id": 19, "hadithNumber": "2655", "text": "Narrated `Aisha: The Prophet (ﷺ) heard a man (reciting Qur'an) in the Mosque, and he said, \"May Allah bestow His Mercy \nupon him. No doubt, he made me remember such-and such Verses of such-and-such Sura which I \ndropped (from my memory). \nNarrated Aisha: The Prophet (ﷺ) performed the Tahajjud prayer in my house, and then he heard the voice \nof `Abbad who was praying in the Mosque, and said, \"O `Aisha! Is this `Abbad's voice?\" I said, \"Yes.\" \nHe said, \"O Allah! Be merciful to `Abbad!\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:2655", "inBookReference": "Book 52, Hadith 19"}, {"id": 20, "hadithNumber": "2656", "text": "Narrated `Abdullah bin `Umar: The Prophet (ﷺ) said, \"Bilal pronounces the Adhan when it is still night (before dawn), so eat and drink \ntill the next Adhan is pronounced (or till you hear Ibn Um Maktum's Adhan).\" Ibn Um Maktum was a \nblind man who would not pronounce the Adhan till he was told that it was dawn.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:2656", "inBookReference": "Book 52, Hadith 20"}, {"id": 21, "hadithNumber": "2657", "text": "Narrated Al-Miswar bin Makhrama: Some outer garments were received the Prophet (ﷺ) and my father (Makhrama) said to me, \"Let us go to \nthe Prophet (ﷺ) so that he may give us something from the garments.\" So, my father stood at the door and \nspoke. The Prophet (ﷺ) recognized his voice and came out carrying a garment and telling Makhrama the \ngood qualities of that garment, adding, \"I have kept this for you, I have sent this for you.\"", "grade": "Sahih", "narratedBy": "Narrated Al-Miswar bin Makhrama:", "reference": "https://sunnah.com/bukhari:2657", "inBookReference": "Book 52, Hadith 21"}, {"id": 22, "hadithNumber": "2658", "text": "Narrated Abu Sa`id Al-Khudri: The Prophet (ﷺ) said, \"Isn't the witness of a woman equal to half of that of a man?\" The women said, \n\"Yes.\" He said, \"This is because of the deficiency of a woman's mind.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:2658", "inBookReference": "Book 52, Hadith 22"}, {"id": 23, "hadithNumber": "2659", "text": "Narrated `Uqba bin Al-Harith: That he had married Um Yahya bint Abu Ihab. He said. \"A black slave-lady came and said, 'I suckled \nyou both.' I then mentioned that to the Prophet (ﷺ) who turned his face aside.\" `Uqba further said, \"I went \nto the other side and told the Prophet (ﷺ) about it. He said, 'How can you (keep her as your wife) when the \nlady has said that she suckled both of you (i.e. you and your wife?)\" So, the Prophet (ﷺ) ordered him to \ndivorce her.", "grade": "Sahih", "narratedBy": "Narrated `Uqba bin Al-Harith:", "reference": "https://sunnah.com/bukhari:2659", "inBookReference": "Book 52, Hadith 23"}, {"id": 24, "hadithNumber": "2660", "text": "Narrated `Uqba bin Al-Harith: I married a woman and later on a woman came and said, \"I suckled you both.\" So, I went to the \nProphet (to ask him about it). He said, \"How can you (keep her as a wife) when it has been said (that \nyou were foster brother and sister)? Leave (divorce) her.", "grade": "Sahih", "narratedBy": "Narrated `Uqba bin Al-Harith:", "reference": "https://sunnah.com/bukhari:2660", "inBookReference": "Book 52, Hadith 24"}, {"id": 25, "hadithNumber": "2661", "text": "Narrated Aisha: (the wife of the Prophet) \"Whenever Allah's Messenger (ﷺ) intended to go on a journey, he would draw lots \r\namongst his wives and would take with him the one upon whom the lot fell. During a Ghazwa of his, \r\nhe drew lots amongst us and the lot fell upon me, and I proceeded with him after Allah had decreed \r\nthe use of the veil by women. I was carried in a Howdah (on the camel) and dismounted while still in \r\nit. When Allah's Messenger (ﷺ) was through with his Ghazwa and returned home, and we approached the \r\ncity of Medina, Allah's Messenger (ﷺ) ordered us to proceed at night. When the order of setting off was \r\ngiven, I walked till I was past the army to answer the call of nature. After finishing I returned (to the \r\ncamp) to depart (with the others) and suddenly realized that my necklace over my chest was missing. \r\nSo, I returned to look for it and was delayed because of that. The people who used to carry me on the \r\ncamel, came to my Howdah and put it on the back of the camel, thinking that I was in it, as, at that \r\ntime, women were light in weight, and thin and lean, and did not use to eat much. So, those people did \r\nnot feel the difference in the heaviness of the Howdah while lifting it, and they put it over the camel. \r\nAt that time I was a young lady. They set the camel moving and proceeded on. I found my necklace \r\nafter the army had gone, and came to their camp to find nobody. So, I went to the place where I used \r\nto stay, thinking that they would discover my absence and come back in my search. While in that \r\nstate, I felt sleepy and slept. \r\nSafwan bin Mu'attal As-Sulami Adh-Dhakwani was behind the army and reached my abode in the \r\nmorning. When he saw a sleeping person, he came to me, and he used to see me before veiling. So, I \r\ngot up when I heard him saying, \"Inna lil-lah-wa inn a ilaihi rajiun (We are for Allah, and we will \r\nreturn to Him).\" He made his camel knell down. He got down from his camel, and put his leg on the \r\nfront legs of the camel and then I rode and sat over it. Safwan set out walking, leading the camel by \r\nthe rope till we reached the army who had halted to take rest at midday. Then whoever was meant for \r\ndestruction, fell into destruction, (some people accused me falsely) and the leader of the false accusers \r\nwas `Abdullah bin Ubai bin Salul. After that we returned to Medina, and I became ill for one month \r\nwhile the people were spreading the forged statements of the false accusers. I was feeling during my \r\nailment as if I were not receiving the usual kindness from the Prophet (ﷺ) which I used to receive from \r\nhim when I got sick. But he would come, greet and say, 'How is that (girl)?' I did not know anything \r\nof what was going on till I recovered from my ailment and went out with Um Mistah to the Manasi \r\nwhere we used to answer the call of nature, and we used not to go to answer the call of nature except \r\nfrom night to night and that was before we had lavatories near to our houses. And this habit of ours \r\nwas similar to the habit of the old 'Arabs in the open country (or away from houses). So. I and Um \r\nMistah bint Ruhm went out walking. Um Mistah stumbled because of her long dress and on that she \r\nsaid, 'Let Mistah be ruined.' I said, 'You are saying a bad word. Why are you abusing a man who took \r\npart in (the battle of) Badr?' She said, 'O Hanata (you there) didn't you hear what they said?' Then she \r\ntold me the rumors of the false accusers. \r\nMy sickness was aggravated, and when I returned home, Allah's Messenger (ﷺ) came to me, and after \r\ngreeting he said, 'How is that (girl)?' I requested him to allow me to go to my parents. I wanted then to \r\nbe sure of the news through them I Allah's Messenger (ﷺ) allowed me, and I went to my parents and asked \r\nmy mother, 'What are the people talking about?' She said, 'O my daughter! Don't worry much about \r\nthis matter. By Allah, never is there a charming woman loved by her husband who has other wives, \r\nbut the women would forge false news about her.' I said, 'Glorified be Allah! Are the people really \r\ntaking of this matter?' That night I kept on weeping and could not sleep till morning. In the morning \r\nAllah's Messenger (ﷺ) called `Ali bin Abu Talib and Usama bin Zaid when he saw the Divine Inspiration \r\ndelayed, to consul them about divorcing his wife (i.e. `Aisha). Usama bin Zaid said what he knew of \r\nthe good reputation of his wives and added, 'O Allah's Messenger (ﷺ)! Keep you wife, for, by Allah, we \r\nknow nothing about her but good.' `Ali bin Abu Talib said, 'O Allah's Messenger (ﷺ)! Allah has no imposed \r\nrestrictions on you, and there are many women other than she, yet you may ask the woman-servant \r\nwho will tell you the truth.' On that Allah's Messenger (ﷺ) called Barirah and said, 'O Barirah. Did you ever \r\nsee anything which roused your suspicions about her?' Barirah said, 'No, by Allah Who has sent you \r\nwith the Truth, I have never seen in her anything faulty except that she is a girl of immature age, who \r\nsometimes sleeps and leaves the dough for the goats to eat.' On that day Allah's Messenger (ﷺ) ascended the \r\npulpit and requested that somebody support him in punishing `Abdullah bin Ubai bin Salul. Allah's \r\nApostle said, 'Who will support me to punish that person (`Abdullah bin Ubai bin Salul) who has hurt \r\nme by slandering the reputation of my family? By Allah, I know nothing about my family but good, \r\nand they have accused a person about whom I know nothing except good, and he never entered my \r\nhouse except in my company.' \r\nSa`d bin Mu`adh got up and said, 'O Allah's Messenger (ﷺ)! by Allah, I will relieve you from him. If that \r\nman is from the tribe of the Aus, then we will chop his head off, and if he is from our brothers, the \r\nKhazraj, then order us, and we will fulfill your order.' On that Sa`d bin 'Ubada, the chief of the \r\nKhazraj and before this incident, he had been a pious man, got up, motivated by his zeal for his tribe \r\nand said, 'By Allah, you have told a lie; you cannot kill him, and you will never be able to kill him.' \r\nOn that Usaid bin Al-Hadir got up and said (to Sa`d bin 'Ubada), 'By Allah! you are a liar. By Allah, \r\nwe will kill him; and you are a hypocrite, defending the hypocrites.' On this the two tribes of Aus and \r\nKhazraj got excited and were about to fight each other, while Allah's Messenger (ﷺ) was standing on the \r\npulpit. He got down and quieted them till they became silent and he kept quiet. On that day I kept on \r\nweeping so much so that neither did my tears stop, nor could I sleep. \r\nIn the morning my parents were with me and I had wept for two nights and a day, till I thought my \r\nliver would burst from weeping. While they were sitting with me and I was weeping, an Ansari \r\nwoman asked my permission to enter, and I allowed her to come in. She sat down and started weeping \r\nwith me. While we were in this state, Allah's Messenger (ﷺ) came and sat down and he had never sat with me \r\nsince the day they forged the accusation. No revelation regarding my case came to him for a month. \r\nHe recited Tashah-hud (i.e. None has the right to be worshipped but Allah and Muhammad is His \r\nApostle) and then said, 'O `Aisha! I have been informed such-and-such about you; if you are innocent, \r\nthen Allah will soon reveal your innocence, and if you have committed a sin, then repent to Allah and \r\nask Him to forgive you, for when a person confesses his sin and asks Allah for forgiveness, Allah \r\naccepts his repentance.' When Allah's Messenger (ﷺ) finished his speech my tears ceased completely and \r\nthere remained not even a single drop of it. I requested my father to reply to Allah's Messenger (ﷺ) on my \r\nbehalf. My father said, By Allah, I do not know what to say to Allah's Messenger (ﷺ).' I said to my mother, \r\n'Talk to Allah's Messenger (ﷺ) on my behalf.' She said, 'By Allah, I do not know what to say to Allah's \r\nApostle. \r\nI was a young girl and did not have much knowledge of the Qur'an. I said. 'I know, by Allah, that you \r\nhave listened to what people are saying and that has been planted in your minds and you have taken it \r\nas a truth. Now, if I told you that I am innocent and Allah knows that I am innocent, you would not \r\nbelieve me and if I confessed to you falsely that I am guilty, and Allah knows that I am innocent you \r\nwould believe me. By Allah, I don't compare my situation with you except to the situation of Joseph's \r\nfather (i.e. Jacob) who said, 'So (for me) patience is most fitting against that which you assert and it is \r\nAllah (Alone) whose help can be sought.' Then I turned to the other side of my bed hoping that Allah \r\nwould prove my innocence. By Allah I never thought that Allah would reveal Divine Inspiration in \r\nmy case, as I considered myself too inferior to be talked of in the Holy Qur'an. I had hoped that \r\nAllah's Messenger (ﷺ) might have a dream in which Allah would prove my innocence. By Allah, Allah's \r\nApostle had not got up and nobody had left the house before the Divine Inspiration came to Allah's \r\nApostle. So, there overtook him the same state which used to overtake him, (when he used to have, on \r\nbeing inspired divinely). He was sweating so much so that the drops of the sweat were dropping like \r\npearls though it was a (cold) wintry day. When that state of Allah's Messenger (ﷺ) was over, he was smiling \r\nand the first word he said, `Aisha! Thank Allah, for Allah has declared your innocence.' My mother \r\ntold me to go to Allah's Messenger (ﷺ) . I replied, 'By Allah I will not go to him and will not thank but Allah.' \r\nSo Allah revealed: \"Verily! They who spread the slander are a gang among you . . .\" (24.11) \r\nWhen Allah gave the declaration of my Innocence, Abu Bakr, who used to provide for Mistah bin \r\nUthatha for he was his relative, said, 'By Allah, I will never provide Mistah with anything because of \r\nwhat he said about Aisha.' But Allah later revealed: -- \r\n\"And let not those who are good and wealthy among you swear not to help their kinsmen, those in \r\nneed and those who left their homes in Allah's Cause. Let them forgive and overlook. Do you not wish \r\nthat Allah should forgive you? Verily! Allah is Oft-forgiving, Most Merciful.\" (24.22) After that Abu \r\nBakr said, 'Yes ! By Allah! I like that Allah should forgive me,' and resumed helping Mistah whom he \r\nused to help before. \r\nAllah's Messenger (ﷺ) also asked Zainab bint Jahsh (i.e. the Prophet's wife about me saying, 'What do you \r\nknow and what did you see?' She replied, 'O Allah's Messenger (ﷺ)! I refrain to claim hearing or seeing what \r\nI have not heard or seen. By Allah, I know nothing except goodness about Aisha.\" Aisha further added \r\n\"Zainab was competing with me (in her beauty and the Prophet's love), yet Allah protected her (from \r\nbeing malicious), for she had piety.\"", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2661", "inBookReference": "Book 52, Hadith 25"}, {"id": 26, "hadithNumber": "2662", "text": "Narrated Abu Bakra: A man praised another man in front of the Prophet (ﷺ) . The Prophet (ﷺ) said to him, \"Woe to you, you have \ncut off your companion's neck, you have cut off your companion's neck,\" repeating it several times \nand then added, \"Whoever amongst you has to praise his brother should say, 'I think that he is so and \nso, and Allah knows exactly the truth, and I do not confirm anybody's good conduct before Allah, but \nI think him so and so,' if he really knows what he says about him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Bakra:", "reference": "https://sunnah.com/bukhari:2662", "inBookReference": "Book 52, Hadith 26"}, {"id": 27, "hadithNumber": "2663", "text": "Narrated Abu Musa Al-Ash`ari: The Prophet (ﷺ) heard someone praising another and exaggerating in his praise. The Prophet (ﷺ) said, \"You \nhave ruined or cut the man's back (by praising him so much).", "grade": "Sahih", "narratedBy": "Narrated Abu Musa Al-Ash`ari:", "reference": "https://sunnah.com/bukhari:2663", "inBookReference": "Book 52, Hadith 27"}, {"id": 28, "hadithNumber": "2664", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) called me to present myself in front of him or the eve of the battle of Uhud, while I \nwas fourteen years of age at that time, and he did not allow me to take part in that battle, but he called \nme in front of him on the eve of the battle of the Trench when I was fifteen years old, and he allowed \nme (to join the battle).\" Nafi` said, \"I went to `Umar bin `Abdul `Aziz who was Caliph at that time and \nrelated the above narration to him, He said, \"This age (fifteen) is the limit between childhood and \nmanhood,\" and wrote to his governors to give salaries to those who reached the age of fifteen.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:2664", "inBookReference": "Book 52, Hadith 28"}, {"id": 29, "hadithNumber": "2665", "text": "Narrated Abu Sa`id Al-Khudri: The Prophet (ﷺ) said, \"Bath on Friday is compulsory for those who have attained the age of puberty.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:2665", "inBookReference": "Book 52, Hadith 29"}, {"id": 30, "hadithNumber": "2666", "text": "Narrated `Abdullah: Allah's Messenger (ﷺ) said, \"If somebody takes a false oath in order to get the property of a Muslim \n(unjustly) by that oath, then Allah will be angry with him when he will meet Him.\" Al-Ash'ath \ninformed me, \"By Allah! This was said regarding me. There was a dispute about a piece of land \nbetween me and a man from the Jews who denied my right. I took him to the Prophet. Allah's Messenger (ﷺ) \nasked me, 'Do you have an evidence?' I replied in the negative. He said to the Jew, 'Take an oath.' I \nsaid, 'O Allah's Messenger (ﷺ)! He will surely take an oath and take my property unjustly.\" So, Allah \nrevealed: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . \" \n(3.77)", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2666", "inBookReference": "Book 52, Hadith 30"}, {"id": 31, "hadithNumber": "2668", "text": "Narrated Ibn Abu Mulaika: Ibn `Abbas wrote that the Prophet (ﷺ) gave his verdict on the basis of the defendant's oath.", "grade": "Sahih", "narratedBy": "Narrated Ibn Abu Mulaika:", "reference": "https://sunnah.com/bukhari:2668", "inBookReference": "Book 52, Hadith 31"}, {"id": 32, "hadithNumber": "2669", "text": "Narrated Abu Wail: `Abdullah (bin Mas`ud) said, \"Whoever takes a (false) oath in order to grab some property (unjustly), \nAllah will be angry with him when he will meet Him. Allah confirmed that through His Divine \nRevelation: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . \n. they will have a painful punishment.\" (3.77) \nAl-Ash'ath bin Qais came to us and asked, 'What is Abu `Abdur-Rahman (i.e. `Abdullah) telling you? \n'We told him what he was narrating to us. He said, 'He was telling the truth; this Divine Verse was \nrevealed in connection with me. There was a dispute between me and another man about something \nand the case was filed before Allah's Messenger (ﷺ) who said, 'Produce your two witnesses or else the \ndefendant is to take an oath.' I said, The defendant will surely take a (false) oath caring for nothing.' \nThe Prophet (ﷺ) said, 'Whoever takes a false oath in order to grab (other's) property, then Allah will be \nangry with him when he will meet Him.' Then Allah revealed its confirmation. Al-Ashath then recited \nthe above Divine Verse.\" (3.77)", "grade": "Sahih", "narratedBy": "Narrated Abu Wail:", "reference": "https://sunnah.com/bukhari:2669", "inBookReference": "Book 52, Hadith 32"}, {"id": 33, "hadithNumber": "2671", "text": "Narrated Ibn `Abbas: Hilal bin Umaiya accused his wife before the Prophet (ﷺ) of committing illegal sexual intercourse with \nSharik bin Sahma.' The Prophet (ﷺ) said, \"Produce a proof, or else you would get the legal punishment \n(by being lashed) on your back.\" Hilal said, \"O Allah's Messenger (ﷺ)! If anyone of us saw another man over \nhis wife, would he go to search for a proof.\" The Prophet (ﷺ) went on saying, \"Produce a proof or else you \nwould get the legal punishment (by being lashed) on your back.\" The Prophet (ﷺ) then mentioned the \nnarration of Lian (as in the Holy Book). (Surat-al-Nur: 24)", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:2671", "inBookReference": "Book 52, Hadith 33"}, {"id": 34, "hadithNumber": "2672", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"There are three persons whom Allah will neither talk to nor look at, nor purify \nfrom (the sins), and they will have a painful punishment. (They are): \n(1) A man possessed superfluous water on a way and he withheld it from the travelers. \n(2) a man who gives a pledge of allegiance to a Muslim ruler and gives it only for worldly gains. If the \nruler gives him what he wants, he remains obedient to It, otherwise he does not abide by it, and \n(3) a man bargains with another man after the `Asr prayer and the latter takes a false oath in the Name \nof Allah) claiming that he has been offered so much for the thing and the former (believes him and) \nbuys it.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2672", "inBookReference": "Book 52, Hadith 34"}, {"id": 35, "hadithNumber": "2673", "text": "Narrated Ibn Mas`ud: The Prophet (ﷺ) said, \"Whoever takes a (false) oath in order to grab (others) property, then Allah will be \nangry with him when he will meet Him.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn Mas`ud:", "reference": "https://sunnah.com/bukhari:2673", "inBookReference": "Book 52, Hadith 35"}, {"id": 36, "hadithNumber": "2674", "text": "Narrated Abu Huraira: The Prophet (ﷺ) asked some people to take an oath, and they hurried for it. The Prophet (ﷺ) ordered that lots \nshould be drawn amongst them as to who would take an oath first.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2674", "inBookReference": "Book 52, Hadith 36"}, {"id": 37, "hadithNumber": "2675", "text": "Narrated `Abdullah bin Abu `Aufa: A man displayed some goods in the market and took a false oath that he had been offered so much for \nthem though he was not offered that amount Then the following Divine Verse was revealed:-- \"Verily! \nThose who purchase a little gain at the cost of Allah's covenant and their oaths . . . Will get painful \npunishment.\" (3.77) Ibn Abu `Aufa added, \"Such person as described above is a treacherous Riba eater \n(i.e. eater of usury).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Abu `Aufa:", "reference": "https://sunnah.com/bukhari:2675", "inBookReference": "Book 52, Hadith 37"}, {"id": 38, "hadithNumber": "2676", "text": "Narrated Abu Wail from `Abdullah: The Prophet (ﷺ) said, \"Whoever takes a false oath in order to grab another man's (or his brother's) \nproperty, then Allah will be angry with him when he will meet him.\" Then Allah confirmed this by \nrevealing the Divine Verse: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant \nand their oaths . . . Will get painful punishment.\" (3.77) Al-Ash'ath met me and asked, \"What did \n`Abdullah tell you today?\" I said, \"So and so.\" He said, \"The Verse was revealed regarding my case.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Wail from `Abdullah:", "reference": "https://sunnah.com/bukhari:2676", "inBookReference": "Book 52, Hadith 38"}, {"id": 39, "hadithNumber": "2678", "text": "Narrated Talha bin 'Ubaidullah: A man came to Allah's Messenger (ﷺ) asking him about Islam, Allah's Messenger (ﷺ) said, \"You have to offer five \ncompulsory prayers in a day and a night (24 hours).\" The man asked, \"Is there any more compulsory \nprayers for me?\" Allah's Messenger (ﷺ) said, \"No, unless you like to offer Nawafil (i.e. optional prayers).\" \nAllah's Messenger (ﷺ) then added, \"You have to observe fasts during the month of Ramadan.\" The man said, \n\"Am I to fast any other days?' Allah's Messenger (ﷺ) said, \"No, unless you wish to observe the optional fast \nvoluntarily.\" Then Allah's Messenger (ﷺ) told him about the compulsory Zakat. The man asked, \"Do I have \nto give anything besides?\" Allah's Messenger (ﷺ) said, \"No, unless you wish to give in charity voluntarily.\" \nSo, the man departed saying, \"By Allah I will neither do more nor less than that.\" Allah's Messenger (ﷺ) said, \n\"If he has said the truth he will be successful.\"", "grade": "Sahih", "narratedBy": "Narrated Talha bin 'Ubaidullah:", "reference": "https://sunnah.com/bukhari:2678", "inBookReference": "Book 52, Hadith 39"}, {"id": 40, "hadithNumber": "2679", "text": "Narrated `Abdullah: The Prophet (ﷺ) said, \"Whoever has to take an oath should swear by Allah or remain silent.\" (i.e. He \nshould not swear by other than Allah.)", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:2679", "inBookReference": "Book 52, Hadith 40"}, {"id": 41, "hadithNumber": "2680", "text": "Narrated Um Salama: Once Allah's Messenger (ﷺ) said, \"You people present your cases to me and some of you may be more \neloquent and persuasive in presenting their argument. So, if I give some one's right to another \n(wrongly) because of the latter's (tricky) presentation of the case, I am really giving him a piece of \nfire; so he should not take it.\"", "grade": "Sahih", "narratedBy": "Narrated Um Salama:", "reference": "https://sunnah.com/bukhari:2680", "inBookReference": "Book 52, Hadith 41"}, {"id": 42, "hadithNumber": "2681", "text": "Narrated `Abdullah bin `Abbas: Abu Sufyan told me that Heraclius said to him, \"When I inquired you what he (i.e. Muhammad) \nordered you, you replied that he ordered you to establish the prayer, to speak the truth, to be chaste, to \nkeep promises and to pay back trusts.\" Then Heraclius added, \"These are really the qualities of a \nprophet.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:2681", "inBookReference": "Book 52, Hadith 42"}, {"id": 43, "hadithNumber": "2682", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"The signs of a hypocrite are three: \n(1) whenever he speaks, he tells a lie, \n(2) whenever he is entrusted, he proves to be dishonest, \n(3) whenever he promises, he breaks his promise.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2682", "inBookReference": "Book 52, Hadith 43"}, {"id": 44, "hadithNumber": "2683", "text": "Narrated Muhammad bin `Ali: Jabir bin `Abdullah said, \"When the Prophet (ﷺ) died, Abu Bakr received some property from Al-`Ala bin \nAl-Hadrami. Abu Bakr said to the people, \"Whoever has a money claim on the Prophet, or was \npromised something by him, should come to us (so that we may pay him his right).\" Jabir added, \"I \nsaid (to Abu Bakr), Allah's Messenger (ﷺ) promised me that he would give me this much, and this much, and \nthis much (spreading his hands three times).\" Jabir added, \"Abu Bakr counted for me and handed me \nfive-hundred (gold pieces), and then five-hundred, and then five-hundred.\"", "grade": "Sahih", "narratedBy": "Narrated Muhammad bin `Ali:", "reference": "https://sunnah.com/bukhari:2683", "inBookReference": "Book 52, Hadith 44"}, {"id": 45, "hadithNumber": "2684", "text": "Narrated Sa`id bin Jubair: A Jew from Hira asked me which one of the two periods Musa (i.e. Prophet Moses) completed. I said, \n\"I don't know, (but wait) till I see the most learned 'Arab and inquire him about it.\" So, I went to Ibn \n`Abbas and asked him. He replied, \"Moses completed the longer and better period.\" Ibn `Abbas \nadded, \"No doubt, an apostle of Allah always does what he says.\"", "grade": "Sahih", "narratedBy": "Narrated Sa`id bin Jubair:", "reference": "https://sunnah.com/bukhari:2684", "inBookReference": "Book 52, Hadith 45"}, {"id": 46, "hadithNumber": "2685", "text": "Narrated Ubaidullah bin `Abdullah bin `Utba: Ibn `Abbas said, \"O Muslims? How do you ask the people of the Scriptures, though your Book (i.e. \nthe Qur'an) which was revealed to His Prophet is the most recent information from Allah and you \nrecite it, the Book that has not been distorted? Allah has revealed to you that the people of the \nscriptures have changed with their own hands what was revealed to them and they have said (as \nregards their changed Scriptures): This is from Allah, in order to get some worldly benefit thereby.\" \nIbn `Abbas added: \"Isn't the knowledge revealed to you sufficient to prevent you from asking them? \nBy Allah I have never seen any one of them asking (Muslims) about what has been revealed to you.\"", "grade": "Sahih", "narratedBy": "Narrated Ubaidullah bin `Abdullah bin `Utba:", "reference": "https://sunnah.com/bukhari:2685", "inBookReference": "Book 52, Hadith 46"}, {"id": 47, "hadithNumber": "2686", "text": "Narrated An-Nu`man bin Bashir: The Prophet (ﷺ) said, \"The example of the person abiding by Allah's orders and limits (or the one who \nabides by the limits and regulations prescribed by Allah) in comparison to the one who do wrong and \nviolate Allah's limits and orders is like the example of people drawing lots for seats in a boat. Some of \nthem got seats in the upper part while the others in the lower part ; those in the, lower part have to \npass by those in the upper one to get water, and that troubled the latter. One of them (i.e. the people in \nthe lower part) took an ax and started making a hole in the bottom of the boat. The people of the upper \npart came and asked him, (saying), 'What is wrong with you?' He replied, \"You have been troubled \nmuch by my (coming up to you), and I have to get water.' Now if they prevent him from doing that \nthey will save him and themselves, but if they leave him (to do what he wants), they will destroy him \nand themselves.\"", "grade": "Sahih", "narratedBy": "Narrated An-Nu`man bin Bashir:", "reference": "https://sunnah.com/bukhari:2686", "inBookReference": "Book 52, Hadith 47"}, {"id": 48, "hadithNumber": "2687", "text": "Narrated Um Al-Ala: That when the Ansar drew lots as to which of the emigrants should dwell with which of the Ansar, the \nname of `Uthman bin Mazun came out (to be in their lot). Um Al-Ala further said, \"Uthman stayed \nwith us, and we nursed him when he got sick, but he died. We shrouded him in his clothes, and Allah's \nApostle came to our house and I said, (addressing the dead `Uthman), 'O Abu As-Sa'ib! May Allah be \nmerciful to you. I testify that Allah has blessed you.' The Prophet (ﷺ) said to me, \"How do you know that \nAllah has blessed him?\" I replied, 'I do not know O Allah's Messenger (ﷺ)! May my parents be sacrificed for \nyou.' Allah's Messenger (ﷺ) said, 'As regards `Uthman, by Allah he has died and I really wish him every \ngood, yet, by Allah, although I am Allah's Messenger (ﷺ), I do not know what will be done to me.' Um Al- \nAla added, 'By Allah I shall never attest the piety of anybody after him. And what Allah's Messenger (ﷺ)s \nsaid made me sad.\" Um Al-Ala further said, \"Once I slept and saw in a dream, a flowing stream for \n`Uthman. So I went to Allah's Messenger (ﷺ) and told him about it, he said, 'That is (the symbol of) his \ndeeds.\"", "grade": "Sahih", "narratedBy": "Narrated Um Al-Ala:", "reference": "https://sunnah.com/bukhari:2687", "inBookReference": "Book 52, Hadith 48"}, {"id": 49, "hadithNumber": "2688", "text": "Narrated Aisha: Whenever Allah's Messenger (ﷺ) intended to go on a journey, he used to draw lots among his wives and \nwould take with him the one on whom the lot fell. He also used to fix for everyone of his wives a day \nand a night, but Sauda bint Zam`a gave her day and night to `Aisha, the wife of the Prophet (ﷺ) intending \nthereby to please Allah's Messenger (ﷺ).", "grade": "Sahih", "narratedBy": "Narrated Aisha:", "reference": "https://sunnah.com/bukhari:2688", "inBookReference": "Book 52, Hadith 49"}, {"id": 50, "hadithNumber": "2689", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"If the people knew what is the reward of making the call (for the prayer) and (of \nbeing in) the first row (in the prayer), and if they found no other way to get this privilege except by \ncasting lots, they would certainly cast lots for it. If they knew the reward of the noon prayer, they \nwould race for it, and if they knew the reward of the morning (i.e. Fajr) and `Isha prayers, they would \npresent themselves for the prayer even if they had to crawl to reach there.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:2689", "inBookReference": "Book 52, Hadith 50"}]}