{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 74, "bookName": "Chapter: \"Intoxicants, gambling, Al-Ansab and Al-Azlam are an abomination of Shaitan's handiwork ...\"", "hadiths": [{"id": 1, "hadithNumber": "5575", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"Whoever drinks alcoholic drinks in the world and does not repent (before \ndying), will be deprived of it in the Hereafter.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:5575", "inBookReference": "Book 74, Hadith 1"}, {"id": 2, "hadithNumber": "5576", "text": "Narrated Abu Huraira: On the night Allah's Messenger (ﷺ) was taken on a night journey (Miraj) two cups, one containing wine and \nthe other milk, were presented to him at Jerusalem. He looked at it and took the cup of milk. Gabriel \nsaid, \"Praise be to Allah Who guided you to Al-Fitra (the right path); if you had taken (the cup of) \nwine, your nation would have gone astray.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:5576", "inBookReference": "Book 74, Hadith 2"}, {"id": 3, "hadithNumber": "5577", "text": "Narrated Anas: I heard from Allah's Messenger (ﷺ) a narration which none other than I will narrate to you. The Prophet, said, \n\"From among the portents of the our are the following: General ignorance (in religious affairs) will \nprevail, (religious) knowledge will decrease, illegal sexual intercourse will prevail, alcoholic drinks \nwill be drunk (in abundance), men will decrease and women will increase so much so that for every \nfifty women there will be one man to look after them.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:5577", "inBookReference": "Book 74, Hadith 3"}, {"id": 4, "hadithNumber": "5578", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a \nbeliever; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the \ntime of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman \nbin Al- Harith bin Hisham told me that Abu Bakr used to narrate that narration to him on the authority \nof Abu Huraira. He used to add that Abu Bakr used to mention, besides the above cases, \"And he who \nrobs (takes illegally something by force) while the people are looking at him, is not a believer at the \ntime he is robbing (taking).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:5578", "inBookReference": "Book 74, Hadith 4"}, {"id": 5, "hadithNumber": "5579", "text": "Narrated Ibn `Umar: \"Alcoholic drinks were prohibited (by Allah) when there was nothing of it (special kind of wine) in \nMedina.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:5579", "inBookReference": "Book 74, Hadith 5"}, {"id": 6, "hadithNumber": "5580", "text": "Narrated Anas: \"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, \nfor most of our liquors were made from unripe and ripe dates.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:5580", "inBookReference": "Book 74, Hadith 6"}, {"id": 7, "hadithNumber": "5581", "text": "Narrated Ibn `Umar: `Umar stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, \nand these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an \nalcoholic drink is that, that disturbs the mind.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:5581", "inBookReference": "Book 74, Hadith 7"}, {"id": 8, "hadithNumber": "5582", "text": "Narrated Anas bin Malik: I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b with a drink prepared from ripe and unripe \ndates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing \nthat) Abu Talha said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:5582", "inBookReference": "Book 74, Hadith 8"}, {"id": 9, "hadithNumber": "5583", "text": "Narrated Anas: While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the \nyoungest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \n\"Throw it away.\" So I threw it away.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:5583", "inBookReference": "Book 74, Hadith 9"}, {"id": 10, "hadithNumber": "5584", "text": "Narrated Anas bin Malik: Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe \ndates.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:5584", "inBookReference": "Book 74, Hadith 10"}, {"id": 11, "hadithNumber": "5585", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) was asked about Al-Bit. He said, \"All drinks that intoxicate are unlawful (to drink.)", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:5585", "inBookReference": "Book 74, Hadith 11"}, {"id": 12, "hadithNumber": "5586", "text": "Narrated 'Aisha: Allah's Messenger (ﷺ) was asked about Al-Bit a liquor prepared from honey \n     which the Yemenites used to drink. Allah's Messenger (ﷺ) said, \"All drinks \n     that intoxicate are unlawful (to drink).\"", "grade": "Sahih", "narratedBy": "Narrated 'Aisha:", "reference": "https://sunnah.com/bukhari:5586", "inBookReference": "Book 74, Hadith 12"}, {"id": 13, "hadithNumber": "5587", "text": "Anas bin Malik said: Allah's Messenger (ﷺ) said, \"Do not make drinks in Ad-Dubba' nor in \n     Al-Muzaffat.  Abu Huraira used to add to them Al-Hantam and An-Naqir.", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:5587", "inBookReference": "Book 74, Hadith 13"}, {"id": 14, "hadithNumber": "5588", "text": "Narrated Ibn `Umar: `Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ), saying, \"Alcoholic drinks were prohibited \nby Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, \nbarley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's \nApostle had not left us before he had given us definite verdicts concerning three matters, i.e., how \nmuch a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person \namong whose heirs there is no father or son), and various types of Riba(1 ) (usury) .\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:5588", "inBookReference": "Book 74, Hadith 14"}, {"id": 15, "hadithNumber": "5589", "text": "Narrated 'Umar: \"Alcoholic drinks are prepared from five things, i.e., raisins, dates.\n     wheat, barley and honey.\"", "grade": "Sahih", "narratedBy": "Narrated 'Umar:", "reference": "https://sunnah.com/bukhari:5589", "inBookReference": "Book 74, Hadith 15"}, {"id": 16, "hadithNumber": "5590", "text": "Narrated Abu 'Amir or Abu Malik Al-Ash'ari: that he heard the Prophet (ﷺ) saying, \"From among my followers there will \n     be some people who will consider illegal sexual intercourse, the \n     wearing of silk, the drinking of alcoholic drinks and the use of \n     musical instruments, as lawful. And there will be some people who will\n     stay near the side of a mountain and in the evening their shepherd \n     will come to them with their sheep and ask them for something, but \n     they will say to him, 'Return to us tomorrow.' Allah will destroy them\n     during the night and will let the mountain fall on them, and He will \n     transform the rest of them into monkeys and pigs and they will remain \n     so till the Day of Resurrection.\"", "grade": "Sahih", "narratedBy": "Narrated Abu 'Amir or Abu Malik Al-Ash'ari:", "reference": "https://sunnah.com/bukhari:5590", "inBookReference": "Book 74, Hadith 16"}, {"id": 17, "hadithNumber": "5591", "text": "Narrated Sahl: Abu Usaid As-Sa`idi came and invited Allah's Messenger (ﷺ) on the occasion of his wedding. His wife who \nwas the bride, was serving them. Do you know what drink she prepared for Allah's Messenger (ﷺ) ? She had \nsoaked some dates in water in a Tur overnight.", "grade": "Sahih", "narratedBy": "Narrated Sahl:", "reference": "https://sunnah.com/bukhari:5591", "inBookReference": "Book 74, Hadith 17"}, {"id": 18, "hadithNumber": "5592", "text": "Narrated Jabir: Allah's Messenger (ﷺ) forbade the use of (certain) containers, but the Ansar said, \"We cannot dispense with \nthem.\" The Prophet (ﷺ) then said, \"If so, then use them.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:5592", "inBookReference": "Book 74, Hadith 18"}, {"id": 19, "hadithNumber": "5593", "text": "Narrated `Abdullah bin `Amr: When the Prophet (ﷺ) forbade the use of certain containers (that were used for preparing alcoholic drinks), \nsomebody said to the Prophet (ﷺ) . \"But not all the people can find skins.\" So he allowed them to use clay \njars not covered with pitch.", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Amr:", "reference": "https://sunnah.com/bukhari:5593", "inBookReference": "Book 74, Hadith 19"}, {"id": 20, "hadithNumber": "5594", "text": "Narrated `Ali: the Prophet (ﷺ) forbade the use of Ad-Dubba' and Al Muzaffat. A'mash also narrated this.", "grade": "Sahih", "narratedBy": "Narrated `Ali:", "reference": "https://sunnah.com/bukhari:5594", "inBookReference": "Book 74, Hadith 20"}, {"id": 21, "hadithNumber": "5595", "text": "Narrated Ibrahim: I asked Al-Aswad, \"Did you ask `Aisha, Mother of the Believers, about the containers in which it is \ndisliked to prepare (non-alcoholic) drinks?\" He said, \"Yes, I said to her, 'O Mother of the Believers! \nWhat containers did the Prophet (ﷺ) forbid to use for preparing (non-alcoholic) drinks?\" She said, 'The \nProphet forbade us, (his family), to prepare (nonalcoholic) drinks in Ad-Dubba and Al-Muzaffat.' I \nasked, 'Didn't you mention Al Jar and Al Hantam?' She said, 'I tell what I have heard; shall I tell you \nwhat I have not heard?' \"", "grade": "Sahih", "narratedBy": "Narrated Ibrahim:", "reference": "https://sunnah.com/bukhari:5595", "inBookReference": "Book 74, Hadith 21"}, {"id": 22, "hadithNumber": "5596", "text": "Narrated Ash-Shaibani: I heard `Abdullah bin Abi `Aufa saying, \"The Prophet (ﷺ) forbade the use of green jars.\" I said, \"Shall we \ndrink out of white jars?\" He said, \"No.\"", "grade": "Sahih", "narratedBy": "Narrated Ash-Shaibani:", "reference": "https://sunnah.com/bukhari:5596", "inBookReference": "Book 74, Hadith 22"}, {"id": 23, "hadithNumber": "5597", "text": "Narrated Sahl bin Sa`d: Abu Usaid As Sa`idi invited the Prophet (ﷺ) to his wedding banquet. At that time his wife was serving \nthem and she was the bride. She said, ''Do you know what (kind of syrup) I soaked (made) for Allah's \nApostle? I soaked some dates in water in a Tur (bowl) overnight. '", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Sa`d:", "reference": "https://sunnah.com/bukhari:5597", "inBookReference": "Book 74, Hadith 23"}, {"id": 24, "hadithNumber": "5598", "text": "Narrated Abu Al-Juwairiyya: I asked Ibn `Abbas about Al-Badhaq. He said, \"Muhammad prohibited alcoholic drinks before It was \ncalled Al-Badhaq (by saying), 'Any drink that intoxicates is unlawful.' I said, 'What about good lawful \ndrinks?' He said,'Apart from what is lawful and good, all other things are unlawful and not good \n(unclean Al-Khabith).", "grade": "Sahih", "narratedBy": "Narrated Abu Al-Juwairiyya:", "reference": "https://sunnah.com/bukhari:5598", "inBookReference": "Book 74, Hadith 24"}, {"id": 25, "hadithNumber": "5599", "text": "Narrated `Aisha: The Prophet (ﷺ) used to like sweet edible things and honey.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:5599", "inBookReference": "Book 74, Hadith 25"}, {"id": 26, "hadithNumber": "5600", "text": "Narrated Anas: While I was serving Abu Talha. Abu Dujana and Abu Suhail bin Al-Baida' with a drink made from a \nmixture of unripe and ripe dates, alcoholic drinks, were made unlawful, whereupon I threw it away, \nand I was their butler and the youngest of them, and we used to consider that drink as an alcoholic \ndrink in those days.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:5600", "inBookReference": "Book 74, Hadith 26"}, {"id": 27, "hadithNumber": "5601", "text": "Narrated Jabir: The Prophet (ﷺ) forbade the drinking of alcoholic drinks prepared from raisins, dates, unripe dates and \nfresh ripe dates.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:5601", "inBookReference": "Book 74, Hadith 27"}, {"id": 28, "hadithNumber": "5602", "text": "Narrated Abu Qatada: The Prophet (ﷺ) forbade the mixing of ripe and unripe dates and also the mixing of dates and raisins (for \npreparing a syrup) but the syrup of each kind of fruit should be prepared separately. ( One may have \nsuch drinks as long as it is fresh )", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:5602", "inBookReference": "Book 74, Hadith 28"}, {"id": 29, "hadithNumber": "5603", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) was presented a bowl of milk and a bowl of wine on the night he was taken on a \njourney (Al-Mi'raj).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:5603", "inBookReference": "Book 74, Hadith 29"}, {"id": 30, "hadithNumber": "5604", "text": "Narrated Um Al-Fadl: The people doubted whether Allah's Messenger (ﷺ) was fasting or the Day of `Arafat or not. So I sent a cup \ncontaining milk to him and he drank it.", "grade": "Sahih", "narratedBy": "Narrated Um Al-Fadl:", "reference": "https://sunnah.com/bukhari:5604", "inBookReference": "Book 74, Hadith 30"}, {"id": 31, "hadithNumber": "5605", "text": "Narrated Jabir bin `Abdullah: Abu Humaid brought a cup of mix from a place called Al-Naqi. Allah's Messenger (ﷺ) said to him, \"Will you \nnot cover it, even by placing a stick across its\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:5605", "inBookReference": "Book 74, Hadith 31"}, {"id": 32, "hadithNumber": "5606", "text": "Narrated Jabir: Abu Humaid, an Ansari man, came from AnNaqi carrying a cup of milk to the Prophet. The Prophet (ﷺ) \nsaid, \"Will you not cover it even by placing a stick across it?\"", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:5606", "inBookReference": "Book 74, Hadith 32"}, {"id": 33, "hadithNumber": "5607", "text": "Narrated Al-Bara: The Prophet (ﷺ) came from Mecca with Abu Bakr. Abu Bakr said \"We passed by a shepherd and at that \ntime Allah's Messenger (ﷺ) was thirsty. I milked a little milk in a bowl and Allah's Messenger (ﷺ) drank till I was \npleased. Suraqa bin Ju'shum came to us riding a horse (chasing us). The Prophet (ﷺ) invoked evil upon \nhim, whereupon Suraqa requested him not to invoke evil upon him, in which case he would go back. \nThe Prophet (ﷺ) agreed.", "grade": "Sahih", "narratedBy": "Narrated Al-Bara:", "reference": "https://sunnah.com/bukhari:5607", "inBookReference": "Book 74, Hadith 33"}, {"id": 34, "hadithNumber": "5608", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"The best object of charity is a she-camel which has (newly) given birth and \ngives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its \nmilk by milking one bowl in the morning and one in the evening.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:5608", "inBookReference": "Book 74, Hadith 34"}, {"id": 35, "hadithNumber": "5609", "text": "Narrated Ibn `Abbas: Allah's Messenger (ﷺ) drank milk and then rinsed his mouth and said, \"It contains fat.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:5609", "inBookReference": "Book 74, Hadith 35"}, {"id": 36, "hadithNumber": "5610", "text": "The Prophet (ﷺ) added: I was raised to the Lote Tree and saw four rivers, two of which were coming out and two going in. \nThose which were coming out were the Nile and the Euphrates, and those which were going in were two rivers in paradise. Then I was given three bowls, one containing milk, and another containing honey, and a third containing wine. I took the bowl containing milk and drank it. It was said to me, \"You and your followers will be on the right path (of Islam).\"", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:5610", "inBookReference": "Book 74, Hadith 36"}, {"id": 37, "hadithNumber": "5611", "text": "Narrated Anas bin Malik: Abu Talha had the largest number of datepalms from amongst the Ansars of Medina. The dearest of \nhis property to him was Bairuha garden which was facing the (Prophet's) Mosque. Allah's Messenger (ﷺ) \nused to enter it and drink of its good fresh water. When the Holy Verse:-- 'By no means shall you \nattain righteousness unless you spend (in charity) of that which you love.' (3.92) was revealed, Abu \nTalha got up and said, \"O Allah's Messenger (ﷺ)! Allah says: By no means shall you attain righteousness \nunless you spend of that which you love,' and the dearest of my property to me is the Bairuha garden \nand I want to give it in charity in Allah's Cause, seeking to be rewarded by Allah for that. So you can \nspend it, O Allah's Messenger (ﷺ), where-ever Allah instructs you. ' Allah s Apostle said, \"Good! That is a \nperishable (or profitable) wealth\" (`Abdullah is in doubt as to which word was used.) He said, \"I have \nheard what you have said but in my opinion you'd better give it to your kith and kin.\" On that Abu \nTalha said, \"I will do so, O Allah's Messenger (ﷺ)!\" Abu Talha distributed that garden among his kith and kin \nand cousins.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:5611", "inBookReference": "Book 74, Hadith 37"}, {"id": 38, "hadithNumber": "5612", "text": "Narrated Anas bin Malik: I saw Allah's Messenger (ﷺ) drinking milk. He came to my house and I milked a sheep and then mixed the \nmilk with water from the well for Allah's Messenger (ﷺ). He took the bowl and drank while on his left there \nwas sitting Abu Bakr, and on his right there was a bedouin. He then gave the remaining milk to the \nbedouin and said, \"The right! The right (first).", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:5612", "inBookReference": "Book 74, Hadith 38"}, {"id": 39, "hadithNumber": "5613", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) and one of his companions entered upon an Ansari man and the Prophet (ﷺ) said to him, \n\"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting \nour mouth in it.\" The man was watering his garden then. He said, \"O Allah's Messenger (ﷺ)! I have water \nkept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and \nmilked a domestic goat of his in it. Allah's Messenger (ﷺ) drank, and then the man who had come along with \nhim, drank.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:5613", "inBookReference": "Book 74, Hadith 39"}, {"id": 40, "hadithNumber": "5614", "text": "Narrated `Aisha: The Prophet (ﷺ) used to like sweet edible things (syrup, etc.) and honey.", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:5614", "inBookReference": "Book 74, Hadith 40"}, {"id": 41, "hadithNumber": "5615", "text": "Narrated An-Nazzal: Ali came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and \r\nsaid, \"Some people dislike to drink while standing, but I saw the Prophet (ﷺ) doing (drinking water) as \r\nyou have seen me doing now.\"", "grade": "Sahih", "narratedBy": "Narrated An-Nazzal:", "reference": "https://sunnah.com/bukhari:5615", "inBookReference": "Book 74, Hadith 41"}, {"id": 42, "hadithNumber": "5616", "text": "Narrated An-Nazzal bin Sabra: `Ali offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order \nto deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him \nand he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining \nwater while he was standing. and said, \"Some people dislike to drink water while standing thought the \nProphet did as I have just done.\"", "grade": "Sahih", "narratedBy": "Narrated An-Nazzal bin Sabra:", "reference": "https://sunnah.com/bukhari:5616", "inBookReference": "Book 74, Hadith 42"}, {"id": 43, "hadithNumber": "5617", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) drank Zamzam (water) while standing.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:5617", "inBookReference": "Book 74, Hadith 43"}, {"id": 44, "hadithNumber": "5618", "text": "Narrated Um Al-Fadl: (daughter of Al-Harith) that she sent a bowl of milk to the Prophet (ﷺ) while he was standing (at `Arafat) \nin the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The \nProphet was on the back of his camel.", "grade": "Sahih", "narratedBy": "Narrated Um Al-Fadl:", "reference": "https://sunnah.com/bukhari:5618", "inBookReference": "Book 74, Hadith 44"}, {"id": 45, "hadithNumber": "5619", "text": "Narrated Anas bin Malik: Milk mixed with water was brought to Allah's Messenger (ﷺ) while a bedouin was on his right and Abu Bakr \nwas on his left. He drank (of it) and then gave (it) to the bedouin and said, 'The right\" \"The right \n(first).", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:5619", "inBookReference": "Book 74, Hadith 45"}, {"id": 46, "hadithNumber": "5620", "text": "Narrated Sahl bin Sa`d: Allah's Messenger (ﷺ) was offered something to drink. He drank of it while on his right was a boy and on his \nleft were some elderly people. He said to the boy, \"May I give these (elderly) people first?\" The boy \nsaid, \"By Allah, O Allah's Messenger (ﷺ)! I will not give up my share from you to somebody else.\" On that \nAllah's Messenger (ﷺ) placed the cup in the hand of that boy.", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Sa`d:", "reference": "https://sunnah.com/bukhari:5620", "inBookReference": "Book 74, Hadith 46"}, {"id": 47, "hadithNumber": "5621", "text": "Narrated Jabir bin `Abdullah: The Prophet (ﷺ) and one of his companions entered upon an Ansari man. The Prophet (ﷺ) and his companion \ngreeted (the man) and he replied, \"O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! \nIt is hot,\" while he was watering his garden. The Prophet (ﷺ) asked him, \"If you have water kept overnight \nin a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was \nwatering the garden The man said, \"O Allah's Messenger (ﷺ)! I have water kept overnight in a water-skin. He \nwent to the shade and poured some water into a bowl and milked some milk from a domestic goat in \nit. The Prophet (ﷺ) drank and then gave the bowl to the man who had come along with him to drink.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:5621", "inBookReference": "Book 74, Hadith 47"}, {"id": 48, "hadithNumber": "5622", "text": "Narrated Anas: I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the \nyoungest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to \nme), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was \n(made from), He replied, \"(From) ripe dates and unripe dates.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:5622", "inBookReference": "Book 74, Hadith 48"}, {"id": 49, "hadithNumber": "5623", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) said, \"When night falls (or when it is evening), stop your children from going out, for \nthe devils spread out at that time. But when an hour of the night has passed, release them and close the \ndoors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin \nand mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover \nthem even by placing something across it, and extinguish your lamps. \"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:5623", "inBookReference": "Book 74, Hadith 49"}, {"id": 50, "hadithNumber": "5624", "text": "Narrated Jabir: Allah's Messenger (ﷺ) said, \"Extinguish the lamps when you go to bed; close your doors; tie the mouths of \nyour water skins, and cover the food and drinks.\" I think he added, \". . . even with a stick you place \nacross the container.\"", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:5624", "inBookReference": "Book 74, Hadith 50"}, {"id": 51, "hadithNumber": "5625", "text": "Narrated Abu Sa`id Al-Khudri: Allah's Messenger (ﷺ) forbade the bending of the mouths of water skins for the sake of drinking from them.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:5625", "inBookReference": "Book 74, Hadith 51"}, {"id": 52, "hadithNumber": "5626", "text": "Narrated Abu Sa`id Al-Khudri: I heard Allah's Messenger (ﷺ) forbidding the drinking of water by bending the mouths of water skins, i.e., \ndrinking from the mouths directly.", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:5626", "inBookReference": "Book 74, Hadith 52"}, {"id": 53, "hadithNumber": "5627", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) forbade drinking directly from the mouth of a water skin or other leather containers. \nand forbade preventing one's neighbor from fixing a peg in (the wall of) one's house.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:5627", "inBookReference": "Book 74, Hadith 53"}, {"id": 54, "hadithNumber": "5628", "text": "Narrated Abu Huraira: The Prophet (ﷺ) forbade the drinking of water directly from the mouth of a water skin .", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:5628", "inBookReference": "Book 74, Hadith 54"}, {"id": 55, "hadithNumber": "5629", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) forbade the drinking of water direct from the mouth of a water-skin.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:5629", "inBookReference": "Book 74, Hadith 55"}, {"id": 56, "hadithNumber": "5630", "text": "Narrated Abu Qatada: Allah's Messenger (ﷺ) said, \"When you drink (water), do not breath in the vessel; and when you urinate, do \nnot touch your penis with your right hand. And when you cleanse yourself after defecation, do not use \nyour right hand.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:5630", "inBookReference": "Book 74, Hadith 56"}, {"id": 57, "hadithNumber": "5631", "text": "Narrated Thumama bin `Abdullah: Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; \nused to take three breaths while drinking.", "grade": "Sahih", "narratedBy": "Narrated Thumama bin `Abdullah:", "reference": "https://sunnah.com/bukhari:5631", "inBookReference": "Book 74, Hadith 57"}, {"id": 58, "hadithNumber": "5632", "text": "Narrated Ibn Abi Laila: While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver \nvessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he \nhas not stopped using it. The Prophet (ﷺ) forbade us to wear clothes of silk or Dibaj, and to drink in gold \nor silver utensils, and said, 'These things are for them (unbelievers) in this world and for you \n(Muslims) in the Hereafter.' \"", "grade": "Sahih", "narratedBy": "Narrated Ibn Abi Laila:", "reference": "https://sunnah.com/bukhari:5632", "inBookReference": "Book 74, Hadith 58"}, {"id": 59, "hadithNumber": "5633", "text": "Narrated Hudhaifa: The Prophet (ﷺ) said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for \nthese things are for them (unbelievers) in this world and for you in the Hereafter.\"", "grade": "Sahih", "narratedBy": "Narrated Hudhaifa:", "reference": "https://sunnah.com/bukhari:5633", "inBookReference": "Book 74, Hadith 59"}, {"id": 60, "hadithNumber": "5634", "text": "Narrated Um Salama: (the wife of the Prophet) Allah's Messenger (ﷺ) said, \"He who drinks in silver utensils is only filling his \n`Abdomen with Hell Fire.\"", "grade": "Sahih", "narratedBy": "Narrated Um Salama:", "reference": "https://sunnah.com/bukhari:5634", "inBookReference": "Book 74, Hadith 60"}, {"id": 61, "hadithNumber": "5635", "text": "Narrated Al-Bara' bin `Azib: Allah's Messenger (ﷺ) ordered us to do seven things and forbade us from seven. He ordered us to visit the \nsick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he \nsays, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help \nothers to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use \nMayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, \nDibaj or Istabraq (two kinds of silk).", "grade": "Sahih", "narratedBy": "Narrated Al-Bara' bin `Azib:", "reference": "https://sunnah.com/bukhari:5635", "inBookReference": "Book 74, Hadith 61"}, {"id": 62, "hadithNumber": "5636", "text": "Narrated Um Al-Fadl: that the people were in doubt whether the Prophet (ﷺ) was fasting on the Day of `Arafat or not, so a \n(wooden) drinking vessel full of milk was sent to him, and he drank it.", "grade": "Sahih", "narratedBy": "Narrated Um Al-Fadl:", "reference": "https://sunnah.com/bukhari:5636", "inBookReference": "Book 74, Hadith 62"}, {"id": 63, "hadithNumber": "5637", "text": "Narrated Sahl bin Sa`d: An Arab lady was mentioned to the Prophet (ﷺ) so he asked Abu Usaid As-Sa`idi to send for her, and he \nsent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet (ﷺ) came out and went to \nher and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet (ﷺ) spoke \nto her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said \nto her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Messenger (ﷺ) who has come \nto command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the \nProphet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give \nus water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: \nSahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul \n`Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.", "grade": "Sahih", "narratedBy": "Narrated Sahl bin Sa`d:", "reference": "https://sunnah.com/bukhari:5637", "inBookReference": "Book 74, Hadith 63"}, {"id": 64, "hadithNumber": "5638", "text": "Narrated `Asim al-Ahwal: I saw the drinking bowl of the Prophet (ﷺ) with Anas bin Malik, and it had been broken, and he had \nmended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \n\"I gave water to the Prophet (ﷺ) in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: \nAround that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but \nAbu Talha said to him, \"Do not change a thing that Allah's Messenger (ﷺ) has made.\" So Anas left it as it \nwas.", "grade": "Sahih", "narratedBy": "Narrated `Asim al-Ahwal:", "reference": "https://sunnah.com/bukhari:5638", "inBookReference": "Book 74, Hadith 64"}, {"id": 65, "hadithNumber": "5639", "text": "Narrated Jabir bin `Abdullah: I was with the Prophet (ﷺ) and the time for the `Asr prayer became due. We had no water with us except a \nlittle which was put in a vessel and was brought to the Prophet (ﷺ) . He put his hand into it and spread out \nhis fingers and then said, \"Come along! Hurry up! All those who want to perform ablution. The \nblessing is from Allah.'' I saw the water gushing out from his fingers. So the people performed the \nablution and drank, and I tried to drink more of that water (beyond my thirst and capacity), for I knew \nthat it was a blessing. The sub-narrator said: I asked Jabir, \"How many persons were you then?\" He \nreplied, \"We were one-thousand four hundred men.\" Salim said: Jabir said, 1500.", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:5639", "inBookReference": "Book 74, Hadith 65"}]}