{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 89, "bookName": "Chapter: Whoever preferred to be beaten killed and humiliated rather than to revert to Kufr", "hadiths": [{"id": 1, "hadithNumber": "6940", "text": "Narrated Abi Huraira: The Prophet (ﷺ) used to invoke Allah in his prayer, \"O Allah! Save `Aiyash bin Abi Rabi`a and Salama \nbin Hisham and Al-Walid bin Al-Walid; O Allah! Save the weak among the believers; O Allah! Be \nhard upon the tribe of Mudar and inflict years (of famine) upon them like the (famine) years of \nJoseph.\"", "grade": "Sahih", "narratedBy": "Narrated Abi Huraira:", "reference": "https://sunnah.com/bukhari:6940", "inBookReference": "Book 89, Hadith 1"}, {"id": 2, "hadithNumber": "6941", "text": "Narrated Anas: Allah's Messenger (ﷺ) said, \"Whoever possesses the (following) three qualities will have the sweetness of \nfaith (1): The one to whom Allah and His Apostle becomes dearer than anything else; (2) Who loves a \nperson and he loves him only for Allah's Sake; (3) who hates to revert to atheism (disbelief) as he \nhates to be thrown into the Fire.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:6941", "inBookReference": "Book 89, Hadith 2"}, {"id": 3, "hadithNumber": "6942", "text": "Narrated Qais: I heard Sa`id bin Zaid saying, \"I have seen myself tied and forced by `Umar to leave Islam (Before \n`Umar himself embraced Islam). And if the mountain of Uhud were to collapse for the evil which you \npeople had done to `Uthman, then Uhud would have the right to do so.\" (See Hadith No. 202, Vol. 5)", "grade": "Sahih", "narratedBy": "Narrated Qais:", "reference": "https://sunnah.com/bukhari:6942", "inBookReference": "Book 89, Hadith 3"}, {"id": 4, "hadithNumber": "6943", "text": "Narrated Khabbab bin Al-Art: We complained to Allah's Messenger (ﷺ) (about our state) while he was leaning against his sheet cloak in the \nshade of the Ka`ba. We said, \"Will you ask Allah to help us? Will you invoke Allah for us?\" He said, \n\"Among those who were before you a (believer) used to be seized and, a pit used to be dug for him \nand then he used to be placed in it. Then a saw used to be brought and put on his head which would be \nsplit into two halves. His flesh might be combed with iron combs and removed from his bones, yet, all \nthat did not cause him to revert from his religion. By Allah! This religion (Islam) will be completed \n(and triumph) till a rider (traveler) goes from San`a' (the capital of Yemen) to Hadramout fearing \nnobody except Allah and the wolf lest it should trouble his sheep, but you are impatient.\" (See Hadith \nNo. 191, Vol. 5)", "grade": "Sahih", "narratedBy": "Narrated Khabbab bin Al-Art:", "reference": "https://sunnah.com/bukhari:6943", "inBookReference": "Book 89, Hadith 4"}, {"id": 5, "hadithNumber": "6944", "text": "Narrated Abu Huraira: While we were in the mosque, Allah's Messenger (ﷺ) came out to us and said, \"Let us proceed to the Jews.\" \nSo we went along with him till we reached Bait-al-Midras (a place where the Torah used to be recited \nand all the Jews of the town used to gather). The Prophet (ﷺ) stood up and addressed them, \"O Assembly \nof Jews! Embrace Islam and you will be safe!\" The Jews replied, \"O Aba-l-Qasim! You have \nconveyed Allah's message to us.\" The Prophet (ﷺ) said, \"That is what I want (from you).\" He repeated his \nfirst statement for the second time, and they said, \"You have conveyed Allah's message, O Aba-l- \nQasim.\" Then he said it for the third time and added, \"You should Know that the earth belongs to \nAllah and His Apostle, and I want to exile you fro,,, this land, so whoever among you owns some \nproperty, can sell it, otherwise you should know that the Earth belongs to Allah and His Apostle.\" \n(See Hadith No. 392, Vol. 4)", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6944", "inBookReference": "Book 89, Hadith 5"}, {"id": 6, "hadithNumber": "6945", "text": "Narrated Khansa' bint Khidam Al-Ansariya: That her father gave her in marriage when she was a matron and she disliked that marriage. So she \ncame and (complained) to the Prophets and he declared that marriage invalid. (See Hadith No. 69, \nVol. 7)", "grade": "Sahih", "narratedBy": "Narrated Khansa' bint Khidam Al-Ansariya:", "reference": "https://sunnah.com/bukhari:6945", "inBookReference": "Book 89, Hadith 6"}, {"id": 7, "hadithNumber": "6946", "text": "Narrated `Aisha: I asked the Prophet, \"O Allah's Messenger (ﷺ)! Should the women be asked for their consent to their \nmarriage?\" He said, \"Yes.\" I said, \"A virgin, if asked, feels shy and keeps quiet.\" He said, \"Her silence \nmeans her consent.\"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:6946", "inBookReference": "Book 89, Hadith 7"}, {"id": 8, "hadithNumber": "6947", "text": "Narrated Jabir: A man from the Ansar made his slave, a Mudabbar. And apart from that slave he did not have any \nother property. This news reached Allah's Messenger (ﷺ) and he said, \"Who will buy that slave from me?\" So \nNu'aim bin An-Nahham bought him for 800 Dirham. Jabir added: It was a coptic (Egyptian) slave \nwho died that year.", "grade": "Sahih", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/bukhari:6947", "inBookReference": "Book 89, Hadith 8"}, {"id": 9, "hadithNumber": "6948", "text": "Narrated Ibn `Abbas: Regarding the Qur'anic Verse: 'O you who believe! You are forbidden to inherit women against their \nwill.' (4.19) The custom (in the Pre-lslamic Period) was that if a man died, his relatives used to have \nthe right to inherit his wife, and if one of them wished, he could marry her, or they could marry her to \nsomebody else, or prevent her from marrying if they wished, for they had more right to dispose of her \nthan her own relatives. Therefore this Verse was revealed concerning this matter.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:6948", "inBookReference": "Book 89, Hadith 9"}, {"id": 10, "hadithNumber": "6949", "text": "And Safiyya bint 'Ubaid said: \"A governmental male-slave tried to seduce a slave-girl from the Khumus of the war booty till he deflowered her by force against her will; therefore 'Umar flogged him according to the law, and exiled him, but he did not flog the female slave because the male-slave had committed illegal sexual intercourse by force, against her will.\"\n\nAz-Zuhri said regarding a virgin slave-girl raped by a free man: The judge has to fine the adulterer as much money as is equal to the price of the female slave and the adulterer has to be flogged (according to the Islamic Law); but if the slave woman is a matron, then, according to the verdict of the Imam, the adulterer is not fined but he has to receive the legal punishment (according to the Islamic Law).", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:6949", "inBookReference": "Book 89, Hadith 10"}, {"id": 11, "hadithNumber": "6950", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"(The Prophet) Abraham migrated with his wife Sarah till he reached a town \nwhere there was a king or a tyrant who sent a message, to Abraham, ordering him to send Sarah to \nhim. So when Abraham had sent Sarah, the tyrant got up, intending to do evil with her, but she got up \nand performed ablution and prayed and said, 'O Allah ! If I have believed in You and in Your Apostle, \nthen do not empower this oppressor over me.' So he (the king) had an epileptic fit and started moving \nhis legs violently. \"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6950", "inBookReference": "Book 89, Hadith 11"}, {"id": 12, "hadithNumber": "6951", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim. So he should neither oppress him nor \nhand him over to an oppressor. And whoever fulfilled the needs of his brother, Allah will fulfill his \nneeds.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:6951", "inBookReference": "Book 89, Hadith 12"}, {"id": 13, "hadithNumber": "6952", "text": "Narrated Anas: Allah's Messenger (ﷺ) said, \"Help your brother whether he is an oppressor or an oppressed,\" A man said, \"O \nAllah's Messenger (ﷺ)! I will help him if he is oppressed, but if he is an oppressor, how shall I help him?\" \nThe Prophet (ﷺ) said, \"By preventing him from oppressing (others), for that is how to help him.\"", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:6952", "inBookReference": "Book 89, Hadith 13"}]}