{"collection": "bukhari", "collectionName": "Sahih al-Bukhari", "book": 91, "bookName": "Chapter: Commencement of the Divine Revelation to Allah’s Messenger (saws)  was in the form of good dreams", "hadiths": [{"id": 1, "hadithNumber": "6982", "text": "Narrated `Aisha: The commencement of the Divine Inspiration to Allah's Messenger (ﷺ) was in the form of good righteous \n(true) dreams in his sleep. He never had a dream but that it came true like bright day light. He used to \ngo in seclusion (the cave of) Hira where he used to worship(Allah Alone) continuously for many \n(days) nights. He used to take with him the journey food for that (stay) and then come back to (his \nwife) Khadija to take his food like-wise again for another period to stay, till suddenly the Truth \ndescended upon him while he was in the cave of Hira. The angel came to him in it and asked him to \nread. The Prophet (ﷺ) replied, \"I do not know how to read.\" (The Prophet (ﷺ) added), \"The angel caught me \n(forcefully) and pressed me so hard that I could not bear it anymore. He then released me and again \nasked me to read, and I replied, \"I do not know how to read,\" whereupon he caught me again and \npressed me a second time till I could not bear it anymore. He then released me and asked me again to \nread, but again I replied, \"I do not know how to read (or, what shall I read?).\" Thereupon he caught \nme for the third time and pressed me and then released me and said, \"Read: In the Name of your Lord, \nWho has created (all that exists). Has created man from a clot. Read and Your Lord is Most \nGenerous...up to..... ..that which he knew not.\" (96.15) \nThen Allah's Messenger (ﷺ) returned with the Inspiration, his neck muscles twitching with terror till he \nentered upon Khadija and said, \"Cover me! Cover me!\" They covered him till his fear was over and \nthen he said, \"O Khadija, what is wrong with me?\" Then he told her everything that had happened and \nsaid, 'I fear that something may happen to me.\" Khadija said, 'Never! But have the glad tidings, for by \nAllah, Allah will never disgrace you as you keep good reactions with your Kith and kin, speak the \ntruth, help the poor and the destitute, serve your guest generously and assist the deserving, calamityafflicted \nones.\" Khadija then accompanied him to (her cousin) Waraqa bin Naufal bin Asad bin \n`Abdul `Uzza bin Qusai. Waraqa was the son of her paternal uncle, i.e., her father's brother, who \nduring the Pre-Islamic Period became a Christian and used to write the Arabic writing and used to \nwrite of the Gospels in Arabic as much as Allah wished him to write. He was an old man and had lost \nhis eyesight. Khadija said to him, \"O my cousin! Listen to the story of your nephew.\" Waraqa asked, \n\"O my nephew! What have you seen?\" The Prophet (ﷺ) described whatever he had seen. \nWaraqa said, \"This is the same Namus (i.e., Gabriel, the Angel who keeps the secrets) whom Allah \nhad sent to Moses. I wish I were young and could live up to the time when your people would turn \nyou out.\" Allah's Messenger (ﷺ) asked, \"Will they turn me out?\" Waraqa replied in the affirmative and said: \n\"Never did a man come with something similar to what you have brought but was treated with \nhostility. If I should remain alive till the day when you will be turned out then I would support you \nstrongly.\" But after a few days Waraqa died and the Divine Inspiration was also paused for a while \nand the Prophet (ﷺ) became so sad as we have heard that he intended several times to throw himself from \nthe tops of high mountains and every time he went up the top of a mountain in order to throw himself \ndown, Gabriel would appear before him and say, \"O Muhammad! You are indeed Allah's Messenger (ﷺ) in \ntruth\" whereupon his heart would become quiet and he would calm down and would return home. And \nwhenever the period of the coming of the inspiration used to become long, he would do as before, but \nwhen he used to reach the top of a mountain, Gabriel would appear before him and say to him what he \nhad said before. (Ibn `Abbas said regarding the meaning of: 'He it is that Cleaves the daybreak (from \nthe darkness)' (6.96) that Al-Asbah. means the light of the sun during the day and the light of the \nmoon at night).", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:6982", "inBookReference": "Book 91, Hadith 1"}, {"id": 2, "hadithNumber": "6983", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) said, \"A good dream (that comes true) of a righteous man is one of forty-six parts of \nprophetism.\"", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:6983", "inBookReference": "Book 91, Hadith 2"}, {"id": 3, "hadithNumber": "6984", "text": "Narrated Abu Qatada: The Prophet (ﷺ) said, \"A true good dream is from Allah, and a bad dream is from Satan.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:6984", "inBookReference": "Book 91, Hadith 3"}, {"id": 4, "hadithNumber": "6985", "text": "Narrated Abu Sa`id Al-Khudri: The Prophet (ﷺ) said, \"If anyone of you sees a dream that he likes, then it is from Allah, and he should \nthank Allah for it and narrate it to others; but if he sees something else, i.e., a dream that he dislikes, \nthen it is from Satan, and he should seek refuge with Allah from its evil, and he should not mention it \nto anybody, for it will not harm him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:6985", "inBookReference": "Book 91, Hadith 4"}, {"id": 5, "hadithNumber": "6986", "text": "Narrated Abu Qatada: The Prophet (ﷺ) said, \"A good dream that comes true is from Allah, and a bad dream is from Satan, so if \nanyone of you sees a bad dream, he should seek refuge with Allah from Satan and should spit on the \nleft, for the bad dream will not harm him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:6986", "inBookReference": "Book 91, Hadith 5"}, {"id": 6, "hadithNumber": "6987", "text": "Narrated 'Ubada bin As-Samit: The Prophet (ﷺ) said, \"The (good) dreams of a faithful believer is a part of the forty-six parts of \nprophetism:'", "grade": "Sahih", "narratedBy": "Narrated 'Ubada bin As-Samit:", "reference": "https://sunnah.com/bukhari:6987", "inBookReference": "Book 91, Hadith 6"}, {"id": 7, "hadithNumber": "6988", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"The (good) dream of a faithful believer is a part of the forty-six parts of \nprophetism.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6988", "inBookReference": "Book 91, Hadith 7"}, {"id": 8, "hadithNumber": "6989", "text": "Narrated Abu Sa`id Al-Khudri: I heard Allah's Messenger (ﷺ) saying, \"A good dream is a part of the forty six parts of prophetism.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:6989", "inBookReference": "Book 91, Hadith 8"}, {"id": 9, "hadithNumber": "6990", "text": "Narrated Abu Huraira: I heard Allah's Messenger (ﷺ) saying, \"Nothing is left of the prophetism except Al-Mubashshirat.\" They \nasked, \"What are Al-Mubashshirat?\" He replied, \"The true good dreams (that conveys glad tidings).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6990", "inBookReference": "Book 91, Hadith 9"}, {"id": 10, "hadithNumber": "6991", "text": "Narrated Ibn `Umar: Some people were shown the Night of Qadr as being in the last seven days (of the month of \nRamadan). The Prophet (ﷺ) said, \"Seek it in the last seven days (of Ramadan).", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:6991", "inBookReference": "Book 91, Hadith 10"}, {"id": 11, "hadithNumber": "6992", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"If I stayed in prison as long as Joseph stayed and then the messenger came, I \nwould respond to his call (to go out of the prison) .\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6992", "inBookReference": "Book 91, Hadith 11"}, {"id": 12, "hadithNumber": "6993", "text": "Narrated Abu Huraira: I heard the Prophet (ﷺ) saying, \"Whoever sees me in a dream will see me in his wakefulness, and Satan \ncannot imitate me in shape.\" Abu `Abdullah said, \"Ibn Seereen said, 'Only if he sees the Prophet (ﷺ) in his \n(real) shape.'\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6993", "inBookReference": "Book 91, Hadith 12"}, {"id": 13, "hadithNumber": "6994", "text": "Narrated Anas: The Prophet (ﷺ) said, \"Whoever has seen me in a dream, then no doubt, he has seen me, for Satan cannot \nimitate my shape.", "grade": "Sahih", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/bukhari:6994", "inBookReference": "Book 91, Hadith 13"}, {"id": 14, "hadithNumber": "6995", "text": "Narrated Abu Qatada: The Prophet (ﷺ) said, \"A good dream is from Allah, and a bad dream is from Satan. So whoever has seen \n(in a dream) something he dislikes, then he should spit without saliva, thrice on his left and seek refuge \nwith Allah from Satan, for it will not harm him, and Satan cannot appear in my shape.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:6995", "inBookReference": "Book 91, Hadith 14"}, {"id": 15, "hadithNumber": "6996", "text": "Narrated Abu Qatada: The Prophet (ﷺ) said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada:", "reference": "https://sunnah.com/bukhari:6996", "inBookReference": "Book 91, Hadith 15"}, {"id": 16, "hadithNumber": "6997", "text": "Narrated Abu Sa`id Al-Khudri: The Prophet (ﷺ) said, \"Who ever sees me (in a dream) then he indeed has seen the truth, as Satan cannot \nappear in my shape.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:6997", "inBookReference": "Book 91, Hadith 16"}, {"id": 17, "hadithNumber": "6998", "text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"I have been given the keys of eloquent speech and given victory with awe (cast \ninto the hearts of the enemy), and while I was sleeping last night, the keys of the treasures of the earth \nwere brought to me till they were put in my hand.\" Abu Huraira added: Allah's Messenger (ﷺ) left (this \nworld) and now you people are carrying those treasures from place to place.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:6998", "inBookReference": "Book 91, Hadith 17"}, {"id": 18, "hadithNumber": "6999", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"I saw myself (in a dream) near the Ka`ba last night, and I saw a man with \nwhitish red complexion, the best you may see amongst men of that complexion having long hair \nreaching his earlobes which was the best hair of its sort, and he had combed his hair and water was \ndropping from it, and he was performing the Tawaf around the Ka`ba while he was leaning on two \nmen or on the shoulders of two men. I asked, 'Who is this man?' Somebody replied, '(He is) Messiah, \nson of Mary.' Then I saw another man with very curly hair, blind in the right eye which looked like a \nprotruding out grape. I asked, 'Who is this?' Somebody replied, '(He is) Messiah, Ad-Dajjal.'\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:6999", "inBookReference": "Book 91, Hadith 18"}, {"id": 19, "hadithNumber": "7000", "text": "Narrated Ibn `Abbas: About a man who came to Allah's Messenger (ﷺ) and said, \"I was shown in a dream last night...\" Then Ibn \n`Abbas mentioned the narration.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:7000", "inBookReference": "Book 91, Hadith 19"}, {"id": 20, "hadithNumber": "7001", "text": "Narrated Anas bin Malik: Allah's Messenger (ﷺ) used to visit Um Haram bint Milhan she was the wife of 'Ubada bin As-Samit. One \nday the Prophet (ﷺ) visited her and she provided him with food and started looking for lice in his head. \nThen Allah's Messenger (ﷺ) slept and afterwards woke up smiling. Um Haram asked, \"What makes you \nsmile, O Allah's Messenger (ﷺ)?\" He said, \"Some of my followers were presented before me in my dream as \nfighters in Allah's Cause, sailing in the middle of the seas like kings on the thrones or like kings sitting \non their thrones.\" (The narrator 'Is-haq is not sure as to which expression was correct). Um Haram \nadded, 'I said, \"O Allah's Messenger (ﷺ)! Invoke Allah, to make me one of them;\" So Allah's Messenger (ﷺ) \ninvoked Allah for her and then laid his head down (and slept). Then he woke up smiling (again). (Um \nHaram added): I said, \"What makes you smile, O Allah's Messenger (ﷺ)?\" He said, \"Some people of my \nfollowers were presented before me (in a dream) as fighters in Allah's Cause.\" He said the same as he \nhad said before. I said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me from them.\" He said, \"You are \namong the first ones.\" Then Um Haram sailed over the sea during the Caliphate of Muawiya bin Abu \nSufyan, and she fell down from her riding animal after coming ashore, and died.", "grade": "Sahih", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/bukhari:7001", "inBookReference": "Book 91, Hadith 20"}, {"id": 21, "hadithNumber": "7003", "text": "Narrated Kharija bin Zaid bin Thabit: Um Al-`Ala an Ansari woman who had given a pledge of allegiance to Allah's Messenger (ﷺ) told me:, \"The \nMuhajirln (emigrants) were distributed amongst us by drawing lots, and we got `Uthman bin Maz'un \nin our share. We made him stay with us in our house. Then he suffered from a disease which proved \nfatal. When he died and was given a bath and was shrouded in his clothes. Allah's Messenger (ﷺ) came, I \nsaid, (addressing the dead body), 'O Aba As-Sa'ib! May Allah be Merciful to you! I testify that Allah \nhas honored you.' Allah's Messenger (ﷺ) said, 'How do you know that Allah has honored him?\" I replied, 'Let \nmy father be sacrificed for you, O Allah's Messenger (ﷺ)! On whom else shall Allah bestow. His honor?' \nAllah's Messenger (ﷺ) said, 'As for him, by Allah, death has come to him. By Allah, I wish him all good \n(from Allah). By Allah, in spite of the fact that I am Allah's Messenger (ﷺ), I do not know what Allah will do \nto me.\", Um Al-`Ala added, \"By Allah, I will never attest the righteousness of anybody after that.\"", "grade": "Sahih", "narratedBy": "Narrated Kharija bin Zaid bin Thabit:", "reference": "https://sunnah.com/bukhari:7003", "inBookReference": "Book 91, Hadith 21"}, {"id": 22, "hadithNumber": "7004", "text": "Narrated Az-Zuhri: Regarding the above narration, The Prophet (ﷺ) said, \"I do not know what Allah will do to him (Uthman \nbin Maz'un).\" Um Al-`Ala said, \"I felt very sorry for that, and then I slept and saw in a dream a \nflowing spring for `Uthman bin Maz'un, and told Allah's Messenger (ﷺ) of that, and he said, \"That flowing \nspring symbolizes his good deeds.\"", "grade": "Sahih", "narratedBy": "Narrated Az-Zuhri:", "reference": "https://sunnah.com/bukhari:7004", "inBookReference": "Book 91, Hadith 22"}, {"id": 23, "hadithNumber": "7005", "text": "Narrated Abu Qatada Al-Ansari: (a companion of the Prophet (ﷺ) and one of his cavalry men) \"I heard Allah's Messenger (ﷺ) saying, \"A good \ndream is from Allah, and a bad dream is from Satan; so, if anyone of you had a bad dream which he \ndisliked, then he should spit on his left and seek refuge with Allah from it, for it will not harm him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Qatada Al-Ansari:", "reference": "https://sunnah.com/bukhari:7005", "inBookReference": "Book 91, Hadith 23"}, {"id": 24, "hadithNumber": "7006", "text": "Narrated Ibn `Umar: I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I was given a bowl full of milk (in a dream), \nand I drank of it to my fill until I noticed its wetness coming out of my nails, and then I gave the rest \nof it to `Umar.\" They (the people) asked, \"What have you interpreted (about the dream)? O Allah's \nApostle?\" He said, \"(It is Religious) knowledge.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:7006", "inBookReference": "Book 91, Hadith 24"}, {"id": 25, "hadithNumber": "7007", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"While I was sleeping, I was given a bowl full of milk (in the dream) and I drank \nfrom it (to my fill) till I noticed its wetness coming out of my limbs. Then I gave the rest of it to \n`Umar bin Al-Khattab.\" The persons sitting around him, asked, \"What have you interpreted (about the \ndream) O Allah's Messenger (ﷺ)?\" He said, \"(It is religious) knowledge.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:7007", "inBookReference": "Book 91, Hadith 25"}, {"id": 26, "hadithNumber": "7008", "text": "Narrated Abu Sa`id Al-Khudri: Allah's Messenger (ﷺ) said, \"While I was sleeping, some people were displayed before me (in a dream). They \nwere wearing shirts, some of which were merely covering their breasts, and some a bit longer. Then \nthere passed before me, `Umar bin Al-Khattab wearing a shirt he was dragging it (on the ground \nbehind him.)\" They (the people) asked, \"What have you interpreted (about the dream) O Allah's \nApostle?\" He said, \"The Religion.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:7008", "inBookReference": "Book 91, Hadith 26"}, {"id": 27, "hadithNumber": "7009", "text": "Narrated Abu Sa`id Al-Khudri: I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw (in a dream) the people being displayed \nbefore me, wearing shirts, some of which (were so short that it) reached as far as their breasts and \nsome reached below that. Then `Umar bin Al-Khattab was shown to me and he was wearing a shirt \nwhich he was dragging (behind him).\" They asked. What have you interpreted (about the dream)? O \nAllah's Messenger (ﷺ)?\" He said, \"The religion.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:7009", "inBookReference": "Book 91, Hadith 27"}, {"id": 28, "hadithNumber": "7010", "text": "Narrated Qais bin 'Ubada: I was sitting in a gathering in which there was Sa`d bin Malik and Ibn `Umar. `Abdullah bin Salam \npassed in front of them and they said, \"This man is from the people of Paradise.\" I said to `Abdullah \nbin Salam, \"They said so-and-so.\" He replied, \"Subhan Allah! They ought not to have said things of \nwhich they have no knowledge, but I saw (in a dream) that a post was fixed in a green garden. At the \ntop of the post there was a handhold and below it there was a servant. I was asked to climb (the post). \nSo I climbed it till I got hold of the handhold.\" Then I narrated this dream to Allah's Messenger (ﷺ). Allah's \nApostle said, \"`Abdullah will die while still holding the firm reliable handhold (i.e., Islam).", "grade": "Sahih", "narratedBy": "Narrated Qais bin 'Ubada:", "reference": "https://sunnah.com/bukhari:7010", "inBookReference": "Book 91, Hadith 28"}, {"id": 29, "hadithNumber": "7011", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) said (to me), \"You were shown to me twice in (my) dream. Behold, a man was \ncarrying you in a silken piece of cloth and said to me, \"She is your wife, so uncover her,' and behold, \nit was you. I would then say (to myself), 'If this is from Allah, then it must happen.' \"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:7011", "inBookReference": "Book 91, Hadith 29"}, {"id": 30, "hadithNumber": "7012", "text": "Narrated `Aisha: Allah's Messenger (ﷺ) said to me, \"You were shown to me twice (in my dream) before I married you. I saw \nan angel carrying you in a silken piece of cloth, and I said to him, 'Uncover (her),' and behold, it was \nyou. I said (to myself), 'If this is from Allah, then it must happen.' Then you were shown to me, the \nangel carrying you in a silken piece of cloth, and I said (to him), 'Uncover (her), and behold, it was \nyou. I said (to myself), 'If this is from Allah, then it must happen.' \"", "grade": "Sahih", "narratedBy": "Narrated `Aisha:", "reference": "https://sunnah.com/bukhari:7012", "inBookReference": "Book 91, Hadith 30"}, {"id": 31, "hadithNumber": "7013", "text": "Narrated Abu Huraira: I heard Allah's Messenger (ﷺ) saying, \"I have been sent with Jawami al-Kalim (i.e., the shortest expression carrying the widest meanings), and I was made victorious with awe (cast into the hearts of the enemy), and while I was sleeping, the keys of the treasures of the earth were brought to me and were put in my hand.\" \nMuhammad said, Jawami'-al-Kalim means that Allah expresses in one or two statements or thereabouts the numerous matters that used to be written in the books revealed before (the coming of) the Prophet.", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7013", "inBookReference": "Book 91, Hadith 31"}, {"id": 32, "hadithNumber": "7014", "text": "Narrated `Abdullah bin Salam: (In a dream) I saw myself in a garden, and there was a pillar in the middle of the garden, and there was \na handhold at the top of the pillar. I was asked to climb it. I said, \"I cannot.\" Then a servant came and \nlifted up my clothes and I climbed (the pillar), and then got hold of the handhold, and I woke up while \nstill holding it. I narrated that to the Prophet (ﷺ) who said, \"The garden symbolizes the garden of Islam, \nand the handhold is the firm Islamic handhold which indicates that you will be adhering firmly to \nIslam until you die.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin Salam:", "reference": "https://sunnah.com/bukhari:7014", "inBookReference": "Book 91, Hadith 32"}, {"id": 33, "hadithNumber": "7015", "text": "Narrated Ibn `Umar: I saw in a dream a piece of silken cloth in my hand, and in whatever direction in Paradise I waved it, it \nflew, carrying me there. I narrated this (dream) to (my sister) Hafsa and she told it to the Prophet (ﷺ) who \nsaid, (to Hafsa), \"Indeed, your brother is a righteous man,\" or, \"Indeed, `Abdullah is a righteous man.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:7015", "inBookReference": "Book 91, Hadith 33"}, {"id": 34, "hadithNumber": "7017", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"When the Day of Resurrection approaches, the dreams of a believer will hardly \nfail to come true, and a dream of a believer is one of forty-six parts of prophetism, and whatever \nbelongs to prothetism can never be false.\" Muhammad bin Seereen said, \"But I say this.\" He said, \"It \nused to be said, 'There are three types of dreams: The reflection of one's thoughts and experiences one \nhas during wakefulness, what is suggested by Satan to frighten the dreamer, or glad tidings from \nAllah. So, if someone has a dream which he dislikes, he should not tell it to others, but get up and \noffer a prayer.\" He added, \"He (Abu Huraira) hated to see a Ghul (i.e., iron collar around his neck in a \ndream) and people liked to see fetters (on their feet in a dream). The fetters on the feet symbolizes \none's constant and firm adherence to religion.\" And Abu `Abdullah said, \"Ghuls (iron collars) are used \nonly for necks.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7017", "inBookReference": "Book 91, Hadith 34"}, {"id": 35, "hadithNumber": "7018", "text": "Narrated Kharija bin Zaid bin Thabit: Um Al-`Ala an Ansari woman who had given the Pledge of allegiance to Allah's Messenger (ﷺ) said, \n\"`Uthman bin Maz'un came in our share when the Ansars drew lots to distribute the emigrants (to \ndwell) among themselves, He became sick and we looked after (nursed) him till he died. Then we \nshrouded him in his clothes. Allah's Messenger (ﷺ) came to us, I (addressing the dead body) said, \"May \nAllah's Mercy be on you, O Aba As-Sa'ib! I testify that Allah has honored you.\" The Prophet (ﷺ) said, \n'How do you know that?' I replied, 'I do not know, by Allah.' He said, 'As for him, death has come to \nhim and I wish him all good from Allah. By Allah, though I am Allah's Messenger (ﷺ), I neither know what \nwill happen to me, nor to you.'\" Um Al-`Ala said, \"By Allah, I will never attest the righteousness of \nanybody after that.\" She added, \"Later I saw in a dream, a flowing spring for `Uthman. So I went to \nAllah's Messenger (ﷺ) and mentioned that to him. He said, 'That is (the symbol of) his good deeds (the \nreward for) which is going on for him.' \"", "grade": "Sahih", "narratedBy": "Narrated Kharija bin Zaid bin Thabit:", "reference": "https://sunnah.com/bukhari:7018", "inBookReference": "Book 91, Hadith 35"}, {"id": 36, "hadithNumber": "7019", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"(I saw in a dream that) while I was standing at a well and drawing water \ntherefrom, suddenly Abu Bakr and `Umar came to me. Abu Bakr took the bucket and drew one or two \nbuckets (full of water), but there was weakness in his pulling, but Allah forgave him. Then Ibn Al- \nKhattab took the bucket from Abu Bakr's hand and the bucket turned into a very large one in his hand. \nI have never seen any strong man among the people doing such a hard job as `Umar did, till (the \npeople drank to their satisfaction) and water their camels to their fill and they sat near the water.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:7019", "inBookReference": "Book 91, Hadith 36"}, {"id": 37, "hadithNumber": "7020", "text": "Narrated Salim's father: about the Prophet's dream in which he has seen Abu Bakr and `Umar: The Prophet (ﷺ) said, \"I saw (in a \ndream) that the people had gathered. Then Abu Bakr stood up and pulled out one or two buckets full \nof water (from a well) and there was weakness in his pulling -- may Allah forgive him. Then Ibn Al- \nKhattab stood up, and the bucket turned into a very large one and I have never seen any strong man \namong the people doing such a hard job. He pulled out so much water that the people (drank to their \nsatisfaction) and watered their camels to their fill, (and then after quenching their thirst) they sat \nbeside the water.\"", "grade": "Sahih", "narratedBy": "Narrated Salim's father:", "reference": "https://sunnah.com/bukhari:7020", "inBookReference": "Book 91, Hadith 37"}, {"id": 38, "hadithNumber": "7021", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself standing at a well over which there was a \nbucket. I pulled out from it as many buckets of water as Allah wished, and then Ibn Abi Quhafa (Abu \nBakr) took the bucket from me and pulled out one or two full buckets, and there was weakness in his \npull--may Allah forgive him. Then the bucket turned into a very large one and `Umar bin Al-Khattab \ntook it. I have never seen any strong man among the people, drawing water with such strength as \n`Umar did, till the people (drank to their satisfaction and) watered their camels to their fill; whereupon \nthe camels sat beside the water.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7021", "inBookReference": "Book 91, Hadith 38"}, {"id": 39, "hadithNumber": "7022", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself standing over a tank (well) giving water to \nthe people to drink. Then Abu Bakr came to me and took the bucket from me in order to relieve me \nand he pulled out one or two full buckets, and there was weakness in his pulling --may Allah forgive \nhim. Then Ibn Al-Khattab took it from him and went on drawing water till the people left (after being \nsatisfied) while the tank was over flowing with water.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7022", "inBookReference": "Book 91, Hadith 39"}, {"id": 40, "hadithNumber": "7023", "text": "Narrated Abu Huraira: We were sitting with Allah's Messenger (ﷺ), he said, \"While I was sleeping, I saw myself in Paradise. \nSuddenly I saw a woman performing ablution beside a palace. I asked, \"For whom is this palace?\" \nThey (the angels) replied, \"It is for `Umar bin Al-Khattab.\" Then I remembered `Umar's ghira and \nwent back hurriedly.\" On hearing that, `Umar started weeping and said, \" Let my father and mother be \nsacrificed for you. O Allah's Messenger (ﷺ)! How dare I think of my Ghira being offended by you?", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7023", "inBookReference": "Book 91, Hadith 40"}, {"id": 41, "hadithNumber": "7024", "text": "Narrated Jabir bin `Abdullah: Allah's Messenger (ﷺ) said: (I saw in a dream that) I entered Paradise, and behold, there was a palace built of \ngold! I asked, 'For whom is this palace?' They (the angels) replied, 'For a man from the Quraish.' \" The \nProphet added, \"O Ibn Al-Khattab! Nothing stopped me from entering it except your Ghira.\" `Umar \nsaid, \"How dare I think of my Ghira being offended by you, O Allah's Messenger (ﷺ)?\"", "grade": "Sahih", "narratedBy": "Narrated Jabir bin `Abdullah:", "reference": "https://sunnah.com/bukhari:7024", "inBookReference": "Book 91, Hadith 41"}, {"id": 42, "hadithNumber": "7025", "text": "Narrated Abu Huraira: We were sitting with Allah's Messenger (ﷺ) he said, \"While I was sleeping, I saw myself in Paradise, and \nbehold, a woman was performing ablution by the side of a palace. I asked, 'For whom is this palace?' \nThey replied, 'For `Umar' Then I remembered the Ghira of `Umar and returned immediately.\" `Umar \nwept (on hearing that) and said, \" Let my father and mother be sacrificed for you, O Allah's Messenger (ﷺ)! \nHow dare I think of my Ghira being offended by you.'", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7025", "inBookReference": "Book 91, Hadith 42"}, {"id": 43, "hadithNumber": "7026", "text": "Narrated `Abdullah bin `Umar: Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself performing the Tawaf of the Ka`ba. Behold, \nthere I saw a whitish-red lank-haired man (holding himself) between two men with water dropping \nfrom his hair. I asked, 'Who is this?' The people replied, 'He is the son of Mary.' Then I turned my face \nto see another man with red complexion, big body, curly hair, and blind in the right eye which looked \nlike a protruding out grape. I asked, 'Who is he?' They replied, 'He is Ad-Dajjal.' Ibn Qatan resembles \nhim more than anybody else among the people and Ibn Qatan was a man from Bani Al-Mustaliq from \nKhuza`a.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:7026", "inBookReference": "Book 91, Hadith 43"}, {"id": 44, "hadithNumber": "7027", "text": "Narrated `Abdullah bin `Umar: I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw a bowl full of milk was brought to me \nand I drank of it (to my fill) till I noticed its wetness flowing (in my body). Then I gave the remaining \nof it to `Umar.\" They asked, \"O Allah's Messenger (ﷺ)! What have you interpreted (about the dream)? He \nsaid, \"(It is Religious) knowledge.\" (See Hadith No. 134)", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:7027", "inBookReference": "Book 91, Hadith 44"}, {"id": 45, "hadithNumber": "7028", "text": "Narrated Ibn `Umar: Men from the companions of Allah's Messenger (ﷺ) used to see dreams during the lifetime of Allah's Messenger (ﷺ) \nand they used to narrate those dreams to Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) would interpret them as \nAllah wished. I was a young man and used to stay in the mosque before my wedlock. I said to myself, \n\"If there were any good in myself, I too would see what these people see.\" So when I went to bed one \nnight, I said, \"O Allah! If you see any good in me, show me a good dream.\" So while I was in that \nstate, there came to me (in a dream) two angels. In the hand of each of them, there was a mace of iron, \nand both of them were taking me to Hell, and I was between them, invoking Allah, \"O Allah! I seek \nrefuge with You from Hell.\" Then I saw myself being confronted by another angel holding a mace of \niron in his hand. He said to me, \"Do not be afraid, you will be an excellent man if you only pray more \noften.\" So they took me till they stopped me at the edge of Hell, and behold, it was built inside like a \nwell and it had side posts like those of a well, and beside each post there was an angel carrying an iron \nmace. I saw therein many people hanging upside down with iron chains, and I recognized therein \nsome men from the Quraish. Then (the angels) took me to the right side. I narrated this dream to (my \nsister) Hafsa and she told it to Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) said, \"No doubt, `Abdullah is a good \nman.\" (Nafi` said, \"Since then `Abdullah bin `Umar used to pray much.)", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:7028", "inBookReference": "Book 91, Hadith 45"}, {"id": 46, "hadithNumber": "7030", "text": "Narrated Ibn `Umar: I was a young unmarried man during the lifetime of the Prophet. I used to sleep in the mosque. \nAnyone who had a dream, would narrate it to the Prophet. I said, \"O Allah! If there is any good for me \nwith You, then show me a dream so that Allah's Messenger (ﷺ) may interpret it for me.\" So I slept and saw \n(in a dream) two angels came to me and took me along with them, and they met another angel who \nsaid to me, \"Don't be afraid, you are a good man.\" They took me towards the Fire, and behold, it was \nbuilt inside like a well, and therein I saw people some of whom I recognized, and then the angels took \nme to the right side. In the morning, I mentioned that dream to Hafsa. Hafsa told me that she had \nmentioned it to the Prophet (ﷺ) and he said, \"`Abdullah is a righteous man if he only prays more at night.\" \n(Az-Zuhri said, \"After that, `Abdullah used to pray more at night.\")", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:7030", "inBookReference": "Book 91, Hadith 46"}, {"id": 47, "hadithNumber": "7032", "text": "Narrated `Abdullah bin `Umar: I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw that a cup full of milk was brought to me \nand I drank of it and gave the remaining of it to `Umar bin Al-Khattab.\" They asked. What have you \ninterpreted (about the dream)? O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said. \"(It is Religious) knowledge.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:7032", "inBookReference": "Book 91, Hadith 47"}, {"id": 48, "hadithNumber": "7033", "text": "Narated Ubaidullah bin Abdullah: I asked Ibn Abbas about the dream of Allah's Messenger which he mentioned. (see following hadith)", "grade": "Sahih", "narratedBy": null, "reference": "https://sunnah.com/bukhari:7033", "inBookReference": "Book 91, Hadith 48"}, {"id": 49, "hadithNumber": "7034", "text": "Narrated `Abdullah bin `Abbas: Allah's Messenger (ﷺ) said, \"While I was sleeping, two golden bangles were put in my two hands, so I got \nscared (frightened) and disliked it, but I was given permission to blow them off, and they flew away. I \ninterpret it as a symbol of two liars who will appear.\" 'Ubaidullah said, \"One of them was Al-`Ansi \nwho was killed by Fairuz at Yemen and the other was Musailama (at Najd) .", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Abbas:", "reference": "https://sunnah.com/bukhari:7034", "inBookReference": "Book 91, Hadith 49"}, {"id": 50, "hadithNumber": "7035", "text": "Narrated Abu Musa: The Prophet (ﷺ) said, \"I saw in a dream that I was migrating from Mecca to a land where there were date \npalm trees. I thought that it might be the land of Al-Yamama or Hajar, but behold, it turned out to be \nYathrib (i.e. Medina). And I saw cows (being slaughtered) there, but the reward given by Allah is \nbetter (than worldly benefits). Behold, those cows proved to symbolize the believers (who were killed) \non the Day (of the battle) of Uhud, and the good (which I saw in the dream) was the good and the \nreward and the truth which Allah bestowed upon us after the Badr battle. (or the Battle of Uhud) and \nthat was the victory bestowed by Allah in the Battle of Khaibar and the conquest of Mecca) .", "grade": "Sahih", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/bukhari:7035", "inBookReference": "Book 91, Hadith 50"}, {"id": 51, "hadithNumber": "7036", "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (to come) but (will be) the foremost (on the Day of \nResurrection).\" Allah's Messenger (ﷺ) further said, ''While sleeping, I was given the treasures of the world \nand two golden bangles were put in my hands, but I felt much annoyed, and those two bangles \ndistressed me very much, but I was inspired that I should blow them off, so I blew them and they flew \naway. Then I interpreted that those two bangles were the liars between whom I was (i.e., the one of \nSan`a' and the one of Yamama).", "grade": "Sahih", "narratedBy": "Narrated Abu Huraira:", "reference": "https://sunnah.com/bukhari:7036", "inBookReference": "Book 91, Hadith 51"}, {"id": 52, "hadithNumber": "7038", "text": "Narrated `Abdullah: The Prophet (ﷺ) said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and \nsettling at Mahai'a, i.e., Al-Juhfa. I interpreted that as a symbol of epidemic of Medina being \ntransferred to that place (Al-Juhfa).", "grade": "Sahih", "narratedBy": "Narrated `Abdullah:", "reference": "https://sunnah.com/bukhari:7038", "inBookReference": "Book 91, Hadith 52"}, {"id": 53, "hadithNumber": "7039", "text": "Narrated `Abdullah bin `Umar: concerning the dream of the Prophet (ﷺ) in Medina: The Prophet (ﷺ) said, \"I saw (in a dream) a black woman \nwith unkempt hair going out of Medina and settling at Mahai'a. I interpreted that as (a symbol of) the \nepidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"", "grade": "Sahih", "narratedBy": "Narrated `Abdullah bin `Umar:", "reference": "https://sunnah.com/bukhari:7039", "inBookReference": "Book 91, Hadith 53"}, {"id": 54, "hadithNumber": "7040", "text": "Narrated Salim's father: The Prophet (ﷺ) said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and \nsettling in Mahai'a. I interpreted that as (a symbol of) epidemic of Medina being transferred to \nMahai'a, namely, Al-Juhfa.\"", "grade": "Sahih", "narratedBy": "Narrated Salim's father:", "reference": "https://sunnah.com/bukhari:7040", "inBookReference": "Book 91, Hadith 54"}, {"id": 55, "hadithNumber": "7041", "text": "Narrated Abu Musa: The Prophet (ﷺ) said, \"I saw in a dream that I waved a sword and it broke in the middle, and behold, that \nsymbolized the casualties the believers suffered on the Day (of the battle) of Uhud. Then I waved the \nsword again, and it became better than it had ever been before, and behold, that symbolized the \nConquest (of Mecca) which Allah brought about and the gathering of the believers. \"", "grade": "Sahih", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/bukhari:7041", "inBookReference": "Book 91, Hadith 55"}, {"id": 56, "hadithNumber": "7042", "text": "Narrated Ibn `Abbas: The Prophet (ﷺ) said, \"Whoever claims to have seen a dream which he did not see, will be ordered to \nmake a knot between two barley grains which he will not be able to do; and if somebody listens to the \ntalk of some people who do not like him (to listen) or they run away from him, then molten lead will \nbe poured into his ears on the Day of Resurrection; and whoever makes a picture, will be punished on \nthe Day of Resurrection and will be ordered to put a soul in that picture, which he will not be able to \ndo.\" \n\nIbn `Abbas also narrated a similar hadith.", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:7042", "inBookReference": "Book 91, Hadith 56"}, {"id": 57, "hadithNumber": "7043", "text": "Narrated Ibn `Umar: Allah's Messenger (ﷺ) said, \"The worst lie is that a person claims to have seen a dream which he has not \nseen.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Umar:", "reference": "https://sunnah.com/bukhari:7043", "inBookReference": "Book 91, Hadith 57"}, {"id": 58, "hadithNumber": "7044", "text": "Narrated Abu Salama: I used to see a dream which would make me sick till I heard Abu Qatada saying, \"I too, used to see a \ndream which would make me sick till I heard the Prophet (ﷺ) saying, \"A good dream is from Allah, so if \nanyone of you saw a dream which he liked, he should not tell it to anybody except to the one whom he \nloves, and if he saw a dream which he disliked, then he should seek refuge with Allah from its evil \nand from the evil of Satan, and spit three times (on his left) and should not tell it to anybody, for it will \nnot harm him. \"", "grade": "Sahih", "narratedBy": "Narrated Abu Salama:", "reference": "https://sunnah.com/bukhari:7044", "inBookReference": "Book 91, Hadith 58"}, {"id": 59, "hadithNumber": "7045", "text": "Narrated Abu Sa`id Al-Khudri: I heard Allah's Messenger (ﷺ) saying, \"If anyone of you saw a dream which he liked, then that was from \nAllah, and he should thank Allah for it and tell it to others; but if he saw something else, i.e, a dream \nwhich he did not like, then that is from Satan and he should seek refuge with Allah from it and should \nnot tell it to anybody for it will not harm him.\"", "grade": "Sahih", "narratedBy": "Narrated Abu Sa`id Al-Khudri:", "reference": "https://sunnah.com/bukhari:7045", "inBookReference": "Book 91, Hadith 59"}, {"id": 60, "hadithNumber": "7046", "text": "Narrated Ibn `Abbas: A man came to Allah's Messenger (ﷺ) and said, \"I saw in a dream, a cloud having shade. Butter and honey \nwere dropping from it and I saw the people gathering it in their hands, some gathering much and some \na little. And behold, there was a rope extending from the earth to the sky, and I saw that you (the \nProphet) held it and went up, and then another man held it and went up and (after that) another (third) \nheld it and went up, and then after another (fourth) man held it, but it broke and then got connected \nagain.\" Abu Bakr said, \"O Allah's Messenger (ﷺ)! Let my father be sacrificed for you! Allow me to interpret \nthis dream.\" The Prophet (ﷺ) said to him, \"Interpret it.\" Abu Bakr said, \"The cloud with shade symbolizes \nIslam, and the butter and honey dropping from it, symbolizes the Qur'an, its sweetness dropping and \nsome people learning much of the Qur'an and some a little. The rope which is extended from the sky \nto the earth is the Truth which you (the Prophet) are following. You follow it and Allah will raise you \nhigh with it, and then another man will follow it and will rise up with it and another person will follow \nit and then another man will follow it but it will break and then it will be connected for him and he \nwill rise up with it. O Allah's Messenger (ﷺ)! Let my father be sacrificed for you! Am I right or wrong?\" The \nProphet replied, \"You are right in some of it and wrong in some.\" Abu Bakr said, \"O Allah's Prophet! \nBy Allah, you must tell me in what I was wrong.\" The Prophet (ﷺ) said, \"Do not swear.\"", "grade": "Sahih", "narratedBy": "Narrated Ibn `Abbas:", "reference": "https://sunnah.com/bukhari:7046", "inBookReference": "Book 91, Hadith 60"}, {"id": 61, "hadithNumber": "7047", "text": "Narrated Samura bin Jundub: Allah's Messenger (ﷺ) very often used to ask his companions, \"Did anyone of you see a dream?\" So dreams \nwould be narrated to him by those whom Allah wished to tell. \nOne morning the Prophet (ﷺ) said, \"Last night two persons came to me (in a dream) and woke me up and \nsaid to me, 'Proceed!' I set out with them and we came across a man lying down, and behold, another \nman was standing over his head, holding a big rock. Behold, he was throwing the rock at the man's \nhead, injuring it. The rock rolled away and the thrower followed it and took it back. By the time he \nreached the man, his head returned to the normal state. The thrower then did the same as he had done \nbefore. \nI said to my two companions, 'Subhan Allah! Who are these two persons?' They said, 'Proceed!' So \nwe proceeded and came to a man lying flat on his back and another man standing over his head with \nan iron hook, and behold, he would put the hook in one side of the man's mouth and tear off that side \nof his face to the back (of the neck) and similarly tear his nose from front to back and his eye from \nfront to back. Then he turned to the other side of the man's face and did just as he had done with the \nother side. He hardly completed this side when the other side returned to its normal state. Then he \nreturned to it to repeat what he had done before. I said to my two companions, 'Subhan Allah! Who \nare these two persons?' They said to me, 'Proceed!' So we proceeded and came across something like a \nTannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I think the Prophet (ﷺ) said, \"In \nthat oven there was much noise and voices.\" The Prophet (ﷺ) added, \"We looked into it and found naked \nmen and women, and behold, a flame of fire was reaching to them from underneath, and when it \nreached them, they cried loudly. \nI asked them, 'Who are these?' They said to me, 'Proceed!' And so we proceeded and came across a \nriver.\" I think he said, \".... red like blood.\" The Prophet (ﷺ) added, \"And behold, in the river there was a \nman swimming, and on the bank there was a man who had collected many stones. Behold, while the \nother man was swimming, he went near him. The former opened his mouth and the latter (on the \nbank) threw a stone into his mouth whereupon he went swimming again. He returned and every time \nthe performance was repeated. \nI asked my two companions, 'Who are these (two) persons?' They replied, 'Proceed! Proceed!' And we \nproceeded till we came to a man with a repulsive appearance, the most repulsive appearance, you ever \nsaw a man having! Beside him there was a fire and he was kindling it and running around it. \nI asked my companions, 'Who is this (man)?' They said to me, 'Proceed! Proceed!' So we proceeded \ntill we reached a garden of deep green dense vegetation, having all sorts of spring colors. In the midst \nof the garden there was a very tall man and I could hardly see his head because of his great height, and \naround him there were children in such a large number as I have never seen. \nI said to my companions, 'Who is this?' They replied, 'Proceed! Proceed!' So we proceeded till we \ncame to a majestic huge garden, greater and better than I have ever seen! My two companions said to \nme, 'Go up' and I went up. The Prophet (ﷺ) added, \"So we ascended till we reached a city built of gold and \nsilver bricks and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened \nand we entered the city and found in it, men with one side of their bodies as handsome as the \nhandsomest person you have ever seen, and the other side as ugly as the ugliest person you have ever \nseen. My two companions ordered those men to throw themselves into the river. Behold, there was a \nriver flowing across (the city), and its water was like milk in whiteness. \nThose men went and threw themselves in it and then returned to us after the ugliness (of their bodies) \nhad disappeared and they became in the best shape.\" The Prophet (ﷺ) further added, \"My two companions \n(angels) said to me, 'This place is the Eden Paradise, and that is your place.' I raised up my sight, and \nbehold, there I saw a palace like a white cloud! \nMy two companions said to me, 'That (palace) is your place.' I said to them, 'May Allah bless you \nboth! Let me enter it.' They replied, 'As for now, you will not enter it, but you shall enter it (one day). \nI said to them, 'I have seen many wonders tonight. What does all that mean which I have seen?' \nThey replied, 'We will inform you: \nAs for the first man you came upon whose head was being injured with the rock, he is the symbol of \nthe one who studies the Qur'an and then neither recites it nor acts on its orders, and sleeps, neglecting \nthe enjoined prayers. \nAs for the man you came upon whose sides of mouth, nostrils and eyes were torn off from front to \nback, he is the symbol of the man who goes out of his house in the morning and tells so many lies that \nit spreads all over the world. And those naked men and women whom you saw in a construction \nresembling an oven, they are the adulterers and the adulteresses. \nAnd the man whom you saw swimming in the river and given a stone to swallow, is the eater of usury \n(Riba). \nAnd the bad looking man whom you saw near the fire kindling it and going round it, is Malik, the \ngatekeeper of Hell. \nAnd the tall man whom you saw in the garden, is Abraham and the children around him are those \nchildren who die with Al-Fitra (the Islamic Faith). \nThe narrator added: Some Muslims asked the Prophet, \"O Allah's Messenger (ﷺ)! What about the children of \npagans?\" The Prophet (ﷺ) replied, \"And also the children of pagans.\" \nThe Prophet (ﷺ) added, \"My two companions added, 'The men you saw half handsome and half ugly were \nthose persons who had mixed an act that was good with another that was bad, but Allah forgave \nthem.'\"", "grade": "Sahih", "narratedBy": "Narrated Samura bin Jundub:", "reference": "https://sunnah.com/bukhari:7047", "inBookReference": "Book 91, Hadith 61"}]}