{"verses":[{"verseKey":"71:1","text":"We sent Noah to his People (with the Command): \"Do thou warn thy People before there comes to them a grievous Penalty"},{"verseKey":"71:2","text":"He said: \"O my People! I am to you a Warner, clear and open"},{"verseKey":"71:3","text":"That ye should worship Allah, fear Him and obey me"},{"verseKey":"71:4","text":"So He may forgive you your sins and give you respite for a stated Term: for when the Term given by Allah is accomplished, it cannot be put forward: if ye only knew"},{"verseKey":"71:5","text":"He said: \"O my Lord! I have called to my People night and day"},{"verseKey":"71:6","text":"But my call only increases (their) flight (from the Right)"},{"verseKey":"71:7","text":"And every time I have called to them, that Thou mightest forgive them, they have (only) thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance"},{"verseKey":"71:8","text":"So I have called to them aloud"},{"verseKey":"71:9","text":"Further I have spoken to them in public and secretly in private"},{"verseKey":"71:10","text":"Saying, 'Ask forgiveness from your Lord; for He is Oft-Forgiving"},{"verseKey":"71:11","text":"He will send rain to you in abundance"},{"verseKey":"71:12","text":"Give you increase in wealth and sons; and bestow on you gardens and bestow on you rivers (of flowing water)"},{"verseKey":"71:13","text":"What is the matter with you, that ye place not your hope for kindness and long-suffering in Allah"},{"verseKey":"71:14","text":"Seeing that it is He that has created you in diverse stages"},{"verseKey":"71:15","text":"See ye not how Allah has created the seven heavens one above another"},{"verseKey":"71:16","text":"And made the moon a light in their midst, and made the sun as a (Glorious) Lamp"},{"verseKey":"71:17","text":"And Allah has produced you from the earth growing (gradually)"},{"verseKey":"71:18","text":"And in the End He will return you into the (earth), and raise you forth (again at the Resurrection)"},{"verseKey":"71:19","text":"And Allah has made the earth for you as a carpet (spread out)"},{"verseKey":"71:20","text":"That ye may go about therein, in spacious roads"},{"verseKey":"71:21","text":"Noah said: \"O my Lord! They have disobeyed me, but they follow (men) whose wealth and children give them no increase but only Loss"},{"verseKey":"71:22","text":"And they have devised a tremendous Plot"},{"verseKey":"71:23","text":"And they have said (to each other), 'Abandon not your gods: Abandon neither Wadd nor Suwa', neither Yaguth nor Ya'uq, nor Nasr"},{"verseKey":"71:24","text":"They have already misled many; and grant Thou no increase to the wrong-doers but in straying (from their mark)"},{"verseKey":"71:25","text":"Because of their sins they were drowned (in the flood), and were made to enter the Fire (of Punishment): and they found- in lieu of Allah- none to help them"},{"verseKey":"71:26","text":"And Noah, said: \"O my Lord! Leave not of the Unbelievers, a single one on earth"},{"verseKey":"71:27","text":"For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones"},{"verseKey":"71:28","text":"O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition"}]}