{"verses":[{"verseKey":"84:1","text":"When the sky is rent asunder"},{"verseKey":"84:2","text":"And hearkens to (the Command of) its Lord, and it must needs (do so)"},{"verseKey":"84:3","text":"And when the earth is flattened out"},{"verseKey":"84:4","text":"And casts forth what is within it and becomes (clean) empty"},{"verseKey":"84:5","text":"And hearkens to (the Command of) its Lord,- and it must needs (do so);- (then will come Home the full reality)"},{"verseKey":"84:6","text":"O thou man! Verily thou art ever toiling on towards thy Lord- painfully toiling,- but thou shalt meet Him"},{"verseKey":"84:7","text":"Then he who is given his Record in his right hand"},{"verseKey":"84:8","text":"Soon will his account be taken by an easy reckoning"},{"verseKey":"84:9","text":"And he will turn to his people, rejoicing"},{"verseKey":"84:10","text":"But he who is given his Record behind his back"},{"verseKey":"84:11","text":"Soon will he cry for perdition"},{"verseKey":"84:12","text":"And he will enter a Blazing Fire"},{"verseKey":"84:13","text":"Truly, did he go about among his people, rejoicing"},{"verseKey":"84:14","text":"Truly, did he think that he would not have to return (to Us)"},{"verseKey":"84:15","text":"Nay, nay! for his Lord was (ever) watchful of him"},{"verseKey":"84:16","text":"So I do call to witness the ruddy glow of Sunset"},{"verseKey":"84:17","text":"The Night and its Homing"},{"verseKey":"84:18","text":"And the Moon in her fullness"},{"verseKey":"84:19","text":"Ye shall surely travel from stage to stage"},{"verseKey":"84:20","text":"What then is the matter with them, that they believe not"},{"verseKey":"84:21","text":"And when the Qur'an is read to them, they fall not prostrate"},{"verseKey":"84:22","text":"But on the contrary the Unbelievers reject (it)"},{"verseKey":"84:23","text":"But Allah has full knowledge of what they secrete (in their breasts)"},{"verseKey":"84:24","text":"So announce to them a Penalty Grievous"},{"verseKey":"84:25","text":"Except to those who believe and work righteous deeds: For them is a Reward that will never fail"}]}