{"verses":[{"verseKey":"15:1","text":"Alif-Lam-Ra. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. These are the Verses of the Book, and a plain Quran"},{"verseKey":"15:2","text":"Perhaps (often) will those who disbelieve wish that they were Muslims [those who have submitted themselves to Allah's Will in Islam Islamic Monotheism, this will be on the Day of Resurrection when they will see the disbelievers going to Hell and the Muslims going to Paradise]"},{"verseKey":"15:3","text":"Leave them to eat and enjoy, and let them be preoccupied with (false) hope. They will come to know"},{"verseKey":"15:4","text":"And never did We destroy a township but there was a known decree for it"},{"verseKey":"15:5","text":"No nation can anticipate its term, nor delay it"},{"verseKey":"15:6","text":"And they say: \"O you (Muhammad SAW) to whom the Dhikr (the Quran) has been sent down! Verily, you are a mad man"},{"verseKey":"15:7","text":"Why do you not bring angels to us if you are of the truthful ones"},{"verseKey":"15:8","text":"We send not the angels down except with the truth (i.e. for torment, etc.), and in that case, they (the disbelievers) would have no respite"},{"verseKey":"15:9","text":"Verily We: It is We Who have sent down the Dhikr (i.e. the Quran) and surely, We will guard it (from corruption)"},{"verseKey":"15:10","text":"Indeed, We sent Messengers before you (O Muhammad SAW) amongst the sects (communities) of old"},{"verseKey":"15:11","text":"And never came a Messenger to them but they did mock him"},{"verseKey":"15:12","text":"Thus do We let it (polytheism and disbelief) enter into the hearts of the Mujrimun [criminals, polytheists, pagans, etc. (because of their mockery at the Messengers]"},{"verseKey":"15:13","text":"They would not believe in it (the Quran), and already the example of (Allah's punishment of) the ancients (who disbelieved) has gone forth"},{"verseKey":"15:14","text":"And even if We opened to them a gate from the heaven and they were to continue ascending thereto"},{"verseKey":"15:15","text":"They would surely say: \"Our eyes have been (as if) dazzled. Nay, we are a people bewitched"},{"verseKey":"15:16","text":"And indeed, We have put the big stars in the heaven and We beautified it for the beholders"},{"verseKey":"15:17","text":"And We have guarded it (near heaven) from every outcast Shaitan (devil)"},{"verseKey":"15:18","text":"Except him (devil) that gains hearing by stealing, he is pursued by a clear flaming fire"},{"verseKey":"15:19","text":"And the earth We spread out, and placed therein firm mountains, and caused to grow therein all kinds of things in due proportion"},{"verseKey":"15:20","text":"And We have provided therein means of living, for you and for those whom you provide not [moving (living) creatures, cattle, beasts, and other animals"},{"verseKey":"15:21","text":"And there is not a thing, but with Us are the stores thereof. And We send it not down except in a known measure"},{"verseKey":"15:22","text":"And We send the winds fertilizing (to fill heavily the clouds with water), then caused the water (rain) to descend from the sky, and We gave it to you to drink, and it is not you who are the owners of its stores [i.e. to give water to whom you like or to withhold it from whom you like]"},{"verseKey":"15:23","text":"And certainly We! We it is Who give life, and cause death, and We are the Inheritors"},{"verseKey":"15:24","text":"And indeed, We know the first generations of you who had passed away, and indeed, We know the present generations of you (mankind), and also those who will come afterwards"},{"verseKey":"15:25","text":"And verily, your Lord will gather them together. Truly, He is All-Wise, All-Knowing"},{"verseKey":"15:26","text":"And indeed, We created man from sounding clay of altered black smooth mud"},{"verseKey":"15:27","text":"And the jinn, We created aforetime from the smokeless flame of fire"},{"verseKey":"15:28","text":"And (remember) when your Lord said to the angels: \"I am going to create a man (Adam) from sounding clay of altered black smooth mud"},{"verseKey":"15:29","text":"So, when I have fashioned him completely and breathed into him (Adam) the soul which I created for him, then fall (you) down prostrating yourselves unto him"},{"verseKey":"15:30","text":"So, the angels prostrated themselves, all of them together"},{"verseKey":"15:31","text":"Except Iblis (Satan), - he refused to be among the prostrators"},{"verseKey":"15:32","text":"(Allah) said: \"O Iblis (Satan)! What is your reason for not being among the prostrators"},{"verseKey":"15:33","text":"Iblis (Satan)] said: \"I am not the one to prostrate myself to a human being, whom You created from sounding clay of altered black smooth mud"},{"verseKey":"15:34","text":"(Allah) said: \"Then, get out from here, for verily, you are Rajim (an outcast or a cursed one).\" [Tafsir At-Tabari]"},{"verseKey":"15:35","text":"And verily, the curse shall be upon you till the Day of Recompense (i.e. the Day of Resurrection)"},{"verseKey":"15:36","text":"Iblis (Satan)] said: \"O my Lord! Give me then respite till the Day they (the dead) will be resurrected"},{"verseKey":"15:37","text":"Allah said: \"Then, verily, you are of those reprieved"},{"verseKey":"15:38","text":"Till the Day of the time appointed"},{"verseKey":"15:39","text":"Iblis (Satan)] said: \"O my Lord! Because you misled me, I shall indeed adorn the path of error for them (mankind) on the earth, and I shall mislead them all"},{"verseKey":"15:40","text":"Except Your chosen, (guided) slaves among them"},{"verseKey":"15:41","text":"(Allah) said: \"This is the Way which will lead straight to Me"},{"verseKey":"15:42","text":"Certainly, you shall have no authority over My slaves, except those who follow you of the Ghawin (Mushrikun and those who go astray, criminals, polytheists, and evil-doers, etc)"},{"verseKey":"15:43","text":"And surely, Hell is the promised place for them all"},{"verseKey":"15:44","text":"It (Hell) has seven gates, for each of those gates is a (special) class (of sinners) assigned"},{"verseKey":"15:45","text":"Truly! The Muttaqun (pious and righteous persons - see V. 2:2) will be amidst Gardens and water-springs (Paradise)"},{"verseKey":"15:46","text":"(It will be said to them): 'Enter therein (Paradise), in peace and security"},{"verseKey":"15:47","text":"And We shall remove from their breasts any sense of injury (that they may have), (So they will be like) brothers facing each other on thrones"},{"verseKey":"15:48","text":"No sense of fatigue shall touch them, nor shall they (ever) be asked to leave it"},{"verseKey":"15:49","text":"Declare (O Muhammad SAW) unto My slaves, that truly, I am the Oft-Forgiving, the Most-Merciful"},{"verseKey":"15:50","text":"And that My Torment is indeed the most painful torment"},{"verseKey":"15:51","text":"And tell them about the guests (the angels) of Ibrahim (Abraham)"},{"verseKey":"15:52","text":"When they entered unto him, and said: Salaman (peace)! [Ibrahim (Abraham)] said: \"Indeed! We are afraid of you"},{"verseKey":"15:53","text":"They (the angels) said: \"Do not be afraid! We give you glad tidings of a boy (son) possessing much knowledge and wisdom"},{"verseKey":"15:54","text":"Ibrahim (Abraham)] said: \"Do you give me glad tidings (of a son) when old age has overtaken me? Of what then is your news"},{"verseKey":"15:55","text":"They (the angels) said: \"We give you glad tidings in truth. So be not of the despairing ones"},{"verseKey":"15:56","text":"Ibrahim (Abraham)] said: \"And who despairs of the Mercy of his Lord except those who are astray"},{"verseKey":"15:57","text":"Ibrahim (Abraham) again] said: \"What then is the business on which you have come, O Messengers"},{"verseKey":"15:58","text":"They (the angels) said: \"We have been sent to a people who are Mujrimun (criminals, disbelievers, polytheists, sinners)"},{"verseKey":"15:59","text":"(All) except the family of Lout (Lot). Them all we are surely going to save (from destruction)"},{"verseKey":"15:60","text":"Except his wife, of whom We have decreed that she shall be of those who remain behind (i.e. she will be destroyed)"},{"verseKey":"15:61","text":"Then, when the Messengers (the angels) came unto the family of Lout (Lot)"},{"verseKey":"15:62","text":"He said: \"Verily! You are people unknown to me"},{"verseKey":"15:63","text":"They said: \"Nay, we have come to you with that (torment) which they have been doubting"},{"verseKey":"15:64","text":"And we have brought to you the truth (the news of the destruction of your nation) and certainly, we tell the truth"},{"verseKey":"15:65","text":"Then travel in a part of the night with your family, and you go behind them in the rear, and let no one amongst you look back, but go on to where you are ordered"},{"verseKey":"15:66","text":"And We made known this decree to him, that the root of those (sinners) was to be cut off in the early morning"},{"verseKey":"15:67","text":"And the inhabitants of the city came rejoicing (at the news of the young men's arrival)"},{"verseKey":"15:68","text":"Lout (Lot)] said: \"Verily! these are my guests, so shame me not"},{"verseKey":"15:69","text":"And fear Allah and disgrace me not"},{"verseKey":"15:70","text":"They (people of the city) said: \"Did we not forbid you to entertain (or protect) any of the 'Alamin (people, foreigners, strangers, etc. from us)"},{"verseKey":"15:71","text":"Lout (Lot)] said: \"These (the girls of the nation) are my daughters (to marry lawfully), if you must act (so)"},{"verseKey":"15:72","text":"Verily, by your life (O Muhammad SAW), in their wild intoxication, they were wandering blindly"},{"verseKey":"15:73","text":"So As-Saihah (torment - awful cry, etc.) overtook them at the time of sunrise"},{"verseKey":"15:74","text":"And We turned (the towns of Sodom in Palestine) upside down and rained down on them stones of baked clay"},{"verseKey":"15:75","text":"Surely! In this are signs, for those who see (or understand or learn the lessons from the Signs of Allah)"},{"verseKey":"15:76","text":"And verily! They (the cities) were right on the highroad (from Makkah to Syria i.e. the place where the Dead Sea is now)"},{"verseKey":"15:77","text":"Surely! Therein is indeed a sign for the believers"},{"verseKey":"15:78","text":"And the dwellers in the wood [i.e. the people of Madyan (Midian) to whom Prophet Shu'aib was sent by Allah), were also Zalimun (polytheists and wrong-doers, etc)"},{"verseKey":"15:79","text":"So, We took vengeance on them. They are both on an open highway, plain to see"},{"verseKey":"15:80","text":"And verily, the dwellers of Al-Hijr (the rocky tract) denied the Messengers"},{"verseKey":"15:81","text":"And We gave them Our Signs, but they were averse to them"},{"verseKey":"15:82","text":"And they used to hew out dwellings from the mountains (feeling themselves) secure"},{"verseKey":"15:83","text":"But As-Saihah (torment - awful cry etc.) overtook them in the early morning (of the fourth day of their promised punishment days)"},{"verseKey":"15:84","text":"And all that which they used to earn availed them not"},{"verseKey":"15:85","text":"And We created not the heavens and the earth and all that is between them except with truth, and the Hour is surely coming, so overlook (O Muhammad SAW), their faults with gracious forgiveness. [This was before the ordainment of Jihad holy fighting in Allah's Cause]"},{"verseKey":"15:86","text":"Verily, your Lord is the All-Knowing Creator"},{"verseKey":"15:87","text":"And indeed, We have bestowed upon you seven of Al-Mathani (the seven repeatedly recited Verses), (i.e. Surat Al-Fatiha) and the Grand Quran"},{"verseKey":"15:88","text":"Look not with your eyes ambitiously at what We have bestowed on certain classes of them (the disbelievers), nor grieve over them. And lower your wings for the believers (be courteous to the fellow-believers)"},{"verseKey":"15:89","text":"And say: \"I am indeed a plain warner"},{"verseKey":"15:90","text":"As We have sent down on the dividers, (Quraish pagans or Jews and Christians)"},{"verseKey":"15:91","text":"Who have made the Quran into parts. (i.e. believed in a part and disbelieved in the other)"},{"verseKey":"15:92","text":"So, by your Lord (O Muhammad SAW), We shall certainly call all of them to account"},{"verseKey":"15:93","text":"For all that they used to do"},{"verseKey":"15:94","text":"Therefore proclaim openly (Allah's Message Islamic Monotheism) that which you are commanded, and turn away from Al-Mushrikun (polytheists, idolaters, and disbelievers, etc. - see V)"},{"verseKey":"15:95","text":"Truly! We will suffice you against the scoffers"},{"verseKey":"15:96","text":"Who set up along with Allah another ilah (god), they will come to know"},{"verseKey":"15:97","text":"Indeed, We know that your breast is straitened at what they say"},{"verseKey":"15:98","text":"So glorify the praises of your Lord and be of those who prostrate themselves (to Him)"},{"verseKey":"15:99","text":"And worship your Lord until there comes unto you the certainty (i.e. death)"}]}