{"verses":[{"verseKey":"36:1","text":"Ya-Sin. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings"},{"verseKey":"36:2","text":"By the Quran, full of wisdom (i.e. full of laws, evidences, and proofs)"},{"verseKey":"36:3","text":"Truly, you (O Muhammad SAW) are one of the Messengers"},{"verseKey":"36:4","text":"On a Straight Path (i.e. on Allah's religion of Islamic Monotheism)"},{"verseKey":"36:5","text":"(This is) a Revelation sent down by the AllMighty, the Most Merciful"},{"verseKey":"36:6","text":"In order that you may warn a people whose forefathers were not warned, so they are heedless"},{"verseKey":"36:7","text":"Indeed the Word (of punishment) has proved true against most of them, so they will not believe"},{"verseKey":"36:8","text":"Verily! We have put on their necks iron collars reaching to chins, so that their heads are forced up"},{"verseKey":"36:9","text":"And We have put a barrier before them, and a barrier behind them, and We have covered them up, so that they cannot see"},{"verseKey":"36:10","text":"It is the same to them whether you warn them or you warn them not, they will not believe"},{"verseKey":"36:11","text":"You can only warn him who follows the Reminder (the Quran), and fears the Most Beneficent (Allah) unseen. Bear you to such one the glad tidings of forgiveness, and a generous reward (i.e. Paradise)"},{"verseKey":"36:12","text":"Verily, We give life to the dead, and We record that which they send before (them), and their traces [their footsteps and walking on the earth with their legs to the mosques for the five compulsory congregational prayers, Jihad (holy fighting in Allah's Cause) and all other good and evil they did, and that which they leave behind], and all things We have recorded with numbers (as a record) in a Clear Book"},{"verseKey":"36:13","text":"And put forward to them a similitude; the (story of the) dwellers of the town, [It is said that the town was Antioch (Antakiya)], when there came Messengers to them"},{"verseKey":"36:14","text":"When We sent to them two Messengers, they belied them both, so We reinforced them with a third, and they said: \"Verily! We have been sent to you as Messengers"},{"verseKey":"36:15","text":"They (people of the town) said: \"You are only human beings like ourselves, and the Most Beneficent (Allah) has revealed nothing, you are only telling lies"},{"verseKey":"36:16","text":"The Messengers said: \"Our Lord knows that we have been sent as Messengers to you"},{"verseKey":"36:17","text":"And our duty is only to convey plainly (the Message)"},{"verseKey":"36:18","text":"They (people) said: \"For us, we see an evil omen from you, if you cease not, we will surely stone you, and a painful torment will touch you from us"},{"verseKey":"36:19","text":"They (Messengers) said: \"Your evil omens be with you! (Do you call it \"evil omen\") because you are admonished? Nay, but you are a people Musrifun (transgressing all bounds by committing all kinds of great sins, and by disobeying Allah)"},{"verseKey":"36:20","text":"And there came running from the farthest part of the town, a man, saying: \"O my people! Obey the Messengers"},{"verseKey":"36:21","text":"Obey those who ask no wages of you (for themselves), and who are rightly guided"},{"verseKey":"36:22","text":"And why should I not worship Him (Allah Alone) Who has created me and to Whom you shall be returned"},{"verseKey":"36:23","text":"Shall I take besides Him aliha (gods), if the Most Beneficent (Allah) intends me any harm, their intercession will be of no use for me whatsoever, nor can they save me"},{"verseKey":"36:24","text":"Then verily, I should be in plain error"},{"verseKey":"36:25","text":"Verily! I have believed in your Lord, so listen to me"},{"verseKey":"36:26","text":"It was said (to him when the disbelievers killed him): \"Enter Paradise.\" He said: \"Would that my people knew"},{"verseKey":"36:27","text":"That my Lord (Allah) has forgiven me, and made me of the honoured ones"},{"verseKey":"36:28","text":"And We sent not against his people after him a host from heaven, nor do We send (such a thing)"},{"verseKey":"36:29","text":"It was but one Saihah (shout, etc.) and lo! They (all) were silent (dead-destroyed)"},{"verseKey":"36:30","text":"Alas for mankind! There never came a Messenger to them but they used to mock at him"},{"verseKey":"36:31","text":"Do they not see how many of the generations We have destroyed before them? Verily, they will not return to them"},{"verseKey":"36:32","text":"And surely, all, everyone of them will be brought before Us"},{"verseKey":"36:33","text":"And a sign for them is the dead land. We gave it life, and We brought forth from it grains, so that they eat thereof"},{"verseKey":"36:34","text":"And We have made therein gardens of date-palms and grapes, and We have caused springs of water to gush forth therein"},{"verseKey":"36:35","text":"So that they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks"},{"verseKey":"36:36","text":"Glory be to Him, Who has created all the pairs of that which the earth produces, as well as of their own (human) kind (male and female), and of that which they know not"},{"verseKey":"36:37","text":"And a sign for them is the night, We withdraw therefrom the day, and behold, they are in darkness"},{"verseKey":"36:38","text":"And the sun runs on its fixed course for a term (appointed). That is the Decree of the All-Mighty, the All-Knowing"},{"verseKey":"36:39","text":"And the moon, We have measured for it mansions (to traverse) till it returns like the old dried curved date stalk"},{"verseKey":"36:40","text":"It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit"},{"verseKey":"36:41","text":"And an Ayah (sign) for them is that We bore their offspring in the laden ship [of Nuh (Noah]"},{"verseKey":"36:42","text":"And We have created for them of the like thereunto, so on them they ride"},{"verseKey":"36:43","text":"And if We will, We shall drown them, and there will be no shout (or helper) for them (to hear their cry for help) nor will they be saved"},{"verseKey":"36:44","text":"Unless it be a mercy from Us, and as an enjoyment for a while"},{"verseKey":"36:45","text":"And when it is said to them: \"Beware of that which is before you (worldly torments), and that which is behind you (torments in the Hereafter), in order that you may receive Mercy (i.e. if you believe in Allah's Religion Islamic Monotheism, and avoid polytheism, and obey Allah with righteous deeds)"},{"verseKey":"36:46","text":"And never came an Ayah from among the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord to them, but they did turn away from it"},{"verseKey":"36:47","text":"And when it is said to them: \"Spend of that with which Allah has provided you,\" those who disbelieve say to those who believe: \"Shall we feed those whom, if Allah willed, He (Himself) would have fed? You are only in a plain error"},{"verseKey":"36:48","text":"And they say: \"When will this promise (i.e. Resurrection) be fulfilled, if you are truthful"},{"verseKey":"36:49","text":"They await only but a single Saihah (shout, etc.), which will seize them while they are disputing"},{"verseKey":"36:50","text":"Then they will not be able to make bequest, nor they will return to their family"},{"verseKey":"36:51","text":"And the Trumpet will be blown (i.e. the second blowing) and behold! From the graves they will come out quickly to their Lord"},{"verseKey":"36:52","text":"They will say: \"Woe to us! Who has raised us up from our place of sleep.\" (It will be said to them): \"This is what the Most Beneficent (Allah) had promised, and the Messengers spoke truth"},{"verseKey":"36:53","text":"It will be but a single Saihah (shout, etc.), so behold! They will all be brought up before Us"},{"verseKey":"36:54","text":"This Day (Day of Resurrection), none will be wronged in anything, nor will you be requited anything except that which you used to do"},{"verseKey":"36:55","text":"Verily, the dwellers of the Paradise, that Day, will be busy in joyful things"},{"verseKey":"36:56","text":"They and their wives will be in pleasant shade, reclining on thrones"},{"verseKey":"36:57","text":"They will have therein fruits (of all kinds) and all that they ask for"},{"verseKey":"36:58","text":"(It will be said to them): Salamun (peace be on you), a Word from the Lord (Allah), Most Merciful"},{"verseKey":"36:59","text":"(It will be said): \"And O you Al-Mujrimun (criminals, polytheists, sinners, disbelievers in the Islamic Monotheism, wicked evil ones, etc.)! Get you apart this Day (from the believers)"},{"verseKey":"36:60","text":"Did I not ordain for you, O Children of Adam, that you should not worship Shaitan (Satan). Verily, he is a plain enemy to you"},{"verseKey":"36:61","text":"And that you should worship Me [Alone Islamic Monotheism, and set up not rivals, associate-gods with Me]. That is a Straight Path"},{"verseKey":"36:62","text":"And indeed he (Satan) did lead astray a great multitude of you. Did you not, then, understand"},{"verseKey":"36:63","text":"This is Hell which you were promised"},{"verseKey":"36:64","text":"Burn therein this Day, for that you used to disbelieve"},{"verseKey":"36:65","text":"This Day, We shall seal up their mouths, and their hands will speak to Us, and their legs will bear witness to what they used to earn. (It is said that one's left thigh will be the first to bear the witness). [Tafsir At-Tabari, Vol. 22, Page]"},{"verseKey":"36:66","text":"And if it had been Our Will, We would surely have wiped out (blinded) their eyes, so that they would struggle for the Path, how then would they see"},{"verseKey":"36:67","text":"And if it had been Our Will, We could have transformed them (into animals or lifeless objects) in their places. Then they should have been unable to go forward (move about) nor they could have turned back. [As it happened with the Jews see Verse 7:166 The Quran]"},{"verseKey":"36:68","text":"And he whom We grant long life, We reverse him in creation (weakness after strength). Will they not then understand"},{"verseKey":"36:69","text":"And We have not taught him (Muhammad SAW) poetry, nor is it meet for him. This is only a Reminder and a plain Quran"},{"verseKey":"36:70","text":"That he or it (Muhammad SAW or the Quran) may give warning to him who is living (a healthy minded the believer), and that Word (charge) may be justified against the disbelievers (dead, as they reject the warnings)"},{"verseKey":"36:71","text":"Do they not see that We have created for them of what Our Hands have created, the cattle, so that they are their owners"},{"verseKey":"36:72","text":"And We have subdued them unto them so that some of them they have for riding and some they eat"},{"verseKey":"36:73","text":"And they have (other) benefits from them (besides), and they get (milk) to drink, will they not then be grateful"},{"verseKey":"36:74","text":"And they have taken besides Allah aliha (gods), hoping that they might be helped (by those so called gods)"},{"verseKey":"36:75","text":"They cannot help them, but they will be brought forward as a troop against those who worshipped them (at the time of Reckoning)"},{"verseKey":"36:76","text":"So let not their speech, then, grieve you (O Muhammad SAW). Verily, We know what they conceal and what they reveal"},{"verseKey":"36:77","text":"Does not man see that We have created him from Nutfah (mixed male and female discharge semen drops). Yet behold! He (stands forth) as an open opponent"},{"verseKey":"36:78","text":"And he puts forth for Us a parable, and forgets his own creation. He says: \"Who will give life to these bones when they have rotted away and became dust"},{"verseKey":"36:79","text":"Say: (O Muhammad SAW) \"He will give life to them Who created them for the first time! And He is the All-Knower of every creation"},{"verseKey":"36:80","text":"He, Who produces for you fire out of the green tree, when behold! You kindle therewith"},{"verseKey":"36:81","text":"Is not He, Who created the heavens and the earth Able to create the like of them? Yes, indeed! He is the All-Knowing Supreme Creator"},{"verseKey":"36:82","text":"Verily, His Command, when He intends a thing, is only that He says to it, \"Be!\" and it is"},{"verseKey":"36:83","text":"So Glorified is He and Exalted above all that they associate with Him, and in Whose Hands is the dominion of all things, and to Him you shall be returned"}]}