{"verses":[{"verseKey":"37:1","text":"By those (angels) ranged in ranks (or rows)"},{"verseKey":"37:2","text":"By those (angels) who drive the clouds in a good way"},{"verseKey":"37:3","text":"By those (angels) who bring the Book and the Quran from Allah to mankind [Tafsir Ibn Kathir]"},{"verseKey":"37:4","text":"Verily your Ilah (God) is indeed One (i.e. Allah)"},{"verseKey":"37:5","text":"Lord of the heavens and of the earth, and all that is between them, and Lord of every point of the sun's risings. (None has the right to be worshipped but Allah)"},{"verseKey":"37:6","text":"Verily! We have adorned the near heaven with the stars (for beauty)"},{"verseKey":"37:7","text":"And to guard against every rebellious devil"},{"verseKey":"37:8","text":"They cannot listen to the higher group (angels) for they are pelted from every side"},{"verseKey":"37:9","text":"Outcast, and theirs is a constant (or painful) torment"},{"verseKey":"37:10","text":"Except such as snatch away something by stealing and they are pursued by a flaming fire of piercing brightness"},{"verseKey":"37:11","text":"Then ask them (i.e. these polytheists, O Muhammad SAW): \"Are they stronger as creation, or those (others like the heavens and the earth and the mountains, etc.) whom We have created?\" Verily, We created them of a sticky clay"},{"verseKey":"37:12","text":"Nay, you (O Muhammad SAW) wondered (at their insolence) while they mock (at you and at the Quran)"},{"verseKey":"37:13","text":"And when they are reminded, they pay no attention"},{"verseKey":"37:14","text":"And when they see an Ayah (a sign, a proof, or an evidence) from Allah, they mock at it"},{"verseKey":"37:15","text":"And they say: \"This is nothing but evident magic"},{"verseKey":"37:16","text":"When we are dead and have become dust and bones, shall we (then) verily be resurrected"},{"verseKey":"37:17","text":"And also our fathers of old"},{"verseKey":"37:18","text":"Say (O Muhammad SAW): \"Yes, and you shall then be humiliated"},{"verseKey":"37:19","text":"It will be a single Zajrah [shout (i.e. the second blowing of the Trumpet)], and behold, they will be staring"},{"verseKey":"37:20","text":"They will say: \"Woe to us! This is the Day of Recompense"},{"verseKey":"37:21","text":"(It will be said): \"This is the Day of Judgement which you used to deny"},{"verseKey":"37:22","text":"(It will be said to the angels): \"Assemble those who did wrong, together with their companions (from the devils) and what they used to worship"},{"verseKey":"37:23","text":"Instead of Allah, and lead them on to the way of flaming Fire (Hell)"},{"verseKey":"37:24","text":"But stop them, verily they are to be questioned"},{"verseKey":"37:25","text":"What is the matter with you? Why do you not help one another (as you used to do in the world)"},{"verseKey":"37:26","text":"Nay, but that Day they shall surrender"},{"verseKey":"37:27","text":"And they will turn to one another and question one another"},{"verseKey":"37:28","text":"They will say: \"It was you who used to come to us from the right side [i.e. from the right side of one of us and beautify for us every evil, order us for polytheism, and stop us from the truth i.e. Islamic Monotheism and from every good deed]"},{"verseKey":"37:29","text":"They will reply: \"Nay, you yourselves were not believers"},{"verseKey":"37:30","text":"And we had no authority over you. Nay! But you were transgressing people (disobedient, polytheists, and disbelievers)"},{"verseKey":"37:31","text":"So now the Word of our Lord has been justified against us, that we shall certainly (have to) taste (the torment)"},{"verseKey":"37:32","text":"So we led you astray because we were ourselves astray"},{"verseKey":"37:33","text":"Then verily, that Day, they will (all) share in the torment"},{"verseKey":"37:34","text":"Certainly, that is how We deal with Al-Mujrimun (polytheists, sinners, criminals, the disobedient to Allah, etc)"},{"verseKey":"37:35","text":"Truly, when it was said to them: La ilaha ill-Allah \"(none has the right to be worshipped but Allah),\" they puffed themselves up with pride (i.e. denied it)"},{"verseKey":"37:36","text":"And (they) said: \"Are we going to abandon our aliha (gods) for the sake of a mad poet"},{"verseKey":"37:37","text":"Nay! he (Muhammad SAW) has come with the truth (i.e. Allah's Religion - Islamic Monotheism and this Quran) and he confirms the Messengers (before him who brought Allah's religion - Islamic Monotheism)"},{"verseKey":"37:38","text":"Verily, you (pagans of Makkah) are going to taste the painful torment"},{"verseKey":"37:39","text":"And you will be requited nothing except for what you used to do (evil deeds, sins, and Allah's disobedience which you used to do in this world)"},{"verseKey":"37:40","text":"Save the chosen slaves of Allah (faithful, obedient, true believers of Islamic Monotheism)"},{"verseKey":"37:41","text":"For them there will be a known provision (in Paradise)"},{"verseKey":"37:42","text":"Fruits; and they shall be honoured"},{"verseKey":"37:43","text":"In the Gardens of delight (Paradise)"},{"verseKey":"37:44","text":"Facing one another on thrones"},{"verseKey":"37:45","text":"Round them will be passed a cup of pure wine"},{"verseKey":"37:46","text":"White, delicious to the drinkers"},{"verseKey":"37:47","text":"Neither they will have Ghoul (any kind of hurt, abdominal pain, headache, a sin, etc.) from that, nor will they suffer intoxication therefrom"},{"verseKey":"37:48","text":"And with them will be chaste females, restraining their glances (desiring none except their husbands), with wide and beautiful eyes"},{"verseKey":"37:49","text":"(Delicate and pure) as if they were (hidden) eggs (well) preserved"},{"verseKey":"37:50","text":"Then they will turn to one another, mutually questioning"},{"verseKey":"37:51","text":"A speaker of them will say: \"Verily, I had a companion (in the world)"},{"verseKey":"37:52","text":"Who used to say: \"Are you among those who believe (in resurrection after death)"},{"verseKey":"37:53","text":"(That) when we die and become dust and bones, shall we indeed (be raised up) to receive reward or punishment (according to our deeds)"},{"verseKey":"37:54","text":"(The man) said: \"Will you look down"},{"verseKey":"37:55","text":"So he looked down and saw him in the midst of the Fire"},{"verseKey":"37:56","text":"He said: \"By Allah! You have nearly ruined me"},{"verseKey":"37:57","text":"Had it not been for the Grace of my Lord, I would certainly have been among those brought forth (to Hell)"},{"verseKey":"37:58","text":"(Allah informs about that true believer that he said): \"Are we then not to die (any more)"},{"verseKey":"37:59","text":"Except our first death, and we shall not be punished? (after we have entered Paradise)"},{"verseKey":"37:60","text":"Truly, this is the supreme success"},{"verseKey":"37:61","text":"For the like of this let the workers work"},{"verseKey":"37:62","text":"Is that (Paradise) better entertainment or the tree of Zaqqum (a horrible tree in Hell)"},{"verseKey":"37:63","text":"Truly We have made it (as) a trail for the Zalimun (polytheists, disbelievers, wrong-doers, etc)"},{"verseKey":"37:64","text":"Verily, it is a tree that springs out of the bottom of Hell-fire"},{"verseKey":"37:65","text":"The shoots of its fruit-stalks are like the heads of Shayatin (devils)"},{"verseKey":"37:66","text":"Truly, they will eat thereof and fill their bellies therewith"},{"verseKey":"37:67","text":"Then on the top of that they will be given boiling water to drink so that it becomes a mixture (of boiling water and Zaqqum in their bellies)"},{"verseKey":"37:68","text":"Then thereafter, verily, their return is to the flaming fire of Hell"},{"verseKey":"37:69","text":"Verily, they found their fathers on the wrong path"},{"verseKey":"37:70","text":"So they (too) made haste to follow in their footsteps"},{"verseKey":"37:71","text":"And indeed most of the men of old went astray before them"},{"verseKey":"37:72","text":"And indeed We sent among them warners (Messengers)"},{"verseKey":"37:73","text":"Then see what was the end of those who were warned (but heeded not)"},{"verseKey":"37:74","text":"Except the chosen slaves of Allah (faithful, obedient, and true believers of Islamic Monotheism)"},{"verseKey":"37:75","text":"And indeed Nuh (Noah) invoked Us, and We are the Best of those who answer (the request)"},{"verseKey":"37:76","text":"And We rescued him and his family from the great distress (i.e. drowning)"},{"verseKey":"37:77","text":"And, his progeny, them We made the survivors (i.e. Shem, Ham and Japheth)"},{"verseKey":"37:78","text":"And left for him (a goodly remembrance) among generations to come in later times"},{"verseKey":"37:79","text":"Salamun (peace) be upon Nuh (Noah) (from Us) among the 'Alamin (mankind, jinns and all that exists)"},{"verseKey":"37:80","text":"Verily, thus We reward the Muhsinun (good-doers - see V)"},{"verseKey":"37:81","text":"Verily, he [Nuh (Noah)] was one of Our believing slaves"},{"verseKey":"37:82","text":"Then We drowned the other (disbelievers and polytheists, etc)"},{"verseKey":"37:83","text":"And, verily, among those who followed his [Nuh's (Noah)] way (Islamic Monotheism) was Ibrahim (Abraham)"},{"verseKey":"37:84","text":"When he came to his Lord with a pure heart [attached to Allah Alone and none else, worshipping none but Allah Alone true Islamic Monotheism, pure from the filth of polytheism]"},{"verseKey":"37:85","text":"When he said to his father and to his people: \"What is it that which you worship"},{"verseKey":"37:86","text":"Is it a falsehood aliha (gods) other than Allah that you seek"},{"verseKey":"37:87","text":"Then what do you think about the Lord of the 'Alamin (mankind, jinns, and all that exists)"},{"verseKey":"37:88","text":"Then he cast a glance at the stars (to deceive them)"},{"verseKey":"37:89","text":"And he said: \"Verily, I am sick (with plague. He did this trick to remain in their temple of idols to destroy them and not to accompany them to the pagan's feast)"},{"verseKey":"37:90","text":"So they turned away from him, and departed (for fear of the disease)"},{"verseKey":"37:91","text":"Then he turned to their aliha (gods) and said: \"Will you not eat (of the offering before you)"},{"verseKey":"37:92","text":"What is the matter with you that you speak not"},{"verseKey":"37:93","text":"Then he turned upon them, striking (them) with (his) right hand"},{"verseKey":"37:94","text":"Then they (the worshippers of idols) came, towards him, hastening"},{"verseKey":"37:95","text":"He said: \"Worship you that which you (yourselves) carve"},{"verseKey":"37:96","text":"While Allah has created you and what you make"},{"verseKey":"37:97","text":"They said: \"Build for him a building (it is said that the building was like a furnace) and throw him into the blazing fire"},{"verseKey":"37:98","text":"So they plotted a plot against him, but We made them the lowest"},{"verseKey":"37:99","text":"And he said (after his rescue from the fire): \"Verily, I am going to my Lord. He will guide me"},{"verseKey":"37:100","text":"My Lord! Grant me (offspring) from the righteous"},{"verseKey":"37:101","text":"So We gave him the glad tidings of a forbearing boy"},{"verseKey":"37:102","text":"And, when he (his son) was old enough to walk with him, he said: \"O my son! I have seen in a dream that I am slaughtering you (offer you in sacrifice to Allah), so look what you think!\" He said: \"O my father! Do that which you are commanded, Insha' Allah (if Allah will), you shall find me of As-Sabirin (the patient ones, etc)"},{"verseKey":"37:103","text":"Then, when they had both submitted themselves (to the Will of Allah), and he had laid him prostrate on his forehead (or on the side of his forehead for slaughtering)"},{"verseKey":"37:104","text":"And We called out to him: \"O Abraham"},{"verseKey":"37:105","text":"You have fulfilled the dream (vision)!\" Verily! Thus do We reward the Muhsinun (good-doers - see V)"},{"verseKey":"37:106","text":"Verily, that indeed was a manifest trial"},{"verseKey":"37:107","text":"And We ransomed him with a great sacrifice (i.e. a ram)"},{"verseKey":"37:108","text":"And We left for him (a goodly remembrance) among generations (to come) in later times"},{"verseKey":"37:109","text":"Salamun (peace) be upon Ibrahim (Abraham)"},{"verseKey":"37:110","text":"Thus indeed do We reward the Muhsinun (good-doers - see V)"},{"verseKey":"37:111","text":"Verily, he was one of Our believing slaves"},{"verseKey":"37:112","text":"And We gave him the glad tidings of Ishaque (Isaac) a Prophet from the righteous"},{"verseKey":"37:113","text":"We blessed him and Ishaque (Isaac), and of their progeny are (some) that do right, and some that plainly wrong themselves"},{"verseKey":"37:114","text":"And, indeed We gave Our Grace to Musa (Moses) and Harun (Aaron)"},{"verseKey":"37:115","text":"And We saved them and their people from the great distress"},{"verseKey":"37:116","text":"And helped them, so that they became the victors"},{"verseKey":"37:117","text":"And We gave them the clear Scripture"},{"verseKey":"37:118","text":"And guided them to the Right Path"},{"verseKey":"37:119","text":"And We left for them (a goodly remembrance) among generations (to come) in later times"},{"verseKey":"37:120","text":"Salamun (peace) be upon Musa (Moses) and Harun (Aaron)"},{"verseKey":"37:121","text":"Verily, thus do We reward the Muhsinun (good-doers - see V)"},{"verseKey":"37:122","text":"Verily! They were two of Our believing slaves"},{"verseKey":"37:123","text":"And verily, Iliyas (Elias) was one of the Messengers"},{"verseKey":"37:124","text":"When he said to his people: \"Will you not fear Allah"},{"verseKey":"37:125","text":"Will you call upon Ba'l (a well- known idol of his nation whom they used to worship) and forsake the Best of creators"},{"verseKey":"37:126","text":"Allah, your Lord and the Lord of your forefathers"},{"verseKey":"37:127","text":"But they denied him [Iliyas (Elias)], so they will certainly be brought forth (to the punishment)"},{"verseKey":"37:128","text":"Except the chosen slaves of Allah"},{"verseKey":"37:129","text":"And We left for him (a goodly remembrance) among generations (to come) in later times"},{"verseKey":"37:130","text":"Salamun (peace) be upon Ilyasin (Elias)"},{"verseKey":"37:131","text":"Verily, thus do We reward the Muhsinun (good-doers, who perform good deeds totally for Allah's sake only - see V)"},{"verseKey":"37:132","text":"Verily, he was one of Our believing slaves"},{"verseKey":"37:133","text":"And verily, Lout (Lot) was one of the Messengers"},{"verseKey":"37:134","text":"When We saved him and his family, all"},{"verseKey":"37:135","text":"Except an old woman (his wife) who was among those who remained behind"},{"verseKey":"37:136","text":"Then We destroyed the rest [i.e. the towns of Sodom at the place of the Dead Sea (now) in Palestine]. [See the \"Book of History\" by Ibn Kathir]"},{"verseKey":"37:137","text":"Verily, you pass by them in the morning"},{"verseKey":"37:138","text":"And at night; will you not then reflect"},{"verseKey":"37:139","text":"And, verily, Yunus (Jonah) was one of the Messengers"},{"verseKey":"37:140","text":"When he ran to the laden ship"},{"verseKey":"37:141","text":"He (agreed to) cast lots, and he was among the losers"},{"verseKey":"37:142","text":"Then a (big) fish swallowed him and he had done an act worthy of blame"},{"verseKey":"37:143","text":"Had he not been of them who glorify Allah"},{"verseKey":"37:144","text":"He would have indeed remained inside its belly (the fish) till the Day of Resurrection"},{"verseKey":"37:145","text":"But We cast him forth on the naked shore while he was sick"},{"verseKey":"37:146","text":"And We caused a plant of gourd to grow over him"},{"verseKey":"37:147","text":"And We sent him to a hundred thousand (people) or even more"},{"verseKey":"37:148","text":"And they believed; so We gave them enjoyment for a while"},{"verseKey":"37:149","text":"Now ask them (O Muhammad SAW): \"Are there (only) daughters for your Lord and sons for them"},{"verseKey":"37:150","text":"Or did We create the angels females while they were witnesses"},{"verseKey":"37:151","text":"Verily, it is of their falsehood that they (Quraish pagans) say"},{"verseKey":"37:152","text":"Allah has begotten off spring or children (i.e. angels are the daughters of Allah)?\" And, verily, they are liars"},{"verseKey":"37:153","text":"Has He (then) chosen daughters rather than sons"},{"verseKey":"37:154","text":"What is the matter with you? How do you decide"},{"verseKey":"37:155","text":"Will you not then remember"},{"verseKey":"37:156","text":"Or is there for you a plain authority"},{"verseKey":"37:157","text":"Then bring your Book if you are truthful"},{"verseKey":"37:158","text":"And they have invented a kinship between Him and the jinns, but the jinns know well that they have indeed to appear (before Him) (i.e. they will be brought for accounts)"},{"verseKey":"37:159","text":"Glorified is Allah! (He is Free) from what they attribute unto Him"},{"verseKey":"37:160","text":"Except the slaves of Allah, whom He choses (for His Mercy i.e. true believers of Islamic Monotheism who do not attribute false things unto Allah)"},{"verseKey":"37:161","text":"So, verily you (pagans) and those whom you worship (idols)"},{"verseKey":"37:162","text":"Cannot lead astray [turn away from Him (Allah) anyone of the believers"},{"verseKey":"37:163","text":"Except those who are predestined to burn in Hell"},{"verseKey":"37:164","text":"There is not one of us (angels) but has his known place (or position)"},{"verseKey":"37:165","text":"Verily, we (angels), we stand in rows for the prayers (as you Muslims stand in rows for your prayers)"},{"verseKey":"37:166","text":"Verily, we (angels), we are they who glorify (Allah's Praises i.e. perform prayers)"},{"verseKey":"37:167","text":"And indeed they (Arab pagans) used to say"},{"verseKey":"37:168","text":"If we had a reminder as had the men of old (before the coming of Prophet Muhammad SAW as a Messenger of Allah)"},{"verseKey":"37:169","text":"We would have indeed been the chosen slaves of Allah (true believers of Islamic Monotheism)"},{"verseKey":"37:170","text":"But (now that the Quran has come) they disbelieve therein (i.e. in the Quran and in Prophet Muhammad SAW, and all that which he brought, the Divine Revelation), so they will come to know"},{"verseKey":"37:171","text":"And, verily, Our Word has gone forth of old for Our slaves, the Messengers"},{"verseKey":"37:172","text":"That they verily would be made triumphant"},{"verseKey":"37:173","text":"And that Our hosts, they verily would be the victors"},{"verseKey":"37:174","text":"So turn away (O Muhammad SAW) from them for a while"},{"verseKey":"37:175","text":"And watch them and they shall see (the punishment)"},{"verseKey":"37:176","text":"Do they seek to hasten on Our Torment"},{"verseKey":"37:177","text":"Then, when it descends into their courtyard (i.e. near to them), evil will be the morning for those who had been warned"},{"verseKey":"37:178","text":"So turn (O Muhammad SAW) away from them for a while"},{"verseKey":"37:179","text":"And watch and they shall see (the torment)"},{"verseKey":"37:180","text":"Glorified be your Lord, the Lord of Honour and Power! (He is free) from what they attribute unto Him"},{"verseKey":"37:181","text":"And peace be on the Messengers"},{"verseKey":"37:182","text":"And all the praise and thanks be to Allah, Lord of the 'Alamin (mankind, jinns and all that exists)"}]}