{"verses":[{"verseKey":"53:1","text":"By the star when it goes down, (or vanishes)"},{"verseKey":"53:2","text":"Your companion (Muhammad SAW) has neither gone astray nor has erred"},{"verseKey":"53:3","text":"Nor does he speak of (his own) desire"},{"verseKey":"53:4","text":"It is only an Inspiration that is inspired"},{"verseKey":"53:5","text":"He has been taught (this Quran) by one mighty in power [Jibrael (Gabriel]"},{"verseKey":"53:6","text":"Dhu Mirrah (free from any defect in body and mind), Fastawa [then he (Jibrael - Gabriel) rose and became stable]. [Tafsir At-Tabari]"},{"verseKey":"53:7","text":"While he [Jibrael (Gabriel)] was in the highest part of the horizon"},{"verseKey":"53:8","text":"Then he [Jibrael (Gabriel)] approached and came closer"},{"verseKey":"53:9","text":"And was at a distance of two bows' length or (even) nearer"},{"verseKey":"53:10","text":"So did (Allah) convey the Inspiration to His slave [Muhammad SAW through Jibrael (Gabriel]"},{"verseKey":"53:11","text":"The (Prophet's) heart lied not (in seeing) what he (Muhammad SAW) saw"},{"verseKey":"53:12","text":"Will you then dispute with him (Muhammad SAW) about what he saw [during the Mi'raj: (Ascent of the Prophet SAW over the seven heavens]"},{"verseKey":"53:13","text":"And indeed he (Muhammad SAW) saw him [Jibrael (Gabriel)] at a second descent (i.e. another time)"},{"verseKey":"53:14","text":"Near Sidrat-ul-Muntaha [lote-tree of the utmost boundary (beyond which none can pass]"},{"verseKey":"53:15","text":"Near it is the Paradise of Abode"},{"verseKey":"53:16","text":"When that covered the lote-tree which did cover it"},{"verseKey":"53:17","text":"The sight (of Prophet Muhammad SAW) turned not aside (right or left), nor it transgressed beyond (the) limit (ordained for it)"},{"verseKey":"53:18","text":"Indeed he (Muhammad SAW) did see, of the Greatest Signs, of his Lord (Allah)"},{"verseKey":"53:19","text":"Have you then considered Al-Lat, and Al-'Uzza (two idols of the pagan Arabs)"},{"verseKey":"53:20","text":"And Manat (another idol of the pagan Arabs), the other third"},{"verseKey":"53:21","text":"Is it for you the males and for Him the females"},{"verseKey":"53:22","text":"That indeed is a division most unfair"},{"verseKey":"53:23","text":"They are but names which you have named, you and your fathers, for which Allah has sent down no authority. They follow but a guess and that which they themselves desire, whereas there has surely come to them the Guidance from their Lord"},{"verseKey":"53:24","text":"Or shall man have what he wishes"},{"verseKey":"53:25","text":"But to Allah belongs the last (Hereafter) and the first (the world)"},{"verseKey":"53:26","text":"And there are many angels in the heavens, whose intercession will avail nothing except after Allah has given leave for whom He wills and pleases"},{"verseKey":"53:27","text":"Verily, those who believe not in the Hereafter, name the angels with female names"},{"verseKey":"53:28","text":"While they have no knowledge thereof. They follow but a guess, and verily, guess is no substitute for the truth"},{"verseKey":"53:29","text":"Therefore withdraw (O Muhammad SAW) from him who turns away from Our Reminder (this Quran) and desires nothing but the life of this world"},{"verseKey":"53:30","text":"That is what they could reach of knowledge. Verily, your Lord it is He Who knows best him who goes astray from His Path, and He knows best him who receives guidance"},{"verseKey":"53:31","text":"And to Allah belongs all that is in the heavens and all that is in the earth, that He may requite those who do evil with that which they have done (i.e. punish them in Hell), and reward those who do good, with what is best (i.e. Paradise)"},{"verseKey":"53:32","text":"Those who avoid great sins (see the Quran, Verses: 6:152, 153) and Al-Fawahish (illegal sexual intercourse, etc.) except the small faults, verily, your Lord is of vast forgiveness. He knows you well when He created you from the earth (Adam), and when you were fetuses in your mothers' wombs. So ascribe not purity to yourselves. He knows best him who fears Allah and keep his duty to Him [i.e. those who are Al-Muttaqun (pious - see V]"},{"verseKey":"53:33","text":"Did you (O Muhammad SAW) observe him who turned away (from Islam)"},{"verseKey":"53:34","text":"And gave a little, then stopped (giving)"},{"verseKey":"53:35","text":"Is with him the knowledge of the unseen so that he sees"},{"verseKey":"53:36","text":"Or is he not informed with what is in the Pages (Scripture) of Musa (Moses)"},{"verseKey":"53:37","text":"And of Ibrahim (Abraham) who fulfilled (or conveyed) all that (what Allah ordered him to do or convey)"},{"verseKey":"53:38","text":"That no burdened person (with sins) shall bear the burden (sins) of another"},{"verseKey":"53:39","text":"And that man can have nothing but what he does (good or bad)"},{"verseKey":"53:40","text":"And that his deeds will be seen"},{"verseKey":"53:41","text":"Then he will be recompensed with a full and the best recompense"},{"verseKey":"53:42","text":"And that to your Lord (Allah) is the End (Return of everything)"},{"verseKey":"53:43","text":"And that it is He (Allah) Who makes (whom He wills) laugh, and makes (whom He wills) weep"},{"verseKey":"53:44","text":"And that it is He (Allah) Who causes death and gives life"},{"verseKey":"53:45","text":"And that He (Allah) creates the pairs, male and female"},{"verseKey":"53:46","text":"From Nutfah (drops of semen male and female discharges) when it is emitted"},{"verseKey":"53:47","text":"And that upon Him (Allah) is another bringing forth (Resurrection)"},{"verseKey":"53:48","text":"And that it is He (Allah) Who gives much or a little (or gives wealth and contentment)"},{"verseKey":"53:49","text":"And that He (Allah) is the Lord of Sirius (the star which the pagan Arabs used to worship)"},{"verseKey":"53:50","text":"And that it is He (Allah) Who destroyed the former 'Ad (people)"},{"verseKey":"53:51","text":"And Thamud (people). He spared none of them"},{"verseKey":"53:52","text":"And the people of Nuh (Noah) aforetime, verily, they were more unjust and more rebellious and transgressing [in disobeying Allah and His Messenger Nuh (Noah]"},{"verseKey":"53:53","text":"And He destroyed the overthrown cities [of Sodom to which Prophet Lout (Lot) was sent"},{"verseKey":"53:54","text":"So there covered them that which did cover (i.e. torment with stones)"},{"verseKey":"53:55","text":"Then which of the Graces of your Lord (O man!) will you doubt"},{"verseKey":"53:56","text":"This (Muhammad SAW) is a warner (Messenger) of the (series of) warners (Messengers) of old"},{"verseKey":"53:57","text":"The Day of Resurrection draws near"},{"verseKey":"53:58","text":"None besides Allah can avert it, (or advance it, or delay it)"},{"verseKey":"53:59","text":"Do you then wonder at this recital (the Quran)"},{"verseKey":"53:60","text":"And you laugh at it and weep not"},{"verseKey":"53:61","text":"Wasting your (precious) lifetime in pastime and amusements (singing, etc)"},{"verseKey":"53:62","text":"So fall you down in prostration to Allah, and worship Him (Alone)"}]}