{"verses":[{"verseKey":"56:1","text":"When the Event (i.e. the Day of Resurrection) befalls"},{"verseKey":"56:2","text":"And there can be no denying of its befalling"},{"verseKey":"56:3","text":"It will bring low (some); (and others) it will exalt"},{"verseKey":"56:4","text":"When the earth will be shaken with a terrible shake"},{"verseKey":"56:5","text":"And the mountains will be powdered to dust"},{"verseKey":"56:6","text":"So that they will become floating dust particles"},{"verseKey":"56:7","text":"And you (all) will be in three kinds (i.e. separate groups)"},{"verseKey":"56:8","text":"So those on the Right Hand (i.e. those who will be given their Records in their right hands), Who will be those on the Right Hand? (As a respect for them, because they will enter Paradise)"},{"verseKey":"56:9","text":"And those on the Left Hand (i.e. those who will be given their Record in their left hands), Who will be those on the Left Hand? (As a disgrace for them, because they will enter Hell)"},{"verseKey":"56:10","text":"And those foremost [(in Islamic Faith of Monotheism and in performing righteous deeds) in the life of this world on the very first call for to embrace Islam,] will be foremost (in Paradise)"},{"verseKey":"56:11","text":"These will be those nearest to Allah"},{"verseKey":"56:12","text":"In the Gardens of delight (Paradise)"},{"verseKey":"56:13","text":"A multitude of those (foremost) will be from the first generations (who embraced Islam)"},{"verseKey":"56:14","text":"And a few of those (foremost) will be from the later time (generations)"},{"verseKey":"56:15","text":"(They will be) on thrones woven with gold and precious stones"},{"verseKey":"56:16","text":"Reclining thereon, face to face"},{"verseKey":"56:17","text":"They will be served by immortal boys"},{"verseKey":"56:18","text":"With cups, and jugs, and a glass from the flowing wine"},{"verseKey":"56:19","text":"Wherefrom they will get neither any aching of the head, nor any intoxication"},{"verseKey":"56:20","text":"And fruit; that they may choose"},{"verseKey":"56:21","text":"And the flesh of fowls that they desire"},{"verseKey":"56:22","text":"And (there will be) Houris (fair females) with wide, lovely eyes (as wives for the pious)"},{"verseKey":"56:23","text":"Like unto preserved pearls"},{"verseKey":"56:24","text":"A reward for what they used to do"},{"verseKey":"56:25","text":"No Laghw (dirty, false, evil vain talk) will they hear therein, nor any sinful speech (like backbiting, etc)"},{"verseKey":"56:26","text":"But only the saying of: Salam!, Salam! (greetings with peace)"},{"verseKey":"56:27","text":"And those on the Right Hand, Who will be those on the Right Hand"},{"verseKey":"56:28","text":"(They will be) among thornless lote-trees"},{"verseKey":"56:29","text":"Among Talh (banana-trees) with fruits piled one above another"},{"verseKey":"56:30","text":"In shade long-extended"},{"verseKey":"56:31","text":"By water flowing constantly"},{"verseKey":"56:32","text":"And fruit in plenty"},{"verseKey":"56:33","text":"Whose season is not limited, and their supply will not be cut off"},{"verseKey":"56:34","text":"And on couches or thrones, raised high"},{"verseKey":"56:35","text":"Verily, We have created them (maidens) of special creation"},{"verseKey":"56:36","text":"And made them virgins"},{"verseKey":"56:37","text":"Loving (their husbands only), equal in age"},{"verseKey":"56:38","text":"For those on the Right Hand"},{"verseKey":"56:39","text":"A multitude of those (on the Right Hand) will be from the first generation (who embraced Islam)"},{"verseKey":"56:40","text":"And a multitude of those (on the Right Hand) will be from the later times (generations)"},{"verseKey":"56:41","text":"And those on the Left Hand Who will be those on the Left Hand"},{"verseKey":"56:42","text":"In fierce hot wind and boiling water"},{"verseKey":"56:43","text":"And shadow of black smoke"},{"verseKey":"56:44","text":"(That shadow) neither cool, nor (even) good"},{"verseKey":"56:45","text":"Verily, before that, they indulged in luxury"},{"verseKey":"56:46","text":"And were persisting in great sin (joining partners in worship along with Allah, committing murders and other crimes, etc)"},{"verseKey":"56:47","text":"And they used to say: \"When we die and become dust and bones, shall we then indeed be resurrected"},{"verseKey":"56:48","text":"And also our forefathers"},{"verseKey":"56:49","text":"Say (O Muhammad SAW): \"(Yes) verily, those of old, and those of later times"},{"verseKey":"56:50","text":"All will surely be gathered together for appointed Meeting of a known Day"},{"verseKey":"56:51","text":"Then moreover, verily, you the erring-ones, the deniers (of Resurrection)"},{"verseKey":"56:52","text":"You verily will eat of the trees of Zaqqum"},{"verseKey":"56:53","text":"Then you will fill your bellies therewith"},{"verseKey":"56:54","text":"And drink boiling water on top of it"},{"verseKey":"56:55","text":"So you will drink (that) like thirsty camels"},{"verseKey":"56:56","text":"That will be their entertainment on the Day of Recompense"},{"verseKey":"56:57","text":"We created you, then why do you believe not"},{"verseKey":"56:58","text":"Then tell Me (about) the human semen that you emit"},{"verseKey":"56:59","text":"Is it you who create it (i.e. make this semen into a perfect human being), or are We the Creator"},{"verseKey":"56:60","text":"We have decreed death to you all, and We are not unable"},{"verseKey":"56:61","text":"To transfigure you and create you in (forms) that you know not"},{"verseKey":"56:62","text":"And indeed, you have already known the first form of creation (i.e. the creation of Adam), why then do you not remember or take heed"},{"verseKey":"56:63","text":"Tell Me! The seed that you sow in the ground"},{"verseKey":"56:64","text":"Is it you that make it grow, or are We the Grower"},{"verseKey":"56:65","text":"Were it Our Will, We could crumble it to dry pieces, and you would be regretful (or left in wonderment)"},{"verseKey":"56:66","text":"(Saying): \"We are indeed Mughramun (i.e. ruined or lost the money without any profit, or punished by the loss of all that we spend for cultivation, etc.)! [See Tafsir Al-Qurtubi, Vol. 17, Page]"},{"verseKey":"56:67","text":"Nay, but we are deprived"},{"verseKey":"56:68","text":"Tell Me! The water that you drink"},{"verseKey":"56:69","text":"Is it you who cause it from the rainclouds to come down, or are We the Causer of it to come down"},{"verseKey":"56:70","text":"If We willed, We verily could make it salt (and undrinkable), why then do you not give thanks (to Allah)"},{"verseKey":"56:71","text":"Tell Me! The fire which you kindle"},{"verseKey":"56:72","text":"Is it you who made the tree thereof to grow, or are We the Grower"},{"verseKey":"56:73","text":"We have made it a Reminder (for the Hell-fire, in the Hereafter); and an article of use for the travellers (and all the others, in this world)"},{"verseKey":"56:74","text":"Then glorify with praises the Name of your Lord, the Most Great"},{"verseKey":"56:75","text":"So I swear by Mawaqi (setting or the mansions, etc.) of the stars (they traverse)"},{"verseKey":"56:76","text":"And verily, that is indeed a great oath, if you but know"},{"verseKey":"56:77","text":"That (this) is indeed an honourable recital (the Noble Quran)"},{"verseKey":"56:78","text":"In a Book well-guarded (with Allah in the heaven i.e. Al-Lauh Al-Mahfuz)"},{"verseKey":"56:79","text":"Which (that Book with Allah) none can touch but the purified (i.e. the angels)"},{"verseKey":"56:80","text":"A Revelation (this Quran) from the Lord of the 'Alamin (mankind, jinns and all that exists)"},{"verseKey":"56:81","text":"Is it such a talk (this Quran) that you (disbelievers) deny"},{"verseKey":"56:82","text":"And instead (of thanking Allah) for the provision He gives you, on the contrary, you deny Him (by disbelief)"},{"verseKey":"56:83","text":"Then why do you not (intervene) when (the soul of a dying person) reaches the throat"},{"verseKey":"56:84","text":"And you at the moment are looking on"},{"verseKey":"56:85","text":"But We (i.e. Our angels who take the soul) are nearer to him than you, but you see not, [Tafsir At-Tabari, Vol. 27, Page]"},{"verseKey":"56:86","text":"Then why do you not, if you are exempt from the reckoning and recompense (punishment, etc)"},{"verseKey":"56:87","text":"Bring back the soul (to its body), if you are truthful"},{"verseKey":"56:88","text":"Then, if he (the dying person) be of the Muqarrabun (those brought near to Allah)"},{"verseKey":"56:89","text":"(There is for him) rest and provision, and a Garden of delights (Paradise)"},{"verseKey":"56:90","text":"And if he (the dying person) be of those on the Right Hand"},{"verseKey":"56:91","text":"Then there is safety and peace (from the Punishment of Allah) for (you as you are from) those on the Right Hand"},{"verseKey":"56:92","text":"But if he (the dying person) be of the denying (of the Resurrection), the erring (away from the Right Path of Islamic Monotheism)"},{"verseKey":"56:93","text":"Then for him is entertainment with boiling water"},{"verseKey":"56:94","text":"And burning in Hell-fire"},{"verseKey":"56:95","text":"Verily, this! This is an absolute Truth with certainty"},{"verseKey":"56:96","text":"So glorify with praises the Name of your Lord, the Most Great"}]}