{"verses":[{"verseKey":"71:1","text":"Verily, We sent Nuh (Noah) to his people (Saying): \"Warn your people before there comes to them a painful torment"},{"verseKey":"71:2","text":"He said: \"O my people! Verily, I am a plain warner to you"},{"verseKey":"71:3","text":"That you should worship Allah (Alone), be dutiful to Him, and obey me"},{"verseKey":"71:4","text":"He (Allah) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but knew"},{"verseKey":"71:5","text":"He said: \"O my Lord! Verily, I have called my people night and day (i.e. secretly and openly to accept the doctrine of Islamic Monotheism)"},{"verseKey":"71:6","text":"But all my calling added nothing but to (their) flight (from the truth)"},{"verseKey":"71:7","text":"And verily! Every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted (in their refusal), and magnified themselves in pride"},{"verseKey":"71:8","text":"Then verily, I called to them openly (aloud)"},{"verseKey":"71:9","text":"Then verily, I proclaimed to them in public, and I have appealed to them in private"},{"verseKey":"71:10","text":"I said (to them): 'Ask forgiveness from your Lord; Verily, He is Oft-Forgiving"},{"verseKey":"71:11","text":"He will send rain to you in abundance"},{"verseKey":"71:12","text":"And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers"},{"verseKey":"71:13","text":"What is the matter with you, [that you fear not Allah (His punishment), and] you hope not for reward (from Allah or you believe not in His Oneness)"},{"verseKey":"71:14","text":"While He has created you in (different) stages [i.e. first Nutfah, then 'Alaqah and then Mudghah, see (VV. 23:13, 14) the Quran"},{"verseKey":"71:15","text":"See you not how Allah has created the seven heavens one above another"},{"verseKey":"71:16","text":"And has made the moon a light therein, and made the sun a lamp"},{"verseKey":"71:17","text":"And Allah has brought you forth from the (dust of) earth. [Tafsir At-Tabari, Vol. 29, Page]"},{"verseKey":"71:18","text":"Afterwards He will return you into it (the earth), and bring you forth (again on the Day of Resurrection)"},{"verseKey":"71:19","text":"And Allah has made for you the earth wide spread (an expanse)"},{"verseKey":"71:20","text":"That you may go about therein in broad roads"},{"verseKey":"71:21","text":"Nuh (Noah) said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but only loss"},{"verseKey":"71:22","text":"And they have plotted a mighty plot"},{"verseKey":"71:23","text":"And they have said: 'You shall not leave your gods, nor shall you leave Wadd, nor Suwa', nor Yaghuth, nor Ya'uq, nor Nasr (names of the idols)"},{"verseKey":"71:24","text":"And indeed they have led many astray. And (O Allah): 'Grant no increase to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) save error"},{"verseKey":"71:25","text":"Because of their sins they were drowned, then were made to enter the Fire, and they found none to help them instead of Allah"},{"verseKey":"71:26","text":"And Nuh (Noah) said: \"My Lord! Leave not one of the disbelievers on the earth"},{"verseKey":"71:27","text":"If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers"},{"verseKey":"71:28","text":"My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) grant You no increase but destruction"}]}