{"verses":[{"verseKey":"77:1","text":"By the winds (or angels or the Messengers of Allah) sent forth one after another"},{"verseKey":"77:2","text":"And by the winds that blow violently"},{"verseKey":"77:3","text":"And by the winds that scatter clouds and rain"},{"verseKey":"77:4","text":"And by the Verses (of the Quran) that separate the right from the wrong"},{"verseKey":"77:5","text":"And by the angels that bring the revelations to the Messengers"},{"verseKey":"77:6","text":"To cut off all excuses or to warn"},{"verseKey":"77:7","text":"Surely, what you are promised must come to pass"},{"verseKey":"77:8","text":"Then when the stars lose their lights"},{"verseKey":"77:9","text":"And when the heaven is cleft asunder"},{"verseKey":"77:10","text":"And when the mountains are blown away"},{"verseKey":"77:11","text":"And when the Messengers are gathered to their time appointed"},{"verseKey":"77:12","text":"For what Day are these signs postponed"},{"verseKey":"77:13","text":"For the Day of sorting out (the men of Paradise from the men destined for Hell)"},{"verseKey":"77:14","text":"And what will explain to you what is the Day of sorting out"},{"verseKey":"77:15","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:16","text":"Did We not destroy the ancients"},{"verseKey":"77:17","text":"So shall We make later generations to follow them"},{"verseKey":"77:18","text":"Thus do We deal with the Mujrimun (polytheists, disbelievers, sinners, criminals, etc)"},{"verseKey":"77:19","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:20","text":"Did We not create you from a worthless water (semen, etc)"},{"verseKey":"77:21","text":"Then We placed it in a place of safety (womb)"},{"verseKey":"77:22","text":"For a known period (determined by gestation)"},{"verseKey":"77:23","text":"So We did measure, and We are the Best to measure (the things)"},{"verseKey":"77:24","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:25","text":"Have We not made the earth a receptacle"},{"verseKey":"77:26","text":"For the living and the dead"},{"verseKey":"77:27","text":"And have placed therein firm, and tall mountains; and have given you to drink sweet water"},{"verseKey":"77:28","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:29","text":"(It will be said to the disbelievers): \"Depart you to that which you used to deny"},{"verseKey":"77:30","text":"Depart you to a shadow (of Hell-fire smoke ascending) in three columns"},{"verseKey":"77:31","text":"Neither shading, nor of any use against the fierce flame of the Fire"},{"verseKey":"77:32","text":"Verily! It (Hell) throws sparks (huge) as Al-Qasr [a fort or a Qasr (huge log of wood]"},{"verseKey":"77:33","text":"As if they were Jimalatun Sufr (yellow camels or bundles of ropes)"},{"verseKey":"77:34","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:35","text":"That will be a Day when they shall not speak (during some part of it)"},{"verseKey":"77:36","text":"And they will not be permitted to put forth any excuse"},{"verseKey":"77:37","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:38","text":"That will be a Day of Decision! We have brought you and the men of old together"},{"verseKey":"77:39","text":"So if you have a plot, use it against Me (Allah)"},{"verseKey":"77:40","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:41","text":"Verily, the Muttaqun (pious - see V. 2:2) shall be amidst shades and springs"},{"verseKey":"77:42","text":"And fruits, such as they desire"},{"verseKey":"77:43","text":"Eat and drink comfortably for that which you used to do"},{"verseKey":"77:44","text":"Verily, thus We reward the Muhsinun (good-doers)"},{"verseKey":"77:45","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:46","text":"(O you disbelievers)! Eat and enjoy yourselves (in this worldly life) for a little while. Verily, you are the Mujrimun (polytheists, disbelievers, sinners, criminals, etc)"},{"verseKey":"77:47","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:48","text":"And when it is said to them: \"Bow down yourself (in prayer)!\" They bow not down (offer not their prayers)"},{"verseKey":"77:49","text":"Woe that Day to the deniers (of the Day of Resurrection)"},{"verseKey":"77:50","text":"Then in what statement after this (the Quran) will they believe"}]}