{"verses":[{"verseKey":"85:1","text":"By the heaven, holding the big stars"},{"verseKey":"85:2","text":"And by the Promised Day (i.e. the Day of Resurrection)"},{"verseKey":"85:3","text":"And by the witnessing day (i.e. Friday), and by the witnessed day [i.e. the day of 'Arafat (Hajj) the ninth of Dhul-Hijjah"},{"verseKey":"85:4","text":"Cursed were the people of the ditch (the story of the Boy and the King)"},{"verseKey":"85:5","text":"Fire supplied (abundantly) with fuel"},{"verseKey":"85:6","text":"When they sat by it (fire)"},{"verseKey":"85:7","text":"And they witnessed what they were doing against the believers (i.e. burning them)"},{"verseKey":"85:8","text":"They had nothing against them, except that they believed in Allah, the All-Mighty, Worthy of all Praise"},{"verseKey":"85:9","text":"Who, to Whom belongs the dominion of the heavens and the earth! And Allah is Witness over everything"},{"verseKey":"85:10","text":"Verily, those who put into trial the believing men and believing women (by torturing them and burning them), and then do not turn in repentance, (to Allah), will have the torment of Hell, and they will have the punishment of the burning Fire"},{"verseKey":"85:11","text":"Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow (Paradise). That is the great success"},{"verseKey":"85:12","text":"Verily, (O Muhammad (Peace be upon him)) the Grip (Punishment) of your Lord is severe"},{"verseKey":"85:13","text":"Verily, He it is Who begins (punishment) and repeats (punishment in the Hereafter) (or originates the creation of everything, and then repeats it on the Day of Resurrection)"},{"verseKey":"85:14","text":"And He is Oft-Forgiving, full of love (towards the pious who are real true believers of Islamic Monotheism)"},{"verseKey":"85:15","text":"Owner of the throne, the Glorious"},{"verseKey":"85:16","text":"He does what He intends (or wills)"},{"verseKey":"85:17","text":"Has the story reached you of the hosts"},{"verseKey":"85:18","text":"Of Fir'aun (Pharaoh) and Thamud"},{"verseKey":"85:19","text":"Nay! The disbelievers (persisted) in denying (Prophet Muhammad (Peace be upon him) and his Message of Islamic Monotheism"},{"verseKey":"85:20","text":"And Allah encompasses them from behind! (i.e. all their deeds are within His Knowledge, and He will requite them for their deeds)"},{"verseKey":"85:21","text":"Nay! This is a Glorious Quran"},{"verseKey":"85:22","text":"(Inscribed) in Al-Lauh Al-Mahfuz (The Preserved Tablet)"}]}