{"collection":"tirmidhi","collectionName":"Jami at-Tirmidhi","book":5,"bookName":"The Book on the Two Eids","hadiths":[{"id":1,"hadithNumber":"1","text":"\"It is from the SUnnah to leave for the Eid walking, and to eat something before leaving.\"","grade":null,"narratedBy":"Ali bin Abi Talib narrated:"},{"id":2,"hadithNumber":"2","text":"\"Allah's Messenger, Abu Bakr, and Umar would pray during the two Eid before the Khutbah, then they would give the Khutbah.\"","grade":null,"narratedBy":"Ibn Umar narrated:"},{"id":3,"hadithNumber":"3","text":"\"I prayed the two Eid prayers with the Prophet - not one time, not two times - without and Adhan nor an Iqamah.\"","grade":null,"narratedBy":"Jabir bin Samurah narrated:"},{"id":4,"hadithNumber":"4","text":"\"For the two Eid and the Friday prayer, the Prophet would recite: Glorify the Name of your Lord, the Most High, and Has there come to you the narration of the overwhelming? And sometimes they would occur on he same day, so he would recite the two of them.\"","grade":null,"narratedBy":"An-Numan bin Bashir narrated:"},{"id":5,"hadithNumber":"5","text":"\"Umar bin Al-Khattab asked Abu Waqid Al-Laithi what Allah's Messenger would recite during Al-Fitr and Al-Adha, so he said: 'He would recite: Qaf, By the Glorious Quran and the Hour has drawn near, and the moon has been cleft asunder.'\"","grade":null,"narratedBy":"Ubaidullah bin Abdullah bin Utbah narrated:"},{"id":6,"hadithNumber":"6","text":"There is a another chain with similar narration.","grade":null,"narratedBy":"Ubaidullah bin Abdullah bin Utbah:"},{"id":7,"hadithNumber":"7","text":"\"The Prophet said the Takbir in the first (Rak'ah) sever (times) before the recitation, and in the last, five (times) before the recitation.\"","grade":null,"narratedBy":"Kathir bin Abdullah narrated from this father, from his grandfather:"},{"id":8,"hadithNumber":"8","text":"\"The Prophet went out on the day of Al-Fitr, so he prayed two Rak'ah, then he did not pray before it nor after it.\"","grade":null,"narratedBy":"Ibn Abbas narrated:"},{"id":9,"hadithNumber":"9","text":"\"He went out on the day of Eid, and he did not pray before it nor after it. He mentioned that the Prophet did so.\"","grade":null,"narratedBy":"Abu Bakr bin Hafs - and he is Ibn Umar bin Sa'd bin Abi Waqas - narrated about Ibn Umar, that:"},{"id":10,"hadithNumber":"10","text":"\"Allah's Messenger would order the virgins, the mature women, the secluded and the menstruating to go out for the two Eid. As for the menstruating women, they were to stay away from the Musalla and participate in the Muslims supplications.\" One of them said: 'O Messenger of Allah! What if she does not have a Jilbab? He said: 'Then let her sis lend her a Jilbab.'\"","grade":null,"narratedBy":"Umm Atiyyah narrated:"},{"id":11,"hadithNumber":"11","text":"with another chain.","grade":null,"narratedBy":"There is a similar narration from Umm Atiyyah :"},{"id":12,"hadithNumber":"12","text":"\"When Allah's Messenger would go out on the day of Eid by one route, he would return by another.\"","grade":null,"narratedBy":"Abu Hurairah narrated:"},{"id":13,"hadithNumber":"13","text":"\"The Prophet would not leave on the Day of Fitr until he ate, and he would not eat on the day of Adha until he prayed.\"","grade":null,"narratedBy":"Abdullah bin Buraidah narrated from his father:"},{"id":14,"hadithNumber":"14","text":"\"The Prophet would have a breakfast of dates on the Day of Fitr before leaving for the Musalla.\"","grade":null,"narratedBy":"Anas bin Malik narrated:"}]}