{"collection":"tirmidhi","collectionName":"Jami at-Tirmidhi","book":17,"bookName":"The Book on Legal Punishments (Al-Hudud)","hadiths":[{"id":1,"hadithNumber":"1","text":"That the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"","grade":null,"narratedBy":"Narrated 'Ali:"},{"id":2,"hadithNumber":"2","text":"that the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"","grade":null,"narratedBy":"Narrated 'Aishah:"},{"id":3,"hadithNumber":"3","text":"(Another chain) which is similar to the narration of Muhammad bin Rabi'ah (a narrator in no.1424) but he did not narrate it in Marfu' form.","grade":null,"narratedBy":null},{"id":4,"hadithNumber":"4","text":"That the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"","grade":null,"narratedBy":"Narrated Abu Hurairah:"},{"id":5,"hadithNumber":"5","text":"\"It has been narrated to me from Abu Salih, from Abu Hurairah, from the Prophet (ﷺ),\" and it is similar. \n(Another chain) for this Hadith.","grade":null,"narratedBy":"Asbat bin Muhammad reported it from Al-A'mash who said:"},{"id":6,"hadithNumber":"6","text":"That the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":7,"hadithNumber":"7","text":"That the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.","grade":null,"narratedBy":"Narrated Ibn 'Abbas:"},{"id":8,"hadithNumber":"8","text":"\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: ' I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"","grade":null,"narratedBy":"Narrated Abu Hurairah:"},{"id":9,"hadithNumber":"9","text":"\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.","grade":null,"narratedBy":"Narrated Jabir bin 'Abdullah:"},{"id":10,"hadithNumber":"10","text":"\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"","grade":null,"narratedBy":"Narrated 'Aishah:"},{"id":11,"hadithNumber":"11","text":"\"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"","grade":null,"narratedBy":"'Umar bin Al-Khattab said:"},{"id":12,"hadithNumber":"12","text":"\"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"","grade":null,"narratedBy":"'Umar bin Al-Khattab said:"},{"id":13,"hadithNumber":"13","text":"That he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.","grade":null,"narratedBy":"Narrated 'Ubaidullah bin 'Abdullah bin 'Uthbah:"},{"id":14,"hadithNumber":"14","text":"(Another chain) with similar.","grade":null,"narratedBy":null},{"id":15,"hadithNumber":"15","text":"(Another chain) with similar.","grade":null,"narratedBy":null},{"id":16,"hadithNumber":"16","text":"\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"","grade":null,"narratedBy":"Narrated 'Ubadah bin As-Samit:"},{"id":17,"hadithNumber":"17","text":"\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"","grade":null,"narratedBy":"Narrated 'Imran bin Husain:"},{"id":18,"hadithNumber":"18","text":"That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":19,"hadithNumber":"19","text":"That the Prophet (ﷺ) stoned a Jew and a Jewess.","grade":null,"narratedBy":"Narrated Jabir bin Samurah:"},{"id":20,"hadithNumber":"20","text":"That the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":21,"hadithNumber":"21","text":"that Aby Bakr lashed and banished, and that 'Umar lashed and banished.","grade":null,"narratedBy":"Some of them reported this Hadith from 'Ubaidullah, from Nafi', from Ibn 'Umar:"},{"id":22,"hadithNumber":"22","text":"\"We were with the Prophet (ﷺ)  partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"","grade":null,"narratedBy":"Narrated 'Ubadah bin As-Samit:"},{"id":23,"hadithNumber":"23","text":"That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"","grade":null,"narratedBy":"Narrated Abu Hurairah:"},{"id":24,"hadithNumber":"24","text":"\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"","grade":null,"narratedBy":"Narrated Abu 'Abdur-Rahman As-Sulami:"},{"id":25,"hadithNumber":"25","text":"That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"","grade":null,"narratedBy":"Narrated Abu Sa'eed Al-Khudri:"},{"id":26,"hadithNumber":"26","text":"That a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.","grade":null,"narratedBy":"Narrated Anas:"},{"id":27,"hadithNumber":"27","text":"That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"","grade":null,"narratedBy":"Narrated Mu'awiyah:"},{"id":28,"hadithNumber":"28","text":"That the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.","grade":null,"narratedBy":"Narrated 'Aishah:"},{"id":29,"hadithNumber":"29","text":"\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":30,"hadithNumber":"30","text":"\"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"","grade":null,"narratedBy":"'Abdur-Rahman bin Muhariz said:"},{"id":31,"hadithNumber":"31","text":"That the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"","grade":null,"narratedBy":"Narrated Jabir :"},{"id":32,"hadithNumber":"32","text":"That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"","grade":null,"narratedBy":"Narrated Rafi' bin Khadij:"},{"id":33,"hadithNumber":"33","text":"That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"","grade":null,"narratedBy":"Narrated Busr Bin Artah:"},{"id":34,"hadithNumber":"34","text":"\"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"","grade":null,"narratedBy":"Habib bin Salim said:"},{"id":35,"hadithNumber":"35","text":"(Another chain) from An-Nu'man bin Bashir with similar.","grade":null,"narratedBy":null},{"id":36,"hadithNumber":"36","text":"That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.","grade":null,"narratedBy":"Narrated 'Abdul-Jabbar bin Wa'il bin Hujr:"},{"id":37,"hadithNumber":"37","text":"From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"","grade":null,"narratedBy":"Narrated 'Alqamah bin Wa'il Al-Kindi:"},{"id":38,"hadithNumber":"38","text":"That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"","grade":null,"narratedBy":"Narrated Ibn 'Abbas:"},{"id":39,"hadithNumber":"39","text":"\"Whoever has relations with beast, then there is no legal punishment for him.\"","grade":null,"narratedBy":"Sufyan Ath-Thawri reported from 'Asim, from Abu Razin, from Ibn 'Abbas who said:"},{"id":40,"hadithNumber":"40","text":"That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"","grade":null,"narratedBy":"Narrated Ibn 'Abbas:"},{"id":41,"hadithNumber":"41","text":"That the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"","grade":null,"narratedBy":"Narrated Jabir:"},{"id":42,"hadithNumber":"42","text":"That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"","grade":null,"narratedBy":"Narrated 'Ikrimah:"},{"id":43,"hadithNumber":"43","text":"That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"","grade":null,"narratedBy":"Narrated Abu Musa:"},{"id":44,"hadithNumber":"44","text":"That he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"","grade":null,"narratedBy":"Narrated Jundab:"},{"id":45,"hadithNumber":"45","text":"That the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"","grade":null,"narratedBy":"Narrated Umar:"},{"id":46,"hadithNumber":"46","text":"That the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"","grade":null,"narratedBy":"Narrated Ibn 'Abbas:"},{"id":47,"hadithNumber":"47","text":"That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"","grade":null,"narratedBy":"Narrated Abu Burdah bun Niyar:"}]}