{"collection":"tirmidhi","collectionName":"Jami at-Tirmidhi","book":18,"bookName":"The Book on Hunting","hadiths":[{"id":1,"hadithNumber":"1","text":"\"I said: 'O Messenger of Allah! We are a people who hunt.' He said: 'If you send your dog and you mentioned the Name of Allah upon it, and he catches something for you, then eat it.' I said: 'Even if he kills it?' He said: 'Even if he kills it.' I said: 'We are a people who shoot (at game).' He said: 'What you catch with your bow, then eat it.'\" He said: \"Then I said:'Indeed we are a people who travel. We come across Jews, Christians, and Zoroastrians, and we do not find vessels other than theirs.' He said: 'If you do not find other than them, then wash them with water, then eat and drink from it.'\"","grade":null,"narratedBy":"Narrated Abu Tha'labah Al-Khushani:"},{"id":2,"hadithNumber":"2","text":"\"I said: 'O Messenger of Allah! We send our trained dogs to catch game for us.' He said: 'Eat what it catches for you.' I said: 'O Messenger of Allah, and if they kill it?' He said: 'Even if they kill it, as long as they are not accompanied by some other dogs besides them.'\" He said: \"I said: 'O Messenger of Allah! We hunt with the Mir'ad.' He said: 'Eat of the game what the Mir'ad pierces, but whatever is struck by its broad side, then do not eat it.'\"","grade":null,"narratedBy":"Narrated 'Adi bin Hatim:"},{"id":3,"hadithNumber":"3","text":"\"And he was asked about the Mir'ad.\"","grade":null,"narratedBy":"(Another Chain) except that he said:"},{"id":4,"hadithNumber":"4","text":"\"We have been forbidden from the game caught by a Zoroastrian's dog.\"","grade":null,"narratedBy":"Narrated Jabir bin 'Abdullah:"},{"id":5,"hadithNumber":"5","text":"\"I asked the Messenger of Allah (ﷺ) about the game caught by a falcon. So he said: 'What it catches for you, then eat it.'\"","grade":null,"narratedBy":"Narrated 'Adi bin Hatim:"},{"id":6,"hadithNumber":"6","text":"\"I said: 'O Messenger of Allah! I shoot some game and then find my arrow in it the next day.' He said: 'If you know that your arrow killed it, and you dont see any marks of predators, then eat it.'\"","grade":null,"narratedBy":"Narrated 'Adi bin Hatim:"},{"id":7,"hadithNumber":"7","text":"\"I asked the Messenger of Allah (ﷺ) about hunting, so he said: 'Mention Allah's Name when you shoot your arrow. Then, if you find it dead, eat from it, unless you found that it has fallen in (some body of) water. Then do not eat it, for you do not know if the water killed it, or your arrow.'\"","grade":null,"narratedBy":"Narrated 'Adi bin Hatim:"},{"id":8,"hadithNumber":"8","text":"\"I asked the Messenger of Allah (ﷺ) about the game caught by a trained dog. He said: 'If you mention the Name of Allah when you send your trained dog, then eat from what it catches for you. But if it eats from it, then do not eat it, for he only caught it for himself.' I said: 'O Messenger of Allah! What do you say about when our dogs get mixed with other dogs.' He said: 'You only mentioned the Name of Allah over your dog, you did not mention it over the others.'\"\nSufyan said: \"He disliked for him to eat it.\"","grade":null,"narratedBy":"Narrated 'Adi bin Hatim:"},{"id":9,"hadithNumber":"9","text":"I asked the Prophet (ﷺ) about game killed by Mir'ad. So he said: 'What you kill by its sharp edge then eat it, and what you kill by its broad side then, it was killed by something blunt.'\"","grade":null,"narratedBy":"Narrated 'Adi bin Hatim:"},{"id":10,"hadithNumber":"10","text":"Another chain with similar meaning.","grade":null,"narratedBy":null},{"id":11,"hadithNumber":"11","text":"That a man from his people hunted a rabbit or two and slaughtered them with Marwah. Then he hung them up until he met the Messenger of Allah (ﷺ), so he asked him about that, and he (ﷺ) told him to eat them.","grade":null,"narratedBy":"Narrated Jabir bin 'Abdullah:"},{"id":12,"hadithNumber":"12","text":"\"The Messenger of Allah (ﷺ) prohibited eating the Mujath-thamah, and it is what is trapped and killed by arrows.\"","grade":null,"narratedBy":"Narrated Abu Ad-Darda':"},{"id":13,"hadithNumber":"13","text":"From her father: \"On the day of Khaibar, the Messenger of Allah (ﷺ) prohibited eating the meat of every predator that has canine teeth, the meat of every bird that has talons, the meat of the domestic donkey, the Mujath-thamah, the Khalisah, and from having relations with a pregnant slave until she gives birth to what is in her womb.\"\nMuhammad bin Yahya said: \"Abu 'Asim was asked about Mujath-thamah and he said: \"To ensnare a bird or something and then shoot it.\" He was asked about Khalisah, so he said: \"(Prey) that a man finds with a wolf or a predator, then he takes it from him but it dies in his hand before it can be slaughtered.\"","grade":null,"narratedBy":"Narrated Umm Habibah bint Al-'Irbad:"},{"id":14,"hadithNumber":"14","text":"\"The Messenger of Allah (ﷺ) prohibited taking a living thing as a shooting target.\"","grade":null,"narratedBy":"Narrated Ibn 'Abbas:"},{"id":15,"hadithNumber":"15","text":"That the Prophet (ﷺ) said: \"Slaughtering the fetus is (achieved by) the slaughtering of its mother.\"","grade":null,"narratedBy":"Narrated Abu Sa'eed:"},{"id":16,"hadithNumber":"16","text":"\"The Messenger of Allah (ﷺ) prohibited (eating) every predator possessing canine teeth.\"","grade":null,"narratedBy":"Narrated Abu Tha'labah Al-Khushani:"},{"id":17,"hadithNumber":"17","text":"Another chain with similar meaning.","grade":null,"narratedBy":null},{"id":18,"hadithNumber":"18","text":"\"On the Day of Khaibar, the Messenger of Allah (ﷺ) prohibited eating domesticated donkeys, the meat of mules, every predator that possesses canine teeth, and every bird that possesses talons.\"","grade":null,"narratedBy":"Narrated Jabir:"},{"id":19,"hadithNumber":"19","text":"\"The Prophet (ﷺ) prohibited every predator that possesses canine teeth.\"","grade":null,"narratedBy":"Narrated Abu Hurairah:"},{"id":20,"hadithNumber":"20","text":"\"The Prophet (ﷺ) came to Al-Madinah and they were in the habit of cutting the humps off of the camels and cutting the buttocks from the sheep. He said: 'Whatever is cut from an animal while it is alive, then it is dead flesh.'\"","grade":null,"narratedBy":"Narrated Abu Waqid Al-Laithi:"},{"id":21,"hadithNumber":"21","text":"Another chain with similar meaning.","grade":null,"narratedBy":null},{"id":22,"hadithNumber":"22","text":"From his father that he said: \"I said: 'O Messenger of Allah! Is there no slaughtering except upon the neck and the throat ?' He said: 'If you stab its thigh it would be accepted to you.'\"","grade":null,"narratedBy":"Narrated Abu Al-'Ushara':"},{"id":23,"hadithNumber":"23","text":"That the Messenger of Allah (ﷺ) said: \"Whoever kills a gecko in one strike, he has such and such reward, and if he kills it on the second strike, he will have such and such reward, and if he kills it on the third strike, then he has such and such reward.\"","grade":null,"narratedBy":"Narrated Abu Hurairah:"},{"id":24,"hadithNumber":"24","text":"That the Messenger of Allah (ﷺ) said: \"Kill snakes and kill Dhut-Tufyatain and Al-Abtar, because they blind the sight and cause abortions of fetuses.\"","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":25,"hadithNumber":"25","text":"That the Messenger of Allah (ﷺ) said: \"Indeed there are others inhabiting your homes. So yell at them three times (to leave). If you see any of them after that, then kill them.\"","grade":null,"narratedBy":"Narrated Abu Sa'eed Al-Khudri:"},{"id":26,"hadithNumber":"26","text":"Malik bin Anas reported this Hadith from Saifi from Abu As-Sa'ib the freed slave of Hisham bin Zuhrah, from Abu Sa'eed from the Prophet (ﷺ), and there is a story along with the Hadith.\n\nAnother Chain similar to the narration of Malik","grade":null,"narratedBy":null},{"id":27,"hadithNumber":"27","text":"That the Messenger of Allah (ﷺ) said: \"When a snake appears in your dwellings then say to it: We ask you - by covenant of Nuh, and by the covenant of Sulaiman bin Dawud - that you do not harm us.' If it returns, then kill it.\"","grade":null,"narratedBy":"Narrated Abu Laila:"},{"id":28,"hadithNumber":"28","text":"That the Messenger of Allah (ﷺ) said: \"If it were not that dogs were part of a nation among the nations, then I would order to that all of them be killed. So kill every one of them that is all black.\"","grade":null,"narratedBy":"Narrated 'Abdullah bin Mughaffal:"},{"id":29,"hadithNumber":"29","text":"That the Messenger of Allah (ﷺ) said: \"Whoever keeps a dog\" - or: \"acquires a dog\" - \"neither of hunting nor to guard livestock, then two Qirat are deducted from his reward, daily.\"","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":30,"hadithNumber":"30","text":"\"The Messenger of Allah (ﷺ) ordered killing dogs, except for the hunting dog, or the dog that guards livestock.\" It was said to him: \"Abu Hurairah would say: 'or a farm dog' so he (Ibn 'Umar) said: \"Abu Hurairah had a farm.\"","grade":null,"narratedBy":"Narrated Ibn 'Umar:"},{"id":31,"hadithNumber":"31","text":"\"I was one of those who held up the branches from the tree away from the face of the Messenger of Allah (ﷺ) while he was delivering the Khutbah saying: 'If it were not that dogs were a nation among nations, then I would order that they be killed. So kill every one among them that is all black. There is one inhabiting a home in which they keep a dog but their deeds are decreased by one Qirat every day - except for a hunting dog, or a farm dog, or a sheep dog.'\"","grade":null,"narratedBy":"Narrated 'Abdullah bin Mughaffal:"},{"id":32,"hadithNumber":"32","text":"That the Messenger of Allah (ﷺ) said: \"Whoever acquires a dog - with the exception of a dog to guard livestock, a hunting dog, or a farm dog - each day a Qirat is deducted from his reward.\"","grade":null,"narratedBy":"Narrated Abu Hurairah:"},{"id":33,"hadithNumber":"33","text":"\"I said: 'O Messenger of Allah! We expect to meet the enemy tomorrow and we have no knives.' So the Prophet (ﷺ) said: 'As long as it causes blood to flow, and Allah's Name has been mentioned over it, then eat it, provided that it was not done with a tooth or nail. And I will tell you why: As for the tooth it is a bone, and as for the nail it is the knife of the Ethiopians.'\"","grade":null,"narratedBy":"Narrated Rafi' bin Khadij:"},{"id":34,"hadithNumber":"34","text":"\"Abayah, from his father\" and this is more correct. 'Abayah heard from Rafi'.","grade":null,"narratedBy":"Another chain from Rafi' bin Khadij (may Allah be pleased with him) from the Prophet (ﷺ) and it is similar, but the narrator did not mention in it:"},{"id":35,"hadithNumber":"35","text":"\"We were with the Prophet (ﷺ) on journey when the camel that belonged to some people ran away and they did not have a horse. So a man shot it with an arrow and Allah stopped it. The Messenger of Allah (ﷺ) said: 'Of these beasts there are some that are as wild as wild animals. So if one of them does this, then treat it similarly.'\"","grade":null,"narratedBy":"Narrated Rafi' bin Khadij:"},{"id":36,"hadithNumber":"36","text":"Another chain from Rafi' bin Khadij from the Prophet (ﷺ) and it is similar, but (the narrator) did not mention in it \"Abayah from his father.\" and this is more correct.","grade":null,"narratedBy":null}]}