{"collection": "tirmidhi", "collectionName": "Jami at-Tirmidhi", "book": 23, "bookName": "Chapter: What Has Been Related About The People Who Have An Excuse Not To Participate", "hadiths": [{"id": 1, "hadithNumber": "1670", "text": "Narrated Al-Bara' bin 'Azib: That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled. There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit. This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq. And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Al-Bara' bin 'Azib:", "reference": "https://sunnah.com/tirmidhi:1670", "inBookReference": "Book 23, Hadith 1"}, {"id": 2, "hadithNumber": "1671", "text": "Narrated 'Abdullah bin 'Umar: A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'\" [Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas. This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Abdullah bin 'Umar:", "reference": "https://sunnah.com/tirmidhi:1671", "inBookReference": "Book 23, Hadith 2"}, {"id": 3, "hadithNumber": "1672", "text": "Narrated Al-Hajjaj bin Muhammad: That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: \"Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Al-Hajjaj bin Muhammad:", "reference": "https://sunnah.com/tirmidhi:1672", "inBookReference": "Book 23, Hadith 3"}, {"id": 4, "hadithNumber": "1673", "text": "Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1673", "inBookReference": "Book 23, Hadith 4"}, {"id": 5, "hadithNumber": "1674", "text": "Narrated 'Amr bin Shu'aib: From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party. [Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar. Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated 'Amr bin Shu'aib:", "reference": "https://sunnah.com/tirmidhi:1674", "inBookReference": "Book 23, Hadith 5"}, {"id": 6, "hadithNumber": "1675", "text": "Narrated Jabir bin ‘Abdullah : That the Messenger of Allah (ﷺ) said: \"War is deceit.\" [Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir bin ‘Abdullah :", "reference": "https://sunnah.com/tirmidhi:1675", "inBookReference": "Book 23, Hadith 6"}, {"id": 7, "hadithNumber": "1676", "text": "Narrated Abu Ishaq: \"I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Ishaq:", "reference": "https://sunnah.com/tirmidhi:1676", "inBookReference": "Book 23, Hadith 7"}, {"id": 8, "hadithNumber": "1677", "text": "Narrated 'Abdur-Rahman bin 'Awf: \"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\" [Abu 'Eisa said:] There is something on this topic from Abu Ayyub. This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated 'Abdur-Rahman bin 'Awf:", "reference": "https://sunnah.com/tirmidhi:1677", "inBookReference": "Book 23, Hadith 8"}, {"id": 9, "hadithNumber": "1678", "text": "Narrated Ibn Abi Awfa: \"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\" [Abu 'Eisa said:] There is something on this topic from Ibn Masu'd This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn Abi Awfa:", "reference": "https://sunnah.com/tirmidhi:1678", "inBookReference": "Book 23, Hadith 9"}, {"id": 10, "hadithNumber": "1679", "text": "Narrated Jabir: \"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\" [Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\" Muhammad said: \"This is the Hadith.\" [Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1679", "inBookReference": "Book 23, Hadith 10"}, {"id": 11, "hadithNumber": "1680", "text": "Narrated Yunus bin 'Ubaid: the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\" [Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Yunus bin 'Ubaid:", "reference": "https://sunnah.com/tirmidhi:1680", "inBookReference": "Book 23, Hadith 11"}, {"id": 12, "hadithNumber": "1681", "text": "Narrated Ibn 'Abbas: \"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1681", "inBookReference": "Book 23, Hadith 12"}, {"id": 13, "hadithNumber": "1682", "text": "Narrated Al-Muhallab bin Abi Sufrah: From one who heard the Prophet (ﷺ) saying: \"If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'\" [Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Al-Muhallab bin Abi Sufrah:", "reference": "https://sunnah.com/tirmidhi:1682", "inBookReference": "Book 23, Hadith 13"}, {"id": 14, "hadithNumber": "1683", "text": "Narrated 'Uthman bin Sa'd: That Ibn Sirin said: \"I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.\" [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated 'Uthman bin Sa'd:", "reference": "https://sunnah.com/tirmidhi:1683", "inBookReference": "Book 23, Hadith 14"}, {"id": 15, "hadithNumber": "1684", "text": "Narrated Abu Sa’id Al Khudri : \"During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Sa’id Al Khudri :", "reference": "https://sunnah.com/tirmidhi:1684", "inBookReference": "Book 23, Hadith 15"}, {"id": 16, "hadithNumber": "1685", "text": "Narrated Anas bin Malik: \"The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'\" [Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/tirmidhi:1685", "inBookReference": "Book 23, Hadith 16"}, {"id": 17, "hadithNumber": "1686", "text": "Narrated Anas bin Malik: \"There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/tirmidhi:1686", "inBookReference": "Book 23, Hadith 17"}, {"id": 18, "hadithNumber": "1687", "text": "Narrated Anas: \"The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.\" He said: \"The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.\" He said: \"So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'\" - meaning the horse. [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/tirmidhi:1687", "inBookReference": "Book 23, Hadith 18"}, {"id": 19, "hadithNumber": "1688", "text": "Narrated Abu Ishaq: From Al-Bara' bin 'Azib who said: \"A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'\" He said: \"No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet  without lie, I am the son of 'Abdul-Muttalib.'\" [Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Ishaq:", "reference": "https://sunnah.com/tirmidhi:1688", "inBookReference": "Book 23, Hadith 19"}, {"id": 20, "hadithNumber": "1689", "text": "Narrated Ibn 'Umar: \"Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).\" [Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1689", "inBookReference": "Book 23, Hadith 20"}, {"id": 21, "hadithNumber": "1690", "text": "Narrated Talib bin Hujair: From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: \"The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.\" Talib said: \"So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'\" [Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Talib bin Hujair:", "reference": "https://sunnah.com/tirmidhi:1690", "inBookReference": "Book 23, Hadith 21"}, {"id": 22, "hadithNumber": "1691", "text": "Narrated Anas: \"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/tirmidhi:1691", "inBookReference": "Book 23, Hadith 22"}, {"id": 23, "hadithNumber": "1692", "text": "Narrated Az-Zubair bin Al-'Awwam: \"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\" [Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid. This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Az-Zubair bin Al-'Awwam:", "reference": "https://sunnah.com/tirmidhi:1692", "inBookReference": "Book 23, Hadith 23"}, {"id": 24, "hadithNumber": "1693", "text": "Narrated Anas bin Malik: The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/tirmidhi:1693", "inBookReference": "Book 23, Hadith 24"}, {"id": 25, "hadithNumber": "1694", "text": "Narrated 'Urwah Al-Bariqi: That the Messenger of Allah (ﷺ) said: \"Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.\" [Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir. [Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: \"The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Urwah Al-Bariqi:", "reference": "https://sunnah.com/tirmidhi:1694", "inBookReference": "Book 23, Hadith 25"}, {"id": 26, "hadithNumber": "1695", "text": "Narrated Ibn 'Abbas: That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1695", "inBookReference": "Book 23, Hadith 26"}, {"id": 27, "hadithNumber": "1696", "text": "Narrated Abu Qatadah: That the Prophet (ﷺ) said: \"The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.\"", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Abu Qatadah:", "reference": "https://sunnah.com/tirmidhi:1696", "inBookReference": "Book 23, Hadith 27"}, {"id": 28, "hadithNumber": "1697", "text": "Another chain with similar meaning. [Abu 'Eisa said: ] This Hadith is Hasan Gharib Sahih.", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1697", "inBookReference": "Book 23, Hadith 28"}, {"id": 29, "hadithNumber": "1698", "text": "Narrated Abu Hurairah: That the Prophet (ﷺ) disliked Shikal in horses. [Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim. Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1698", "inBookReference": "Book 23, Hadith 29"}, {"id": 30, "hadithNumber": "1699", "text": "Narrated Ibn 'Umar: \"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\" [Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1699", "inBookReference": "Book 23, Hadith 30"}, {"id": 31, "hadithNumber": "1700", "text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"No stake is acceptable except in archery, racing a camel, and racing a horse.\"", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1700", "inBookReference": "Book 23, Hadith 31"}, {"id": 32, "hadithNumber": "1701", "text": "Narrated Ibn 'Abbas: \"The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.\" [Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported this from Abu Jahdam, who said: \"From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.\" He said I heard Muhammad saying: \"The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.\"", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1701", "inBookReference": "Book 23, Hadith 32"}, {"id": 33, "hadithNumber": "1702", "text": "Narrated Abu Ad-Darda': That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Ad-Darda':", "reference": "https://sunnah.com/tirmidhi:1702", "inBookReference": "Book 23, Hadith 33"}, {"id": 34, "hadithNumber": "1703", "text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"The angels do no accompany a group among whom there is a dog or a bell.\" [Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1703", "inBookReference": "Book 23, Hadith 34"}, {"id": 35, "hadithNumber": "1704", "text": "Narrated Al-Bara' : \"The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'\" He said: \"So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'\" He said: \"I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent. [Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: \"To speak against him for that.\" refers to An-Namimah.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Al-Bara' :", "reference": "https://sunnah.com/tirmidhi:1704", "inBookReference": "Book 23, Hadith 35"}, {"id": 36, "hadithNumber": "1705", "text": "Narrated Ibn 'Umar: That the Prophet (ﷺ) said: \"Indeed each of you is a shepherd and all of you will be questioned regarding your flock. The commander who is in authority over the Muslims is responsible and he will be questioned regarding his responsibility. The man is responsible over the inhabitants of his house and he is the one who will be questioned about them. The wife is responsible in her husband's house and she will be questioned about it. The slave is responsible regarding his master's property, and he will be questioned about it. Indeed each of you is a shepherd and each of you will be questioned about his flock.\" [Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Musa. The Hadith of Abu Musa is not preserved, and the Hadith of Anas is not preserved. And the Hadith of Ibn 'Umar is Hasan Sahih Hadith.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1705", "inBookReference": "Book 23, Hadith 36"}, {"id": 37, "hadithNumber": "1705", "text": "Ibrahim bin Bash-shar Ar-Ramadi reported it from Sufyan bin 'Uyainah, from Buraid bin 'Abdullah bin Abu Burdah, from Abu Burdah, from Abu Musa, from the Prophet (ﷺ). Muhammad informed me of that, from Ibrahim bin Bash-Shar [Ar-Ramadi]. Muhammad said: \"More than one has reported it from Sufyan, from Buraid bin Abu Burdah [from Abu Burdah] from the Prophet (ﷺ) in Mursal form. This is more correct.\" Muhammad said: \"Ishaq bin Ibrahim reported from Mu'adh bin Hisham, from his father, from Qatadah, from Anas, from the Prophet (ﷺ) who said: 'Indeed Allah will question everyone who is responsible about his charge.'\" I heard Muhammad saying: \"This is not preserved. It is only correct from Mu'adh bin Hisham from his father, from Qatadah, from Al-Hasan, from the Prophet (ﷺ), in Mursal form.\"", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1705", "inBookReference": "Book 23, Hadith 37"}, {"id": 38, "hadithNumber": "1706", "text": "Narrated Umm Al-Husain Al-Ahmasiyyah: I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\" [Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Umm Al-Husain Al-Ahmasiyyah:", "reference": "https://sunnah.com/tirmidhi:1706", "inBookReference": "Book 23, Hadith 38"}, {"id": 39, "hadithNumber": "1707", "text": "Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: \"Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.\" [Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1707", "inBookReference": "Book 23, Hadith 39"}, {"id": 40, "hadithNumber": "1708", "text": "Narrated Abu Yahya: From Mujahid from Ibn 'Abbas who said: \"The Messenger of Allah (ﷺ) prohibited instigating fights between beasts.\"", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Abu Yahya:", "reference": "https://sunnah.com/tirmidhi:1708", "inBookReference": "Book 23, Hadith 40"}, {"id": 41, "hadithNumber": "1709", "text": "Abu Yahya reported from Mujahid: \"The Prophet (ﷺ) prohibited instigating fights between beasts.\" And he did not mention \"from Ibn 'Abbas\" in it. It is said that this is more correct that the (previous) narration of Qutbah.", "grade": "Da'if (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1709", "inBookReference": "Book 23, Hadith 41"}, {"id": 42, "hadithNumber": "1709", "text": "Sharik narrated this Hadith from Al-A'mash, from Mujahid, from Ibn 'Abbas, from the Prophet (ﷺ) similarly, but he did not mention \"from Abu Yahya\" in it. This was narrated to us by Abu Kuraib from Yahya bin Adam, from Sharik. Abu Mu'awiyah reported it from Al-A'mash, from Mujahid, from the Prophet (ﷺ) similarly. And Abu Yahya is Al-Qattat Al-Kufi, and it is said that his name is Zadhan. [Abu 'Eisa said: ] There are narrations on this topic from Talhah, Jabir, Abu Sa'eed, and 'Ikrash bin Dhuwaib.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1709", "inBookReference": "Book 23, Hadith 42"}, {"id": 43, "hadithNumber": "1710", "text": "Narrated Jabir: \"The Prophet (ﷺ) prohibited branding on the face and striking (it).\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1710", "inBookReference": "Book 23, Hadith 43"}, {"id": 44, "hadithNumber": "1711", "text": "Narrated Nafi: That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\" Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Nafi:", "reference": "https://sunnah.com/tirmidhi:1711", "inBookReference": "Book 23, Hadith 44"}, {"id": 45, "hadithNumber": "1711", "text": "Another chain with similar, but he (Nafi') said: \"Umar [bin 'Abdul-'Aziz] said: 'This is the limit that distinguished between children and soldiers.'\" And he did not mention him writing about the salary [Abu 'Eisa said:] The Hadith of Ishaq bin Yusuf is a Hasan Sahih Gharib Hadith as narration of Sufyan Ath-Thawri", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1711", "inBookReference": "Book 23, Hadith 45"}, {"id": 46, "hadithNumber": "1712", "text": "Narrated 'Abdullah bin Abi Qatadah: That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: \"O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.\" Then the Messenger of Allah (ﷺ) said: \"What was it that you said?\" So he replied: \"If I were killed in the cause of Allah, would my sins be removed (forgiven)?\" So the Messenger of Allah (ﷺ) said: \"Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.\" [Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih. Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Abdullah bin Abi Qatadah:", "reference": "https://sunnah.com/tirmidhi:1712", "inBookReference": "Book 23, Hadith 46"}, {"id": 47, "hadithNumber": "1713", "text": "Narrated Hisham bin 'Amr: \"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\" [Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas. This Hadith is Hasan Sahih Sufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Hisham bin 'Amr:", "reference": "https://sunnah.com/tirmidhi:1713", "inBookReference": "Book 23, Hadith 47"}, {"id": 48, "hadithNumber": "1714", "text": "Narrated Abu 'Ubaidah: That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith. [Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu Hurairah This Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Abu 'Ubaidah:", "reference": "https://sunnah.com/tirmidhi:1714", "inBookReference": "Book 23, Hadith 48"}, {"id": 49, "hadithNumber": "1715", "text": "Narrated Ibn 'Abbas: \"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain. Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1715", "inBookReference": "Book 23, Hadith 49"}, {"id": 50, "hadithNumber": "1716", "text": "Narrated Ibn 'Umar: \"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement. [Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1716", "inBookReference": "Book 23, Hadith 50"}, {"id": 51, "hadithNumber": "1717", "text": "Narrated Jabir bin ‘Abdullah : \"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir bin ‘Abdullah :", "reference": "https://sunnah.com/tirmidhi:1717", "inBookReference": "Book 23, Hadith 51"}, {"id": 52, "hadithNumber": "1718", "text": "Narrated As-Sa'ib bin Yazid: \"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated As-Sa'ib bin Yazid:", "reference": "https://sunnah.com/tirmidhi:1718", "inBookReference": "Book 23, Hadith 52"}, {"id": 53, "hadithNumber": "1719", "text": "Narrated 'Umar bin Al-Khattab: \"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Umar bin Al-Khattab:", "reference": "https://sunnah.com/tirmidhi:1719", "inBookReference": "Book 23, Hadith 53"}]}