{"collection": "tirmidhi", "collectionName": "Jami at-Tirmidhi", "book": 25, "bookName": "Chapter: What Has Been Related About What The Prophet (saws) Ate Upon", "hadiths": [{"id": 1, "hadithNumber": "1788", "text": "Narrated Yunus: From Qatadah, that Anas said: \"The Messenger of Allah (ﷺ) never ate on a table, nor on small plates, not did he eat thin bread.\" He (Yunus) said: \"I asked Qatadah: 'So what did he eat on ?' He said: 'On these leather dining sheets.'\" [Abu 'Eisa said:] This Hadith is Hasan Gharib. Muhammad bin Bash-har said: \"This Yunus is Yunus Al-Iskaf.\" And 'Abdul-Warith bin Sa'eed reported similarly from Sa'eed bin Abi 'Arubah, from Qatadah, from Anas [From the Prophet (ﷺ)].", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Yunus:", "reference": "https://sunnah.com/tirmidhi:1788", "inBookReference": "Book 25, Hadith 1"}, {"id": 2, "hadithNumber": "1789", "text": "Narrated Hisham b. Zaid: \"I heard Anas saying: 'Once we provoked a rabbit at Marr Az-Zahran. So the Companions of the Messenger of Allah (ﷺ) rushed after it, and I caught up to it and captured it. I brought it to Abu Talhah who slaughtered it with Marwah. He sent me with its legs - or its thighs - to the Prophet (ﷺ) so he could eat it.'\" He (Hisham) said: \"I said: 'He ate it?' He said:'He accepted it.'\" [Abu 'Eisa said:] There are narrations on this topic from Jubair, 'Ammar, Muhammad bin Safwan, and they say: Muhammad bin Saifi. This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge. They saw no harm in eating rabbit. Some of the people of knowledge disliked eating rabbit, they said that it menstruates.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Hisham b. Zaid:", "reference": "https://sunnah.com/tirmidhi:1789", "inBookReference": "Book 25, Hadith 2"}, {"id": 3, "hadithNumber": "1790", "text": "Narrated Ibn 'Umar: \"The Prophet (ﷺ) was asked about eating a mastigure and he said: 'I do not eat it, and I do not prohibit eating it.'\" [He said:] There are narrations on this topic from 'Umar, Abu Sa'eed, Ibn 'Abbas, Thabit bin Wadi'ah, Jabir, and 'Abdur-Rahman bin Hasanah. [Abu 'Eisa said:] This Hadith is Hasan Sahih The People of knowledge have differed over eating mastigure. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others permitted it, while others considered it disliked. It has been related that Ibn 'Abbas said: \"Mastigure was eaten on the dining spread of the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) only avoided it because it was distasteful to him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1790", "inBookReference": "Book 25, Hadith 3"}, {"id": 4, "hadithNumber": "1791", "text": "Narrated Ibn Abi 'Ammar: \"I asked Jabir: 'Is badger kind of game animal?' He said: 'Yes.'\" He said: \"I said: 'Should I eat it?' He said: 'Yes.'\" He said: 'I said: 'Did the Messenger of Allah (ﷺ) say that ?' He said: 'Yes.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Some of the people of knowledge followed this. They did not see any harm eating badger. This is the view of Ahmad and Ishaq. A Hadith has been related from the Prophet (ﷺ) indicating disapproval of eating badger but its chain is not strong. Some of the people of knowledge disliked eating badger. This is the view of Ibn Al-Mubarak. Yahya bin Al-Qattan said: \"Jarir bin Hazm reported this Hadith from 'Abdullah bin 'Ubaid bin 'Umair, from Ibn Abi 'Ammar, from Jabir, from 'Umar, as his saying. And the narration of Ibn Juraij (a narrator in the chain of this Hadith) is more correct. And Ibn Abi 'Ammar is 'Abdur-Rahman bin 'Abdullah bin Abi 'Ammar Al-Makki.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn Abi 'Ammar:", "reference": "https://sunnah.com/tirmidhi:1791", "inBookReference": "Book 25, Hadith 4"}, {"id": 5, "hadithNumber": "1792", "text": "Narrated Khuzaimah bin Jaz': \"I asked the Messenger of Allah (ﷺ) about eating badger. He said: 'Does anyone eat badger?' So I asked him about eating wolf' He said: 'Does anyone who has any good in him eat wolf?'\" [Abu 'Eisa said:] The chain for this Hadith is not strong. We do not know of it except as a narration of Isma'il bin Muslim from 'Abdul-Karim Abi Umayyah. Some of the people of Hadith have criticized Isma'il and 'Abdul Karim Abi Umayyah. And he is 'Abdul-Karim bin Qais, who is Ibn Abi Al-Mukhariq. While 'Abdul-Karim bin Malik Al-Jazari is trustworthy.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Khuzaimah bin Jaz':", "reference": "https://sunnah.com/tirmidhi:1792", "inBookReference": "Book 25, Hadith 5"}, {"id": 6, "hadithNumber": "1793", "text": "Narrated Jabir: \"The Messenger of Allah (ﷺ) allowed us to eat horse meat, and he forbade us from eating donkey meat.\" He said: There is something on this from Asma' bin Abi Bakr. Abu 'Eisa said: This Hadith is Hasan Sahih. This is how it was reported by more than one narrator, from 'Amr bin Dinar from Jabir. Hammad bin Zaid reported it from 'Amr bin Dinar from Muhammad bin 'Ali, from Jabir. The narration of Ibn 'Uyainah (no. 1793) is more correct. He said: I heard Muhammad saying: \"Sufyan bin 'Uyainah is better at memorizing than Hammad bin Zaid.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1793", "inBookReference": "Book 25, Hadith 6"}, {"id": 7, "hadithNumber": "1794", "text": "Narrated 'Abdullah and Al-Hasan, the sons of Muhammad bin 'Ali: Fromt their father, that 'Ali said: \"During the time of Khaibar, the Messenger of Allah (ﷺ) prohibited Mut'ah with women and eating the meat of domesticated donkeys.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Abdullah and Al-Hasan, the sons of Muhammad bin 'Ali:", "reference": "https://sunnah.com/tirmidhi:1794", "inBookReference": "Book 25, Hadith 7"}, {"id": 8, "hadithNumber": "8", "text": "Another chain and 'Abdullah bin Muhammad's Kunyah is Abu Hisham. Az-Zuhri said: \"Al-Hasan bin Muhammad was the more acceptable of the two.\" And he mentioned similarly. Others besides Sa'eed bin 'Abdur-Rahman narrated from Ibn 'Uyainah: \"Abd 'Abdullah bin Muhammad was the more acceptable of the two.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1794b", "inBookReference": "Book 25, Hadith 8"}, {"id": 9, "hadithNumber": "1795", "text": "Narrated Abu Hurairah: \"On the day of Khaibar, the Messenger of Allah (ﷺ) prohibited every predator possessing canines, and the Mujath-thamah, and the domestic donkey.\" He said: There are narrations on this topic from 'Ali, Jabir, Al-Bara', Ibn Abi Awfa, Anas, Al-'Irbad bin Sariyah, Abu Tha'labah, Ibn 'Umar and Abu Sa'eed. [Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Abdul-'Aziz bin Muhammad and others reported this Hadith from Muhammad bin 'Amr, and they only mentioned one phrase: \"The Messenger of Allah (ﷺ) prohibited every predator possessing canines.\"", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1795", "inBookReference": "Book 25, Hadith 9"}, {"id": 10, "hadithNumber": "1796", "text": "Narrated Abu Tha'labah Al-Khushani: \"The Messenger of Allah (ﷺ) was asked about the pots of Zorastrians. He said: 'Clean them by washing them, and then cook in them.\" And he prohibited every predator possessing canines.\" This is a well known Hadith of Abu Tha'labah, and it has been reported from him through routes other than this. And Abu Tha'labah's name is Jurthum, and they say: Jurhum, and they say: Nashib. This Hadith has also been mentioned by Abu Qilabah from Abu 'Asma Ar-Rahbi, from Abu Tha'labah.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Tha'labah Al-Khushani:", "reference": "https://sunnah.com/tirmidhi:1796", "inBookReference": "Book 25, Hadith 10"}, {"id": 11, "hadithNumber": "1797", "text": "Narrated Abu Tha'labah Al-Khushani: That he said: \"O Messenger of Allah! We live in a land of the People of Book and we cook in their containers, and drink in their vessels.\" The Messenger of Allah (ﷺ) said: \"If you do not find other than them, then rinse them with water.\" The he said: \"O Messenger of Allah! We live in a land of game, so what should we do ?\" He said: \"When you send your trained dog, and you mentioned the Name of Allah, and he kills it, then eat it. And when you shoot it with your bow, and it is killed, then eat it.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Tha'labah Al-Khushani:", "reference": "https://sunnah.com/tirmidhi:1797", "inBookReference": "Book 25, Hadith 11"}, {"id": 12, "hadithNumber": "1798", "text": "Narrated Ibn 'Abbas: From Maimunah that a mouse fell in some cooking fat and died. So the Prophet (ﷺ) was asked about that and he said: \"Remove it (the mouse) and what was around it and then eat it (the fat).\" He said: There are something on this topic from Abu Hurairah. [Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith has been related from Az-Zuhri, from 'Ubaidullah, from Ibn 'Abbas, saying: \"The Prophet (ﷺ) as asked\" and they did not mention Maimunah in it. The narration of Ibn 'Abbas from Maimunah is more correct. Ma'mar reported similar from Az-Zuhri, from Sa'eed bin Al-Musayyab, from Abu Hurairah, from the Prophet (ﷺ). But this hadith is not preserved. He said: I heard Muhammad bin Isma'il saying: \"The Hadith of Ma'mar from Az-Zuhri, from Sa'eed bin al-Musayyab, from Abu Hurairah, from the Prophet (ﷺ)\" - and he mentioned in it: 'That he was asked about it, so he said: \"When it (the coking fat) is solid then remove it (the mouse) and what was around it. And when it is liquid then do not use it.'\" This is a mistake. Ma'mar made a mistake with it. And he said: What is correct is the narration of Az-Zuhri from 'Ubaidullah, from Ibn 'Abbas, and Maimunah.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1798", "inBookReference": "Book 25, Hadith 12"}, {"id": 13, "hadithNumber": "1799", "text": "Narrated 'Abdullah bin 'Umar: That the Prophet (ﷺ) said: \"Let none of you wat with his left hand nor drink with his left hand, for indeed Ash-Shaitan eats with his left hand and drinks with his left hand.\" He said: There are narrations on this topic from Jabir, 'Umar bin Abi Salamah, Salamah bin Al-Akwa', Anas bin Malik, and Hafsah. [Abu 'Eisa said:] This Hadith is Hasan Sahih. This is how Malik and Ibn 'Uyainah reported it from Az-Zuhri, from Abu Bakr bin 'Ubaidullah, from Ibn 'Umar. Ma'mar and 'Uqail reported it from Az-Zuhri, from Salim, from Ibn 'Umar. And the narration of Malik and Ibn 'Uyainah is more correct.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Abdullah bin 'Umar:", "reference": "https://sunnah.com/tirmidhi:1799", "inBookReference": "Book 25, Hadith 13"}, {"id": 14, "hadithNumber": "1800", "text": "Narrated Az-Zuhri: From Salim, from his father, that the Messenger of Allah (ﷺ) said: \"When one of you eats, then let him eat with his right hand, and let him drink with his right hand, for indeed Ash-Shaitan eats with his left hand, and he drinks with his left hand.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Az-Zuhri:", "reference": "https://sunnah.com/tirmidhi:1800", "inBookReference": "Book 25, Hadith 14"}, {"id": 15, "hadithNumber": "1801", "text": "Narrated Abu Hurairah: That Messenger of Allah (ﷺ) said: \"When one of you eats, then let him lick his fingers, for indeed he does not know in which of them is the blessing.\" He said: There are narrations on this topic from Jabir, Ka'b bin Malik, and Anas. [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Suhail. I asked Muhammad about this Hadith, so he said: \"This is among the diverse narrations of 'Abdul-'Aziz, we do not know of it except from his narration.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1801", "inBookReference": "Book 25, Hadith 15"}, {"id": 16, "hadithNumber": "1802", "text": "Narrated Jabir: That the Prophet (ﷺ) said: \"When one of you eats food, and he drops a pieces of it, then let him remove anything suspicious from it and eat it. Do not leave it for Ash-Shaitan.\" He said: There is something about this from Anas.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1802", "inBookReference": "Book 25, Hadith 16"}, {"id": 17, "hadithNumber": "1803", "text": "Narrated Anas: \"When the Prophet (ﷺ) ate, he would lick his three fingers, and he said: 'If one of you drops a piece (of food) then let him remove any harm (dirt) from it and eat it, and do not leave it for Ash-Shaitan.' And he would order us to finish (clean) the dish. And he said: 'Indeed you do not know in which part of your food is the blessing.' [Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/tirmidhi:1803", "inBookReference": "Book 25, Hadith 17"}, {"id": 18, "hadithNumber": "1804", "text": "Narrated Al-Mu'alla bin Rashid: \"My grandmother, Umm 'Asim narrated to me - and she was the slave woman of Sinan bin Salamah - she said: 'Nubaishah Al-Khair entered upon us while we were eating from a large bowl. He narrated to us that the Messenger of Allah (ﷺ) said: \"Whoever eats from A Qas'ah, then licks it, the Qas'ah will seek forgiveness for him.\" [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through the narration of Al-Mu'alla bin Rashid. And Yazid bin Harun and others among the A'immah reported this Hadith from Al-Mu'alla bin Rashid.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Al-Mu'alla bin Rashid:", "reference": "https://sunnah.com/tirmidhi:1804", "inBookReference": "Book 25, Hadith 18"}, {"id": 19, "hadithNumber": "1805", "text": "Narrated Ibn 'Abbas: That the Prophet (ﷺ) said: \"Indeed the blessing descends to the middle of the food, so eat from its edges, and do not eat from its middle.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. It is only known through the narration of 'Ata' bin As-Sa'ib. Shu'bah and Ath-Thawri reported from 'Ata' bin As-Sa'ib. There is something about this topic from Ibn 'Umar.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1805", "inBookReference": "Book 25, Hadith 19"}, {"id": 20, "hadithNumber": "1806", "text": "Narrated Jabir: That the Messenger of Allah (ﷺ) said: \"Whoever eats from these - the first time, he said garlic, then he said - garlic, onion, and leek, then let him not approach our Masjid.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. He said: There are narrations on this topic from 'Umar, Abu Ayyub, Abu Hurairah, Abu Sa'eed, Jabir bin Samurah, Qurrah [bin Iyas Al-Muzani] and Ibn 'Umar.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1806", "inBookReference": "Book 25, Hadith 20"}, {"id": 21, "hadithNumber": "1807", "text": "Narrated Jabir bin Samurah: \"The Messenger of Allah (ﷺ) was staying with Abu Ayyub. When he ate some food, he would send what was left to him. So one day he sent him some food but the Prophet (ﷺ) did not eat from it. So Abu Ayyub went to the Prophet (ﷺ) and mentioned that to him. The Prophet (ﷺ) said: 'It contained garlic.' So he said: 'O Messenger of Allah! Is it unlawful?' He said: 'No, I dislike it because of its odor.'\" He said: This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir bin Samurah:", "reference": "https://sunnah.com/tirmidhi:1807", "inBookReference": "Book 25, Hadith 21"}, {"id": 22, "hadithNumber": "1808", "text": "Narrated Sharik bin Hanbal: That 'Ali said: \"Eating garlic was prohibited except when cooked.\"", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Sharik bin Hanbal:", "reference": "https://sunnah.com/tirmidhi:1808", "inBookReference": "Book 25, Hadith 22"}, {"id": 23, "hadithNumber": "1809", "text": "Narrated Sharik bin Hanbal: That 'Ali said: \"Eating garlic is no good, except when cooked.\" [Abu 'Eisa said:] This chain of this Hadith is not strong. It has been reported as a saying of 'Ali and it has been reported from Sharik bin Hanbal from the Prophet (ﷺ) in Mursal form. Muhammad said: \"Al-Jarrah bin Malih (one of the narratos) is truthful, and Al-Jarrah bin Ad-Dahhak is Muqarib (average) in Hadith.", "grade": null, "narratedBy": "Narrated Sharik bin Hanbal:", "reference": "https://sunnah.com/tirmidhi:1809", "inBookReference": "Book 25, Hadith 23"}, {"id": 24, "hadithNumber": "1810", "text": "Narrated 'Ubaidullah bin Abi Burdah: From his father that Umm Ayyub informed him that the Prophet (ﷺ) had stayed with them, and they prepared some food for him containing some of these vegetables. But he disliked eating it, so he said to his Companions: \"Eat it, for I am not like you are, I fear that I will offend my companion.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Umm Ayyub is the wife of Abu Ayyub Al-Ansari.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Ubaidullah bin Abi Burdah:", "reference": "https://sunnah.com/tirmidhi:1810", "inBookReference": "Book 25, Hadith 24"}, {"id": 25, "hadithNumber": "1811", "text": "Narrated Abu Khaldah: That Abu Al-'Aliyah said: \"garlic is among the good provisions.\" Abu Khaldah's name is Khalid bin Dinar, and he is trustworthy according to the people of Hadith. He saw Anas bin Malik and heard narrations from him. Abu Al-'Aliyah's name is Rufai' and he is Ar-Riyahi. 'Abdur-Rahman bin Mahdi said: \"Abu Khaldah was preferable, reliable.\"", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Abu Khaldah:", "reference": "https://sunnah.com/tirmidhi:1811", "inBookReference": "Book 25, Hadith 25"}, {"id": 26, "hadithNumber": "1812", "text": "Narrated Jabir: That the Prophet (ﷺ) said: \"Close the door, tie the water-skin, turn over the vessel, or cover the vessel, and extinguish the torch. Indeed Ash-Shaitan does not open what is closed, nor undo what is fastened, nor uncover a vessel, but the small vermin may cause a fire in people's houses.\" He said: There are narrations on this topic from Ibn 'Umar, Abu Hurairah, and Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through other routes from Jabir.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1812", "inBookReference": "Book 25, Hadith 26"}, {"id": 27, "hadithNumber": "1813", "text": "Narrated Salim: From his father, that the Messenger of Allah (ﷺ) said: \"Do not leave the fire (burning) in your houses when you sleep.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Salim:", "reference": "https://sunnah.com/tirmidhi:1813", "inBookReference": "Book 25, Hadith 27"}, {"id": 28, "hadithNumber": "1814", "text": "Narrated Ibn 'Umar: \"The Messenger of Allah (ﷺ) prohibited taking two dates at a time until seeking permission from one's companion.\" He said: There is something on this topic from Sa'd the freed slave of Abu Bakr. [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1814", "inBookReference": "Book 25, Hadith 28"}, {"id": 29, "hadithNumber": "1815", "text": "Narrated 'Aishah: That the Prophet (ﷺ) said: \"A house without dates, its inhabitants will be hungry.\" He said: There are narrations on this topic from Salma the wife of Abu Rafi'. [Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. We do not know of it to be a narration of Hisham bin 'Urwah except through this route. He said: I asked Al-Bukhari about this Hadith and he said: \"I do not know of anyone who reported it other than Yahya bin Hassan.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/tirmidhi:1815", "inBookReference": "Book 25, Hadith 29"}, {"id": 30, "hadithNumber": "1816", "text": "Narrated Anas bin Malik: That the Prophet (ﷺ) said: \"Indeed Allah is pleased with the slave who, upon eating his food or drinking his drink, he praises Him for it.\" He said: There are narrations on this topic from 'Uqbah bin 'Amir, Abu Sa'eed, 'Aishah, Abu Ayyub, and Abu Hurairah. [Abu 'Eisa said:] This Hadith is Hasan. More than one narrator has reported it from Zakariyya bin Abi Za'idah similarly, and we do not know of it except through the narration of Zakariyya bin Abi Za'idah.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/tirmidhi:1816", "inBookReference": "Book 25, Hadith 30"}, {"id": 31, "hadithNumber": "1817", "text": "Narrated Jabir bin ‘Abdullah : \"The Messenger of Allah (ﷺ) took the hand of a leper and put it in the Qas'ah. Then he said: 'Eat in Allah's Name, trusting in Allah and relying upon Him.'\" [Abu 'Eisa said:] This is a Gharib Hadith, we do not know of it except through the report of Yunus bin Muhammad, from Al-Mufaddal bin Fadalah, a Shaikh from Al-Basrah. There is another Shaikh from Al-Basrah named Al-Mufaddal bin Fadalah, who is more reliable han this one and more popular. Shu'bah reported this Hadith from Habib bin Ash-Shahid, from Ibn Buraidah: \"That Ibn 'Umar took the hand of a leper\" and the narration of Shu'bah is more appropriate to me and more correct.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Jabir bin ‘Abdullah :", "reference": "https://sunnah.com/tirmidhi:1817", "inBookReference": "Book 25, Hadith 31"}, {"id": 32, "hadithNumber": "1818", "text": "Narrated Ibn 'Umar: That the Prophet (ﷺ) said: \"The disbeliever eats with seven intestines and the believer eats with one intestine.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. He said: There are narrations on this topic from Abu Hurairah, Abu Sa'eed, Abu Basrah Al-Ghifari, Abu Musa, Jahjah Al-Ghifari, Maimunah, and 'Abdullah bin 'Amr.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1818", "inBookReference": "Book 25, Hadith 32"}, {"id": 33, "hadithNumber": "1819", "text": "Narrated Abu Hurairah: \"The Messenger of Allah (ﷺ) had a disbeliever as a guest. So the Messenger of Allah (ﷺ) ordered that a sheep be milked so he could drink. Then another was milked so he could drink, then another, so he drank until he had drank the milk of seven sheep. The he awoke the next morning and accepted Islam.  The Messenger of Allah (ﷺ) ordered that a sheep be milked so he could drink its milk, then he ordered for another but he could not finish it. So the Messenger of Allah (ﷺ) said: 'The believer drinks with one intestine and the disbeliever drinks with seven.'\" [Abu 'Eisa said:] This Hadith is Sahih Hasan Gharib as a narration of Suhail.", "grade": "1819 (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1819", "inBookReference": "Book 25, Hadith 33"}, {"id": 34, "hadithNumber": "1820", "text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"The food of two is sufficient for three, and the food of three is sufficient for four.\" He said: There are narrations on this topic from Jabir, and Ibn 'Umar. [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1820", "inBookReference": "Book 25, Hadith 34"}, {"id": 35, "hadithNumber": "35", "text": "It has been reported from Jabir bin 'Abdullah and Ibn 'Umar that the Prophet (ﷺ) said: \"The food of one is sufficient for two, and the food of two is sufficient for four, and the food of four is sufficient for eight.\" Another chain from Jabir that the Prophet (ﷺ) said similarly.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1820b", "inBookReference": "Book 25, Hadith 35"}, {"id": 36, "hadithNumber": "1821", "text": "Narrated Abu Ya'fur Al-'Abdi: That 'Abdullah bin Abi Awfa was asked about locust. He said: \"I participated in six military expeditions with the Messenger of Allah (saws, (and) we ate locust.\" [Abu 'Eisa said:] This is how Sufyan bin 'Uyainah reported this Hadith from Abu Ya'fur. He said: \"Six military expeditions,\" while Sufyan Ath-Thawri reported this Hadith from Abu Ya'fur, and he said: \"Seven military expeditions.\" He said: There are narrations on this topic from Ibn 'Umar and Jabir. He said: This Hadith is Hasan Sahih. Abu Yu'fur's name is Waqid. They also call him Waqdan. There is another Abu Ya'fur whose name is 'Adbur-Rahman bin 'Ubaid bin Nistas.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Ya'fur Al-'Abdi:", "reference": "https://sunnah.com/tirmidhi:1821", "inBookReference": "Book 25, Hadith 36"}, {"id": 37, "hadithNumber": "1822", "text": "Narrated Abu Ya'fur: That Ibn Abi Awfa said: \"We participated in seven military expeditions with the Messenger of Allah (ﷺ), (and) we ate locust.\" [Abu 'Eisa said:] Shu'bah reported this Hadith from Abu Ya'fur, from Ibn Awfa and said: \"We participated in military expeditions with the Messenger of Allah (ﷺ) (and) we ate locust.\" This was narrated to us by Muhammad bin Bash-shar (who said): \"Muhammad bin Ja'far narrated to us from Shu'bah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Ya'fur:", "reference": "https://sunnah.com/tirmidhi:1822", "inBookReference": "Book 25, Hadith 37"}, {"id": 38, "hadithNumber": "1823", "text": "Narrated At-Taimi: From Jabir bin 'Abdullah and Anas bin Malik who said: \"When the Messenger of Allah (ﷺ) supplicated against locusts he would say: 'O Allah! Destroy the locusts, kill the large among him, and destroy the small, spoil his core, and cut off his rear. Take their mouths from our livelihood and our sustenance. Verily, You indeed listen to the supplication!' So a  man said: 'O Messenger of Allah! How is it that you supplicate against one of the Allah's armies that He cut off their rear?'\" He said: \"So the Messenger of Allah (ﷺ) said: 'They are bit scattered from a fish in the ocean.'\" [Abu 'Eisa said:] This Hadith is Gharib. We do not know of it except from this route. And Musa bin Muhammad bin Ibrahim At-Taimi has been criticized. He narrates many Gharib and Munkar narrations. His father Muhammad bin Ibrahim is trustworthy, and he is from Al-Madinah.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated At-Taimi:", "reference": "https://sunnah.com/tirmidhi:1823", "inBookReference": "Book 25, Hadith 38"}, {"id": 39, "hadithNumber": "1824", "text": "Narrated Ibn 'Umar: \"The Prophet (ﷺ) prohibited eating the Jallalah and milking it.\" He said: There is something on this topic from 'Abdullah bin 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Gharib. Ath-Thawri reported it from Ibn Abi Najih, from Mujahid, from the Prophet (ﷺ) in Mursal form.", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Ibn 'Umar:", "reference": "https://sunnah.com/tirmidhi:1824", "inBookReference": "Book 25, Hadith 39"}, {"id": 40, "hadithNumber": "1825", "text": "Narrated Ibn 'Abbas: \"The Prophet (ﷺ) prohibited the Mujath-thamah, the milk of the Jallalah, and drinking from the sprout of the water-skin.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1825", "inBookReference": "Book 25, Hadith 40"}, {"id": 41, "hadithNumber": "41", "text": "Another chain from Ibn 'Abbas, from the Prophet (ﷺ), with similar meaning. [Abu 'Eisa said: ] This Hadith is Hasan Sahih. There is something about this from 'Abdullah bin 'Amr.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1825b", "inBookReference": "Book 25, Hadith 41"}, {"id": 42, "hadithNumber": "1826", "text": "Narrated Zahdam Al-Jarmi: \"I entered upon Abu Musa while he was eating chicken, and he said: 'Sit and eat, for indeed I saw the Messenger of Allah (ﷺ) eating it.'\" [Abu 'Eisa said:] This Hadith is Hasan. This Hadith has been reported through other routes from Zahdam, and we do not know of it except as the narration of Zahdam. (One of the narrators) Abu Al-'Awwam is 'Imran Al-Qattan.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Zahdam Al-Jarmi:", "reference": "https://sunnah.com/tirmidhi:1826", "inBookReference": "Book 25, Hadith 42"}, {"id": 43, "hadithNumber": "1827", "text": "Narrated Zahdam: From Abu Musa who said: \"I saw the Messenger of Allah (ﷺ) eating chicken meat.\" He said: The Hadith has more statements that this. And this Hadith is Hasan Sahih. Ayyub As-Sakhtiyani also reported this Hadith from Al-Qasim At-Tamimi, and, from Abu Qilabah, from Zahdam Al-Jarmi.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Zahdam:", "reference": "https://sunnah.com/tirmidhi:1827", "inBookReference": "Book 25, Hadith 43"}, {"id": 44, "hadithNumber": "1828", "text": "Narrated Ibrahim bin 'Umar bin Safinah: From his father, from his grandfather that he said: \"I ate bustard meat with the Messenger of Allah (ﷺ).\" [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except from this route. Ibn Abi Fudaik reported from Ibrahim bin 'Umar bin Safinah and he has been called Buraih bin 'Umar bin Safinah.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Ibrahim bin 'Umar bin Safinah:", "reference": "https://sunnah.com/tirmidhi:1828", "inBookReference": "Book 25, Hadith 44"}, {"id": 45, "hadithNumber": "1829", "text": "Narrated Umm Salamah: That she brought a side of roasted meat to the Messenger of Allah (ﷺ), so he ate it from it and stood for Salat, and did not perform Wudu' He said: There are narrations on this topic from 'Abdullah bin Al-Harith, Al-Mughirah, and Abu Rafi' [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Umm Salamah:", "reference": "https://sunnah.com/tirmidhi:1829", "inBookReference": "Book 25, Hadith 45"}, {"id": 46, "hadithNumber": "1830", "text": "Narrated Abu Juhaidah: That the Messenger of Allah (ﷺ) said: \"As for me, I do not eat while reclining.\" He said: There are narrations on this topic from 'Ali, 'Abdullah bin 'Amr, and 'Abdullah bin Al-'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of 'Ali bin Al-Aqmar. Zakariyya bin Abi Za'idah,  Sufyan bin Sa'eed, and other reported this Hadith from 'Ali bin Al-Aqmar. And Shu'bah reported this Hadith from Sufyan Ath-Thawri from 'Ali bin Al-Aqmar.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Juhaidah:", "reference": "https://sunnah.com/tirmidhi:1830", "inBookReference": "Book 25, Hadith 46"}, {"id": 47, "hadithNumber": "1831", "text": "Narrated 'Aishah: \"The Prophet (ﷺ) liked sweets and honey.\" This Hadith is Hasan Sahih Gharib. 'Ali bin Mus-hir reported it from Hisham bin 'Urwah, and there is more stated in the Hadith than this.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/tirmidhi:1831", "inBookReference": "Book 25, Hadith 47"}, {"id": 48, "hadithNumber": "1832", "text": "Narrated 'Alqamah bin Al-Muzani: From his father, who said that the Prophet (ﷺ) said: \"When one of you buys meat, then let him increase its broth. For, if he does not find any meat you'll have broth; and it is one of the two meats.\" And there are narrations on this topic from Abu Dharr. [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route, as a narration of Muhammad bin Fada', who is Muhammad bin Fada' Al-Mu'abbar, and he has been criticized by Sulaiman bin Harb. 'Alqamah bin 'Abdullah is the brother of Bakr bin 'Abdullah Al-Muzani.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated 'Alqamah bin Al-Muzani:", "reference": "https://sunnah.com/tirmidhi:1832", "inBookReference": "Book 25, Hadith 48"}, {"id": 49, "hadithNumber": "1833", "text": "Narrated Abu Dharr: That the Messenger of Allah (ﷺ) said: \"Let one of you not consider any good to be insignificant. If he has nothing, then let him meet his brother with a smiling face. If you buy some meat or cook something in a pot, then increase its broth, and serve some of it to your neighbor.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported it from Abu 'Imran Al-Jawni.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Dharr:", "reference": "https://sunnah.com/tirmidhi:1833", "inBookReference": "Book 25, Hadith 49"}, {"id": 50, "hadithNumber": "1834", "text": "Narrated Abu Musa: That the Prophet (ﷺ) said: \"Many a man achieved perfection, but no woman achieved perfection except for Mariam the daughter of 'Imran, and Asiyah the wife of Fir'awn. And the superiority of 'Aishah over other women is like the superiority of Tharid over other foods.\" He said: There is something on this topic from 'Aishah and Anas. [Abu 'Eisa said:] This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Musa:", "reference": "https://sunnah.com/tirmidhi:1834", "inBookReference": "Book 25, Hadith 50"}, {"id": 51, "hadithNumber": "1835", "text": "Narrated 'Abdullah bin Al-Harith: \"My father had me married so he invited people, and Safwan bin Umayyah was among them. So he said: 'Indeed the Messenger of Allah (ﷺ) said: 'Bite the meat (with your teeth) for indeed it is more enjoyable and more wholesome. He said: There are narration on this topic from 'Aishah and Abu Hurairah. [Abu 'Eisa said:] We do not know of this Hadith except through the narration of 'Abdul-Karim. Some of the people of knowledge have criticized 'Abdul-Karim Al-Mu'allim because of his memory, Ayyub As-Sakhtiyani was among them.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated 'Abdullah bin Al-Harith:", "reference": "https://sunnah.com/tirmidhi:1835", "inBookReference": "Book 25, Hadith 51"}, {"id": 52, "hadithNumber": "1836", "text": "Narrated Ja'far bin 'Amr bin Umayyah Ad-Damri: From his father who said that he saw the Prophet (ﷺ) making incisions (with a knife) into a piece of a lamb shoulder which he ate from, then he went to perform Salat without performing Wudu'. [Abu 'Eisa said:] This Hadith is Hasan Sahih and there is something on this topic from Al-Mughirah bin Shu'bah.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ja'far bin 'Amr bin Umayyah Ad-Damri:", "reference": "https://sunnah.com/tirmidhi:1836", "inBookReference": "Book 25, Hadith 52"}, {"id": 53, "hadithNumber": "1837", "text": "Narrated Abu Hurairah: \"Some meat was brought to the Prophet (ﷺ) and a foreleg was presented to him, and he used to like it, so he bit from it.\" He said: There are narrations on this topic from Ibn Mas'ud, 'Aishah, 'Abdullah bin Ja'far, and Abu 'Ubaidah. [Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Hayyan's (a narrator in the chain) name is Yahya bin Sa'eed bin Hayyan At-Taimi. Abu Zur'ah bin 'Amr bin Jarir's name is Harim.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1837", "inBookReference": "Book 25, Hadith 53"}, {"id": 54, "hadithNumber": "1838", "text": "Narrated 'Aishah: \"The foreleg was not the part of the meat that the Messenger of Allah (ﷺ) liked most, but he would not get meat but occasionally. So it would be hastened to him because it cooks quickly.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/tirmidhi:1838", "inBookReference": "Book 25, Hadith 54"}, {"id": 55, "hadithNumber": "1839", "text": "Narrated Jabir: That the Prophet (ﷺ) said: \"What an excellent condiment vinegar is.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1839", "inBookReference": "Book 25, Hadith 55"}, {"id": 56, "hadithNumber": "1840", "text": "Narrated 'Aishah: That the Messenger of Allah (ﷺ) said: \"What an excellent condiment vinegar is.\" Another chain with similar except that he (ﷺ) said: \"What an excellent condiment, or, (the most excellent of) condiments is vinegar.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route. It is not known as a Hadith of Hisham bin 'Urwah except through the narration of Sulaiman bin Bilal.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/tirmidhi:1840", "inBookReference": "Book 25, Hadith 56"}, {"id": 57, "hadithNumber": "1841", "text": "Narrated Umm Hani' bint Abi Talib: \"The Messenger of Allah (ﷺ) entered upon me and said: 'Do you have anything?' I said: 'No, except a piece of hard bread and vinegar.' so he said: 'Bring it, for a house that has vinegar is not impoverished of condiments.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. We do not know of it as a Hadith of Umm Hani' except through this route. Abu Hamzah Ath-Thumali's (a narrator in the chain) name is Thabit bin Abi Safiyyah. And Umm Hani' died some time after 'Ali bin Abi Talib. I asked Muhammad about this Hadith. He said: \"I do not know Ash-Sha'bi hearing from Umm Hani'.\" So I said: \"How is Abu Hamzah according to you?\" He said: \"Ahmad bin Hanbal criticized him, but he is Muqarib (average) in Hadith to me.\"", "grade": "Hasan (Darussalam)", "narratedBy": "Narrated Umm Hani' bint Abi Talib:", "reference": "https://sunnah.com/tirmidhi:1841", "inBookReference": "Book 25, Hadith 57"}, {"id": 58, "hadithNumber": "1842", "text": "Narrated Jabir: That the Prophet (ﷺ) said: \"What an excellent condiment vinegar is.\" There are narrations on this topic from 'Aishah and Umm Hani', and this is more correct than the narration of Mubarak bin Sa'eed (no. 1839).", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Jabir:", "reference": "https://sunnah.com/tirmidhi:1842", "inBookReference": "Book 25, Hadith 58"}, {"id": 59, "hadithNumber": "1843", "text": "Narrated 'Aishah: \"The Prophet (ﷺ) would eat melon with fresh dates.\" He said: There is something on about this from Anas. [Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of them reported it form Hisham bin 'Urwah from his father in Mursal form from the Prophet (ﷺ), without mentioning \"from 'Aishah\" in it, And Yazid bin Ruman reported this Hadith from 'Urwah, from 'Aishah.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Aishah:", "reference": "https://sunnah.com/tirmidhi:1843", "inBookReference": "Book 25, Hadith 59"}, {"id": 60, "hadithNumber": "1844", "text": "Narrated 'Abdullah bin Ja'far: \"The Messenger of Allah (ﷺ) would eat snake cucumber with fresh dates. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib, we do not know of it except as a narration of Ibrahim bin Sa'd.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Abdullah bin Ja'far:", "reference": "https://sunnah.com/tirmidhi:1844", "inBookReference": "Book 25, Hadith 60"}, {"id": 61, "hadithNumber": "1845", "text": "Narrated Anas: \"Some of people from 'Urainah arrived in Al-Madinah, and they were uncomfortable (with the climate). So the Messenger of Allah (ﷺ) sent them some camels from charity. He told them: \"Drink from their milk and urine.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of Thabit. This Hadith has been reported through other routes from Anas. Abu Qilabah reported it from Anas, and Sa'eed bin Abu 'Arubah reported it from Qatadah, from Anas.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas:", "reference": "https://sunnah.com/tirmidhi:1845", "inBookReference": "Book 25, Hadith 61"}, {"id": 62, "hadithNumber": "1846", "text": "Narrated Salman: \"I read in the Tawrah that the blessing for food is in the Wudu' after it. So I mentioned that to the Prophet (ﷺ), telling him what I read in the Tawrah. So the Messenger of Allah (ﷺ) said: 'The food's blessing is in the Wudu' before it and the Wudu' after it.'\" He said: There are narrations on this topic from Anas and Abu Hurairah. [Abu 'Eisa said:] We do not know of this Hadith except as a narration of Qais bin Ar-Rabi'. Qais [bin Ar-Rabi'] was graded weak in Hadith. Abu Hashim Ar-Rumani's (a narrator in the chain) name is Yahya bin Dinar.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Salman:", "reference": "https://sunnah.com/tirmidhi:1846", "inBookReference": "Book 25, Hadith 62"}, {"id": 63, "hadithNumber": "1847", "text": "Narrated Ibn 'Abbas: \"The Messenger of Allah (ﷺ) cae out from the toilet and some food was brought to him. They said: 'Shall we bring you some water for Wudu'?' He said: 'I have only been ordered to perform Wudu' when standing for Salat.'\" [Abu 'Eisa said:] This Hadith is Hasan [Sahih]. 'Amr bin Dinar has reported it from Sa'eed bin Al-Huwairith, from Ibn 'Abbas. 'Ali bin Al-Madini said: 'Sufyan Ath-Thawri disliked washing the hands before eating food, and he disliked placing the bread under the bowl.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn 'Abbas:", "reference": "https://sunnah.com/tirmidhi:1847", "inBookReference": "Book 25, Hadith 63"}, {"id": 64, "hadithNumber": "1848", "text": "Narrated 'Ikrash bin Dhu'aib: \"Banu Murrah bin 'Ubaid sent me to bring the Sadaqah from their wealth of the Messenger of Allah (ﷺ). I arrived with him in Al-Madinah and found him sitting between the Muhajirin and the Ansar.\" He said: \"Then he took my hand and brought me to the home of Umm Salamah and he said: 'Do you have any food?' So a bowl containing a lot of Tharid with pieces of meat was brought to us, and presented for us to eat from it. So I began wandering my around it while the Messenger of Allah (ﷺ) ate from what was in front of him. He grabbed my right hand with his left hand, then he said: 'O 'Ikrash! Eat from one spot, for indeed the food is one.' Then a plate containing various dried dates\" - or fresh dates - 'Ubaidullah (a narrator) was not sure. He said: \"I began eating what was in front of me, while the hand of the Messenger of Allah (ﷺ) roamed about the plate. He said: 'O 'Ikrash! Eat from wherever you like, for indeed it is not all from the same variety.' Then water was brought, so the Messenger of Allah (ﷺ) washed his hands, and with the wetness of his hands he wiped his face, his forearms, and his head, and he said: 'O Ikrash! This is the Wudu' for that which has been altered by fire.'\" [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through the narration of Al-'Ala' bin Al-Fadl, and Al-Ala'was alone with this narration, and there is more in the story in the Hadith. And we do not know a Hadith from the Prophet (ﷺ) by 'Ikrash except this.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated 'Ikrash bin Dhu'aib:", "reference": "https://sunnah.com/tirmidhi:1848", "inBookReference": "Book 25, Hadith 64"}, {"id": 65, "hadithNumber": "1849", "text": "Narrated Abu Talut: \"I entered upon Anas bin Malik while he was eating gourd, and he was saying: 'O you tree! I do not like you but because of the Messenger of Allah (ﷺ) liked you.'\" He said: There is something on this topic from Hakim bin Jarir, from his father. [Abu 'Eisa said:] This Hadith is Gharib from this route.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Abu Talut:", "reference": "https://sunnah.com/tirmidhi:1849", "inBookReference": "Book 25, Hadith 65"}, {"id": 66, "hadithNumber": "1850", "text": "Narrated Anas bin Malik: \"I saw the Messenger of Allah (ﷺ) taking from the sides around the dish - meaning the gourd. Since then I still like it.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith has been reported through more than one route from Anas bin Malik.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/tirmidhi:1850", "inBookReference": "Book 25, Hadith 66"}, {"id": 67, "hadithNumber": "1851", "text": "Narrated 'Umar bin Al-Khattab: That the Messenger of Allah (ﷺ) said: \"Eat olive and use its oil, for indeed it is a blessed tree.\" [Abu 'Eisa said:] We do not know of this Hadith except through the narration of 'Abdur-Razzaq from Ma'mar (narrators in the chain of this Hadith). 'Abdur-Razzaq would narrate this with Idtirab. Sometimes he mentioned in it: \"From 'Umar, from the Prophet (ﷺ)\" and sometimes he reported it indicating doubt, saying: \"I think it is from 'Umar from the Prophet (ﷺ).\" And sometimes he said: \"From Zaid bin Aslam, from his father, from the Prophet (ﷺ)\" in a Mursal form.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Umar bin Al-Khattab:", "reference": "https://sunnah.com/tirmidhi:1851", "inBookReference": "Book 25, Hadith 67"}, {"id": 68, "hadithNumber": "1851", "text": "Another chain from Zaid bin Aslam, from his father, from the Prophet (ﷺ) with similar. And he did not mention \"from 'Umar\" in it.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1851", "inBookReference": "Book 25, Hadith 68"}, {"id": 69, "hadithNumber": "1852", "text": "Narrated Abu Asid: \"The Prophet (ﷺ) said: Eat of its oil and use it (the olives), for indeed it is from a blessed tree.\" [Abu 'Eisa said:] This Hadith is Gharib from this route. We only know of it from the narration of Sufyan At-Thawri, from 'Abdullah bin 'Eisa.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Asid:", "reference": "https://sunnah.com/tirmidhi:1852", "inBookReference": "Book 25, Hadith 69"}, {"id": 70, "hadithNumber": "1853", "text": "Narrated Isma'il bin Abi Khalid: From his father that Abu Hurairah informed them that the Prophet (ﷺ) said: \"When the servant of one of you has endured heat and smoke preparing his food for him, then let him take him by the hand and make him sit him down with him. If he refuses, then let him take a morsel and feed him with it.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Khalid is the father of Isma'il, his name is Sa'd.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Isma'il bin Abi Khalid:", "reference": "https://sunnah.com/tirmidhi:1853", "inBookReference": "Book 25, Hadith 70"}, {"id": 71, "hadithNumber": "1854", "text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"Spread the (greetings of) Salam, feed others, strike the heads (of the enemy disbelievers); you will inherit Paradise.\" He said: There are narrations on this topic from 'Abdullah bin 'Amr, Ibn 'Umar, Anas, 'Abdus-Salam, 'Abdur-Rahman bin 'Aish, and Shuraih bin Hani' from his father. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of [Ibn Ziyad] from Abu Hurairah.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1854", "inBookReference": "Book 25, Hadith 71"}, {"id": 72, "hadithNumber": "1855", "text": "Narrated 'Abdullah bin 'Amr: That the Messenger of Allah (ﷺ) said: \"(All of you) worship Ar-Rahman, feed others, spread the (greeting of) Salam, then you will enter Paradise in security.\" He said: This Hadith is Hasan Sahih.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Abdullah bin 'Amr:", "reference": "https://sunnah.com/tirmidhi:1855", "inBookReference": "Book 25, Hadith 72"}, {"id": 73, "hadithNumber": "1856", "text": "Narrated Anas bin Malik: That the Messenger of Allah (ﷺ) said: \"Take the 'Asha' meal, even if it is just with a handful of something to fill. For indeed avoiding the 'Asha' is from senility.\" [Abu 'Eisa said:] This Hadith is Munkar, we do not know of it except from this route. 'Anbasah was graded weak is Hadith. 'Abdul-Malik bin 'Allaq is unknown.", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Anas bin Malik:", "reference": "https://sunnah.com/tirmidhi:1856", "inBookReference": "Book 25, Hadith 73"}, {"id": 74, "hadithNumber": "1857", "text": "Narrated 'Umar bin Abi Salamah: That he entered upon the Messenger of Allah (ﷺ) while he has some food. He said: \"Sit down O my son! Mention Allah's Name and eat with your right hand, and eat what is nearest to you.\" [Abu 'Eisa said:] It has been reported from Hisham bin 'Urwah, from Abu Wajzah As-Sa'idi, from a man from Muzainah, from 'Umar bin Abu Salamah. The Companions of Hisham bin 'Urwah differed in reporting this Hadith. Abu Wajzah As-Sa'di's name is Yazid bin 'Ubaid.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated 'Umar bin Abi Salamah:", "reference": "https://sunnah.com/tirmidhi:1857", "inBookReference": "Book 25, Hadith 74"}, {"id": 75, "hadithNumber": "1858", "text": "Narrated Umm Kulthum: From 'Aishah that the Messenger of Allah (ﷺ) said: \"When one of you eats food, then let him say: 'Bismillah.' If he forgets in the beginning, then let him say: 'Bismillah Fi Awwalihi Wa Akhirih (In the Name of Allah in its beginning and its end.)\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Umm Kulthum:", "reference": "https://sunnah.com/tirmidhi:1858", "inBookReference": "Book 25, Hadith 75"}, {"id": 76, "hadithNumber": "76", "text": "It is narrated with this chain of narration, from 'Aishah who said: \"The Prophet (ﷺ) was eating food with six of his Companions. A Bedouin came and ate it in two mouthfuls. So the Messenger of Allah (ﷺ) said: \"As for him, had he mentioned (Allah's Name), it would have been enough for all of you.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Kulthum is the daughter of Muhammad bin Abi Bakr As-Siddiq, may Allah be pleased with them.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/tirmidhi:1858b", "inBookReference": "Book 25, Hadith 76"}, {"id": 77, "hadithNumber": "1859", "text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"Indeed Ash-Shaitan has a sense of taste, for which he licks, so beware of him. So whoever spends the night with [a smell] on his hand and something happens to him, then let him not blame anyone but himself.\" [Abu 'Eisa said:] This Hadith is Gharib from this route. It has also been reported in a narration of Suhail bin Abi Salih, from his father, from Abu Hurairah, from the Prophet (ﷺ).", "grade": "Mawdu' (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1859", "inBookReference": "Book 25, Hadith 77"}, {"id": 78, "hadithNumber": "1860", "text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"Whoever spends the night with [a smell] on his hand and something happens to him, then let him not blame anyone but himself.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it as a narration of Al-'Amash except through this route.", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Hurairah:", "reference": "https://sunnah.com/tirmidhi:1860", "inBookReference": "Book 25, Hadith 78"}]}