{"collection":"tirmidhi","collectionName":"Jami at-Tirmidhi","book":29,"bookName":"Chapters On Inheritance","hadiths":[{"id":1,"hadithNumber":"1","text":"\"Whoever leaves wealth then it is for his heirs, and whoever leaves poor dependents then it (the responsibility) is for me.\"","grade":null,"narratedBy":"Abu Hurairah narrated that the Messenger of Allah(S.A.W) said:"},{"id":2,"hadithNumber":"2","text":"\"Learn the laws of inheritance and the Quran, and teach the people, for I am a mortal.\"","grade":null,"narratedBy":"Abu Hurairah narrated that the Messenger of Allah(S.A.W) said:"},{"id":3,"hadithNumber":"3","text":"\"The wife of Sa'd bin Ar-Rabi came with her two daughters from Sa'd to he Messenger of Allah(S.A.W)and said; O Messenger of Allah(S.A.W)! these two are daughters of Sa'd bin Ar-Rabi who fought along with you on the day of Uhud and was martyred. Their uncle took their wealth, without leaving any wealth for them, and they will not be married unless they have wealth.' He said: 'Allah will decide on that matter.' The ayah about inheritance was revealed, so the Messenger of Allah(S.A.W) sent  (word) to their Uncle saying: Give the two daughters of Sa'd two thirds, and give their mother one eighth, and whatever remains, then it is for you.'","grade":null,"narratedBy":"Jabir bin 'Abdullah said:"},{"id":4,"hadithNumber":"4","text":"\"A man came to Abu Musa and Salman bin Rabiah and asked them about a daughter, a son's daughter, a father's sister and a mother's sister. So they said: 'For the daughter is half, for the sister of the father  and the mother is what remains.' And they said to him: Go to Abdullah (bin Masud) and ask him, for surely he will concur with us.' So he went to  'Abdullah mentioning that to him and informing him what they had said. 'Abdulah said: 'If that were the case, then I would ave erred and not been among the rightly-guided (on the matter). Rather, I will judge with what the Messenger of Allah(S.A.W) judged: For the daughter is half, for the son's daughter a sixth, totaling two-thirds and for the sister is what remains.'\"","grade":null,"narratedBy":"Huzail bin Shurahbil said:"},{"id":5,"hadithNumber":"5","text":"\"You recite this ayah: After payment of legacies he(or she) may have bequeathed or debts, without causing harm. And indeed the Messenger of Allah(S.A.W) judged the debt before the will and that the children  (sons and daughters)from the same mother and father inherit,not the sons from various mothers. The man inherits from his brother from his father, and his mother, not his brother from his father.\n\nAnother chain reports a similar narration.","grade":null,"narratedBy":"Al-Harith narrated that 'Ali said:"},{"id":6,"hadithNumber":"6","text":"\"The Messenger of Allah(S.A.W) judged that the children (sons and daughters) from the same mother and father inherit, not the sons from various mothers.\"","grade":null,"narratedBy":"Al-Harith narrated that 'Ali said:"},{"id":7,"hadithNumber":"7","text":"\"The Messenger of Allah(S.A.W) came to visit me while I was ill at Banu Salamah. I said : 'O  Prophet of Allah(S.A.W)! How shall I divide my wealth among my children?' But he did not say anything to me, until the following was revealed: Allah commands you regarding  your children's (inheritance): to the male, a portion equal to that of two females.\"","grade":null,"narratedBy":"Jabir bin 'Abdullah said:"},{"id":8,"hadithNumber":"8","text":"\"I was ill, so the Messenger of Allah(S.A.W)came to visit me and found me unconscious. He came walking while Abu Bakr and 'Umar were with him. The Messenger of Allah(S.A.W) performed Wudu, then poured the remaining water on me, so I came to my senses. I said: 'O Messenger of Allah(S.A.W)! how shall I dispose of my wealth?' - or - 'What shall I do with my wealth?' He did not reply anything to me\" -and he had nine sisters- \"until the Ayah about the inheritance was revealed: they ask you for a legal verdict. Say: \"Allah directs (thus) about Al-Kalalah.\" Jabir said: \"It was revealed regarding me.\"","grade":null,"narratedBy":"Jabir bin 'Abdullah said:"},{"id":9,"hadithNumber":"9","text":"\"Give the shares of inheritance to those who are entitled to them. As for what remains, then it is for the closet male relative.\"\n\nAnother chain reports similar narration.","grade":null,"narratedBy":"Ibn 'Abbas narrated that the Messenger of Allah(S.A.W) said:"},{"id":10,"hadithNumber":"10","text":"\"A man came to the Prophet (S.A.W) and said\" 'My son died, so what do I inherit from him?' He said: 'For you is a sixth.' When he turned to leave,he called him and said: 'For you is another sixth.' So when he turned to leave , he called him saying: 'The last sixth is consumable for you.'\"","grade":null,"narratedBy":"'Imran bin Husain narrated:"},{"id":11,"hadithNumber":"11","text":"\"A grandmother - the mother of a mother, or the mother of a father - came to Abu Bakr and she said: 'a son of my son' - or, 'a son of my daughter died, and I have been informed that there is a right ( from the wealth) for me in the Book.' So Abu Bakr said: 'I do not find that there is a right for you in the Book, and I have not heard that the Messenger of Allah(S.A.W) judged anything for you. I shall ask the people.' So, Al-Mughirah bin Shu'bah testified that the Messenger of Allah(S.A.W) gave her (case) a sixth. He said: 'And who heard that along with you?' He said: 'Muhammad bin Maslamah.'\" He said: \"So he gave her a sixth. Then the other grandmother who was left behind came to 'Umar.\" Sufyan said: \"And  Ma'mar said to me in addition, from Az-Zuhri - and I do not remember it to be from Az-Zuhri, rather I remember it to be from Ma'mar - that 'Umar said: 'If the two of you are together then it is for both of you, and whichever of you is alone with it (the sixth), then it is for her.'\"","grade":null,"narratedBy":"Qabisah bin Dhuw'aib said:"},{"id":12,"hadithNumber":"12","text":"\"A grandmother came to Abu Bakr to ask him about her inheritance. He said to her, 'There is noting for you in the Book of Allah and there is nothing for you in the Sunnah of the Messenger of Allah(S.A.W). So ,return until I ask the people. So he asked the people and  Al-Mughirah bin Shu'bah said: 'I was  present when the Messenger of Allah(S.A.W) gave her (case) a sixth.' So he said: 'Was anyone else with you?' Muhammad bin Maslamah stood to say the same as what  Al-Mughirah bin Shu'bah said. So Abu Bakr implemented that for her.\" Then the other grandmother came to 'Umar bin Al-Khattab to ask him about her inheritance. He said: 'There is nothing in the Book of Allah for you, but there is that sixth. So if the two of you are together then it is for both of you, and whichever of you remains), then it is for her.'\"","grade":null,"narratedBy":"Qabisah bin Dhuw'aib said:"},{"id":13,"hadithNumber":"13","text":"\"The Messenger of Allah(S.A.W) gave the first grandmother, along with her son, a sixth for them to consume while her son was living.\"","grade":null,"narratedBy":"'Abdullah bin Mas'ud said, about the grandmother along with her daughter:"},{"id":14,"hadithNumber":"14","text":"\"'Umar bin Al-Khattab sent me with a letter to Abu'Ubaidah (saying) that The Messenger of Allah(S.A.W) said : 'Allah and His Messenger are responsible for the one who has no patron. And the maternal uncle inherits from the one who has no heirs.'\"","grade":null,"narratedBy":"Abu Umamah bin Sahl bin Hunaif said:"},{"id":15,"hadithNumber":"15","text":"\"The maternal uncle inherits from the one who has no heirs.\"","grade":null,"narratedBy":"Aishah narrated that the Messenger of Allah(S.A.W) said:"},{"id":16,"hadithNumber":"16","text":"\"See if he has any heirs.\" They said: \"No.\" He said: 'Pay it to someone among the people of the town.\"","grade":null,"narratedBy":"Aishah narrated that a freed slave of the Prophet (s.a.w) fell from foliage on a date-palm and died. So the Prophet (S.A.W) said:"},{"id":17,"hadithNumber":"17","text":"a man died during the time of the Messenger of Allah(S.A.W) ,and he did not leave any heirs except for a slave that he had freed. So the Prophet gave him his inheritance","grade":null,"narratedBy":"Ibn 'Abbas narrated that :"},{"id":18,"hadithNumber":"18","text":"\"The Muslim does not inherit from the disbeliever, nor the disbeliever from the Muslim.\"\nAnother chain reports a similar narration.","grade":null,"narratedBy":"Usamah bin Zaid narrated that the Messenger of Allah(S.A.W) said:"},{"id":19,"hadithNumber":"19","text":"\"The people of two religions do not inherit from each other.\"","grade":null,"narratedBy":"Jabir narrated that the Prophet(S.A.W) said:"},{"id":20,"hadithNumber":"20","text":"\"The murderer will not inherit.\"","grade":null,"narratedBy":"Abu Hurairah narrated that the Prophet(S.A.W) said:"},{"id":21,"hadithNumber":"21","text":"\"'Umar said: 'The blood-money is upon the 'Aqilah, and the wife does not inherit anything from the blood-money of her husband.' So Ad-Dahhak bin Sufyan Al-Kilabi informed him that the Messenger of Allah(S.A.W) wrote to him, (saying) to give the wife of Ashyam Ad-Dababi the inheritance from her husband's blood-money.'\"","grade":null,"narratedBy":"Sa'eed bin Al-Musayyab said:"},{"id":22,"hadithNumber":"22","text":"the Messenger of Allah(S.A.W) judged the payment of a Gurrah male or female slave in the case of a woman's fetus from Banu Libyan which miscarried. Then the woman who was required to give the Gurrah died, so the Messenger of Allah(S.A.W) judged that her inheritance be given to her children and her husband, and that her blood-money be paid by her 'Asabah.","grade":null,"narratedBy":"Abu Hurairah narrated that :"},{"id":23,"hadithNumber":"23","text":"'I asked the  Messenger of Allah(S.A.W): What is the Sunnah regarding a man among the people of the Shirk who accepts Islam at the hand of a man among the Muslims?' So the Messenger of Allah(S.A.W) said:\n\"He is the closet of the people to him in his life and in his death.'\"","grade":null,"narratedBy":"Abudullah bin Mawhab - and some of them said- 'Abdullah bin Wahb, narrated from Tamim Ad-Dari who said:"},{"id":24,"hadithNumber":"24","text":"\"Any man who fornicates with a free woman, or a slave woman, then the child born from Zina does not inherit, nor is it inherited from.\"","grade":null,"narratedBy":"Amr bin Shu'aib narrated from his father, from his grandfather, that the Messenger of Allah(S.A.W) said:"},{"id":25,"hadithNumber":"25","text":"\"The one who inherits the Wala is the one who inherits the wealth.\"","grade":null,"narratedBy":"Amr bin Shu'aib narrated from his father, from his grandfather, that the Messenger of Allah(S.A.W) said:"},{"id":26,"hadithNumber":"26","text":"\"The woman collects three inheritance: Whomever she freed, whomever she found, and the child for which she made Li'an.\"","grade":null,"narratedBy":"Wathilah bin Al-Asqa' narrated  that the Messenger of Allah(S.A.W) said:"}]}