{"collection":"tirmidhi","collectionName":"Jami at-Tirmidhi","book":35,"bookName":"Chapters On Witnesses","hadiths":[{"id":1,"hadithNumber":"1","text":"\"Shall l not inform you of the best of witnesses? The one who comes with his testimony before being asked for it.\"","grade":null,"narratedBy":"Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah (s.a.w) said:"},{"id":2,"hadithNumber":"2","text":"Ibn Abi 'Amrah.\"","grade":null,"narratedBy":"(Another chain) from Malik in which he said:"},{"id":3,"hadithNumber":"3","text":"\"The best of witnesses is the one who gives his testimony before  being asked  for it.\"","grade":null,"narratedBy":"Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah(s.a.w)   said:"},{"id":4,"hadithNumber":"4","text":"The testimony of a treacherous man is not acceptable nor a treacherous woman nor a man lashed for the Hadd nor a woman lashed nor one possessing malice of enmity nor a rehearsed witness nor the Qani of (one contracted by)the family on their behalf nor the one associating himself to other than his Wala or to other than his  relatives.\"","grade":null,"narratedBy":"Aishah narrated that the Messenger of Allah (s.a.w) said:"},{"id":5,"hadithNumber":"5","text":"\"O you people False witness  is tantamount to Shirk with Allah\" Then the Messenger of Allah (s.a.w)recited: So shun the Rijs of the idols, and shun false speech.","grade":null,"narratedBy":"Ayman bin Khuraim narrated that the Prophet (s.a.w) stood to give a Khutbah and said:"},{"id":6,"hadithNumber":"6","text":"\"O you people! False witness is tantamount to Shirk with Allah.\"Saying it three times, then he recited this Ayah And shun false speech Until the end of the Ayah.","grade":null,"narratedBy":"Khuraim bin Fatik Al-Asadi narrated that the Messenger of Allah (s.a.w) performed the Subh (Fajr)prayer. Then when he turned  he got up to stand and said:"},{"id":7,"hadithNumber":"7","text":"\"Shall I not inform you of the greatest of the major sins?\" They said: \"Of course O Messenger of Allah(s.a.w)!\" He said: \"Shirk with Allah disobeying parents, and false testimony.\" Or: \"False speech\" He said: \"So the Messenger of Allah(s.a.w) would not stop saying it until we said ( to ourselves): 'I wish he would  be quiet. \"","grade":null,"narratedBy":"'Abdur-Rahman bin Abi Bakrah narrated from his father that the Messenger of Allah (s.a.w) said:"},{"id":8,"hadithNumber":"8","text":"\"The best of people are my generation, then those who follow them,then those who follow them, then those who follow them.\"(He(s.a.w)said that) three times. \"Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it.\"","grade":null,"narratedBy":"'Imran bin Husain narrated that the Messenger of Allah(s.a.w)said:"},{"id":9,"hadithNumber":"9","text":"Another chain on the authority of 'Imran bin Husain narrates a similar narration.","grade":null,"narratedBy":null},{"id":10,"hadithNumber":"10","text":"\"The best of people are my generation, then those who follow them,then those who follow them. Then lying will spread, until a man testifies while his testimony was not requested, and a man will take an oath while an oath was not sought.\"","grade":null,"narratedBy":"Clarification of this is in the Hadith of 'Umar bin Al-Khattab, from the Prophet(s.a.w) who said:"}]}