{"verses":[{"verseKey":"30:1","text":"Alif Lam Mim"},{"verseKey":"30:2","text":"The Byzantines have been defeated"},{"verseKey":"30:3","text":"in a nearby land. They will reverse their defeat with a victory"},{"verseKey":"30:4","text":"in a few years’ time––God is in command, first and last. On that day, the believers will rejoice"},{"verseKey":"30:5","text":"at God’s help. He helps whoever He pleases: He is the Mighty, the Merciful"},{"verseKey":"30:6","text":"This is God’s promise: God never breaks His promise, but most people do not know"},{"verseKey":"30:7","text":"they only know the outer surface of this present life and are heedless of the life to come"},{"verseKey":"30:8","text":"Have they not thought about their own selves? God did not create the heavens and earth and everything between them without a serious purpose and an appointed time, yet many people deny that they will meet their Lord"},{"verseKey":"30:9","text":"Have they not travelled through the land and seen how their predecessors met their end? They were mightier than them: they cultivated the earth more and built more upon it. Their own mes-sengers also came to them with clear signs: God did not wrong them; they wronged themselves"},{"verseKey":"30:10","text":"Later the evildoers met a terrible end for rejecting and [repeatedly] mocking God’s revelations"},{"verseKey":"30:11","text":"God brings creation into being; in the end He will reproduce it and it is to Him you will be recalled"},{"verseKey":"30:12","text":"On the Day the Hour arrives, the guilty will despair"},{"verseKey":"30:13","text":"and they will have no intercessors among those partners they ascribed to God- they will deny these partners"},{"verseKey":"30:14","text":"When the Hour arrives, on that Day people will be separated"},{"verseKey":"30:15","text":"those who believed and did good deeds will delight in a Garden"},{"verseKey":"30:16","text":"while those who disbelieved and denied Our messages and the meeting of the Hereafter will be brought for punishment"},{"verseKey":"30:17","text":"So celebrate God’s glory in the evening, in the morning"},{"verseKey":"30:18","text":"praise is due to Him in the heavens and the earth- in the late afternoon, and at midday"},{"verseKey":"30:19","text":"He brings the living out of the dead and the dead out of the living. He gives life to the earth after death, and you will be brought out in the same way"},{"verseKey":"30:20","text":"One of His signs is that He created you from dust and- lo and behold!- you became human and scattered far and wide"},{"verseKey":"30:21","text":"Another of His signs is that He created spouses from among yourselves for you to live with in tranquillity: He ordained love and kindness between you. There truly are signs in this for those who reflect"},{"verseKey":"30:22","text":"Another of His signs is the creation of the heavens and earth, and the diversity of your languages and colours. There truly are signs in this for those who know"},{"verseKey":"30:23","text":"Among His signs are your sleep, by night and by day, and your seeking His bounty. There truly are signs in this for those who can hear"},{"verseKey":"30:24","text":"Among His signs, too, are that He shows you the lightning that terrifies and inspires hope; that He sends water down from the sky to restore the earth to life after death. There truly are signs in this for those who use their reason"},{"verseKey":"30:25","text":"Among His signs, too, is the fact that the heavens and the earth stand firm by His command. In the end, you will all emerge when He calls you from the earth"},{"verseKey":"30:26","text":"Everyone in the heavens and earth belongs to Him, and all are obedient to Him"},{"verseKey":"30:27","text":"He is the One who originates creation and will do it again- this is even easier for Him. He is above all comparison in the heavens and earth; He is the Almighty, the All Wise"},{"verseKey":"30:28","text":"He gives you this example, drawn from your own lives: do you make your slaves full partners with an equal share in what We have given you? Do you fear them as you fear each other? This is how We make Our messages clear to those who use their reason"},{"verseKey":"30:29","text":"And still the idolaters follow their own desires without any knowledge. Who can guide those God leaves to stray, who have no one to help them"},{"verseKey":"30:30","text":"So [Prophet] as a man of pure faith, stand firm and true in your devotion to the religion. This is the natural disposition God instilled in mankind- there is no altering God’s creation- and this is the right religion, though most people do not realize it"},{"verseKey":"30:31","text":"Turn to Him alone, all of you. Be mindful of Him; keep up the prayer; do not join those who ascribe partners to God"},{"verseKey":"30:32","text":"those who divide their religion into sects, with each party rejoicing in their own"},{"verseKey":"30:33","text":"When something bad happens to people, they cry to their Lord and turn to Him for help, but no sooner does He let them taste His blessing than- lo and behold!- some of them ascribe partners to their Lord"},{"verseKey":"30:34","text":"showing no gratitude for what We have given them. ‘Take your pleasure! You will come to know.’"},{"verseKey":"30:35","text":"Did We send them down any authority that sanctions the partners they ascribe to God"},{"verseKey":"30:36","text":"When We give people a taste of Our blessing, they rejoice, but when something bad happens to them- because of their own actions- they fall into utter despair"},{"verseKey":"30:37","text":"Do they not see that God gives abundantly to whoever He will and sparingly [to whoever He will]? There truly are signs in this for those who believe"},{"verseKey":"30:38","text":"So give their due to the near relative, the needy, and the wayfarer- that is best for those whose goal is God’s approval: these are the ones who will prosper"},{"verseKey":"30:39","text":"Whatever you lend out in usury to gain value through other people’s wealth will not increase in God’s eyes, but whatever you give in charity, in your desire for God’s approval, will earn multiple rewards"},{"verseKey":"30:40","text":"It is God who created you and provided for you, who will cause you to die and then give you life again. Which of your ‘partners’ can do any one of these things? Glory be to God, and exalted be He above the partners they attribute to Him"},{"verseKey":"30:41","text":"Corruption has flourished on land and sea as a result of people’s actions and He will make them taste the consequences of some of their own actions so that they may turn back"},{"verseKey":"30:42","text":"Say, ‘Travel through the land, and see how those before you met their end- most of them were idolaters.’"},{"verseKey":"30:43","text":"[Prophet], stand firm in your devotion to the upright religion, before an irresistible Day comes from God. On that Day, mankind will be divided"},{"verseKey":"30:44","text":"those who rejected the truth will bear the burden of that rejection, and those who did good deeds will have made good provision for themselves"},{"verseKey":"30:45","text":"From His bounty God will reward those who believe and do good deeds; He does not like those who reject the truth"},{"verseKey":"30:46","text":"Another of His signs is that He sends out the winds bearing good news, giving you a taste of His grace, making the ships sail at His command, enabling you to [journey in] search of His bounty so that you may be grateful"},{"verseKey":"30:47","text":"Before you [Muhammad], We sent mes-sengers, each to their own people: they brought them clear proofs and then We punished the evildoers. We make it Our duty to help the believers"},{"verseKey":"30:48","text":"It is God who sends out the winds; they stir up the clouds; He spreads them over the skies as He pleases; He makes them break up and you see the rain falling from them. See how they rejoice when He makes it fall upon whichever of His servants He wishes"},{"verseKey":"30:49","text":"though before it is sent they may have lost all hope"},{"verseKey":"30:50","text":"Look, then, at the imprints of God’s mercy, how He restores the earth to life after death: this same God is the one who will return people to life after death- He has power over all things"},{"verseKey":"30:51","text":"Yet they will continue in their disbelief, even if We send a [scorching] wind and they see their crops turn yellow"},{"verseKey":"30:52","text":"You [Prophet] cannot make the dead hear and you cannot make the deaf hear your call when they turn their backs and leave"},{"verseKey":"30:53","text":"you cannot lead the blind out of their error: the only ones you can make hear you are those who believe in Our revelations and devote themselves [to Us]"},{"verseKey":"30:54","text":"It is God who creates you weak, then gives you strength, then weakness after strength, together with your grey hair: He creates what He will; He is the All Knowing, the All Powerful"},{"verseKey":"30:55","text":"On the Day the Hour comes, the guilty will swear they lingered no more than an hour- they have always been deluded"},{"verseKey":"30:56","text":"but those endowed with knowledge and faith will say, ‘In accordance with God’s decree, you actually lingered till the Day of Resurrection: this is the Day of Resurrection, yet you did not know.’"},{"verseKey":"30:57","text":"On that Day the evildoers’ excuses will be of no use to them: they will not be allowed to make amends"},{"verseKey":"30:58","text":"In this Quran We have set every kind of illustration before people, yet if you [Prophet] brought them a miracle, the disbelievers would still say, ‘You [prophets] deal only in falsehood.’"},{"verseKey":"30:59","text":"In this way God seals the hearts of those who do not know"},{"verseKey":"30:60","text":"so be patient, for God’s promise is true: do not let those with no firm beliefs discourage you"}]}