{"verses":[{"verseKey":"36:1","text":"Ya Sin"},{"verseKey":"36:2","text":"By the wise Quran"},{"verseKey":"36:3","text":"you [Muhammad] are truly one of the mes-sengers sent"},{"verseKey":"36:4","text":"on a straight path"},{"verseKey":"36:5","text":"with a revelation from the Almighty, the Lord of Mercy"},{"verseKey":"36:6","text":"to warn a people whose forefathers were not warned, and so they are unaware"},{"verseKey":"36:7","text":"The verdict has been passed against most of them, for they refuse to believe"},{"verseKey":"36:8","text":"[It is as if] We had placed [iron] collars around their necks, right up to their chins so that their heads are forced up"},{"verseKey":"36:9","text":"and set barriers before and behind them, blocking their vision: they cannot see"},{"verseKey":"36:10","text":"It is all the same to them whether you warn them or not: they will not believe"},{"verseKey":"36:11","text":"You can warn only those who will follow the Quran and hold the Merciful One in awe, though they cannot see Him: give such people the glad news of forgiveness and a noble reward"},{"verseKey":"36:12","text":"We shall certainly bring the dead back to life, and We record what they send ahead of them as well as what they leave behind: We keep an account of everything in a clear Record"},{"verseKey":"36:13","text":"Give them the example of the people to whose town messengers came"},{"verseKey":"36:14","text":"We sent two messengers but they rejected both. Then We reinforced them with a third"},{"verseKey":"36:15","text":"They said, ‘Truly, we are messengers to you,’"},{"verseKey":"36:16","text":"but they answered, ‘You are only men like ourselves. The Lord of Mercy has sent nothing; you are just lying.’ They said, ‘Our Lord knows that we have been sent to you"},{"verseKey":"36:17","text":"Our duty is only to deliver the message to you,’"},{"verseKey":"36:18","text":"but they answered, ‘We think you are an evil omen. If you do not stop, we shall stone you, and inflict a painful torment on you.’"},{"verseKey":"36:19","text":"The messengers said, ‘The evil omen is within yourselves. Why do you take it as an evil omen when you are reminded of the Truth? You are going too far!’"},{"verseKey":"36:20","text":"Then, from the furthest part of the city, a man came running. He said, ‘My people, follow the messengers"},{"verseKey":"36:21","text":"Follow them: they are not asking you to reward them and they are rightly guided"},{"verseKey":"36:22","text":"Why should I not worship the One who created me? It is to Him that you will be returned"},{"verseKey":"36:23","text":"How could I take besides Him any other gods, whose intercession will not help me and who would not be able to save me if the Lord of Mercy wished to harm me"},{"verseKey":"36:24","text":"Then I would clearly be in the wrong"},{"verseKey":"36:25","text":"I believe in your Lord, so listen to me.’"},{"verseKey":"36:26","text":"He was told, ‘Enter the Garden,’ so he said, ‘If only my people knew"},{"verseKey":"36:27","text":"how my Lord has forgiven me and set me among the highly honoured.’"},{"verseKey":"36:28","text":"After him We did not send any army from heaven against his people, nor were We about to"},{"verseKey":"36:29","text":"there was just one blast, and they fell down lifeless"},{"verseKey":"36:30","text":"Alas for human beings! Whenever a messenger comes to them they ridicule him"},{"verseKey":"36:31","text":"Do they not see how many generations We have destroyed before them, none of whom will ever come back to them"},{"verseKey":"36:32","text":"[Yet] all of them will be brought before Us"},{"verseKey":"36:33","text":"There is a sign for them in the lifeless earth: We give it life and We produce grain from it for them to eat"},{"verseKey":"36:34","text":"We have put gardens of date palms and grapes in the earth, and We have made springs of water gush out of it"},{"verseKey":"36:35","text":"so that they could eat its fruit. It was not their own hands that made all this. How can they not give thanks"},{"verseKey":"36:36","text":"Glory be to Him who created all the pairs of things that the earth produces, as well as themselves and other things they do not know about"},{"verseKey":"36:37","text":"The night is also a sign for them: We strip the daylight from it, and- lo and behold!- they are in darkness"},{"verseKey":"36:38","text":"The sun, too, runs its determined course laid down for it by the Almighty, the All Knowing"},{"verseKey":"36:39","text":"We have determined phases for the moon until finally it becomes like an old date-stalk"},{"verseKey":"36:40","text":"The sun cannot overtake the moon, nor can the night outrun the day: each floats in [its own] orbit"},{"verseKey":"36:41","text":"Another sign for them is that We carried their seed in the laden Ark"},{"verseKey":"36:42","text":"and We have made similar things for them to ride in"},{"verseKey":"36:43","text":"If We wished, We could drown them, and there would be no one to help them: they could not be saved"},{"verseKey":"36:44","text":"Only by Our mercy could they be reprieved to enjoy life for a while"},{"verseKey":"36:45","text":"Yet when they are told, ‘Beware of what lies before and behind you, so that you may be given mercy,’"},{"verseKey":"36:46","text":"they ignore every single sign that comes to them from their Lord"},{"verseKey":"36:47","text":"and when they are told, ‘Give to others out of what God has provided for you,’ the disbelievers say to the believers, ‘Why should we feed those that God could feed if He wanted? You must be deeply misguided.’"},{"verseKey":"36:48","text":"And they say, ‘When will this promise be fulfilled, if what you say is true?’"},{"verseKey":"36:49","text":"But all they are waiting for is a single blast that will overtake them while they are still arguing with each other"},{"verseKey":"36:50","text":"They will have no time to make bequests, nor will they have the chance to return to their own people"},{"verseKey":"36:51","text":"The Trumpet will be sounded and- lo and behold!- they will rush out to their Lord from their graves"},{"verseKey":"36:52","text":"They will say, ‘Alas for us! Who has resurrected us from our resting places?’ [They will be told], ‘This is what the Lord of Mercy promised, and the messengers told the truth.’"},{"verseKey":"36:53","text":"It was just one single blast and then- lo and behold!- they were all brought before Us"},{"verseKey":"36:54","text":"‘Today, no soul will be wronged in the least: you will only be repaid for your deeds"},{"verseKey":"36:55","text":"The people of Paradise today are happily occupied"},{"verseKey":"36:56","text":"they and their spouses- seated on couches in the shade"},{"verseKey":"36:57","text":"There they have fruit and whatever they ask for"},{"verseKey":"36:58","text":"“Peace,” a word from the Lord of Mercy"},{"verseKey":"36:59","text":"But step aside today, you guilty ones"},{"verseKey":"36:60","text":"Children of Adam, did I not command you not to serve Satan, for he was your sworn enemy"},{"verseKey":"36:61","text":"but to serve Me? This is the straight path"},{"verseKey":"36:62","text":"He has led great numbers of you astray. Did you not use your reason"},{"verseKey":"36:63","text":"So this is the Fire that you were warned against"},{"verseKey":"36:64","text":"Enter it today, because you went on ignoring [my commands].’"},{"verseKey":"36:65","text":"On that Day We shall seal up their mouths, but their hands will speak to Us, and their feet bear witness to everything they have done"},{"verseKey":"36:66","text":"If it had been Our will, We could have taken away their sight. They would have struggled to find the way, but how could they have seen it"},{"verseKey":"36:67","text":"If it had been Our will, We could have paralysed them where they stood, so that they could not move forward or backward"},{"verseKey":"36:68","text":"If We extend anyone’s life, We reverse his development. Do they not use their reason"},{"verseKey":"36:69","text":"We have not taught the Prophet poetry, nor could he everhave been a poet"},{"verseKey":"36:70","text":"This is a revelation, an illuminating Quran to warn anyone who is truly alive, so that God’s verdict may be passed against the disbelievers"},{"verseKey":"36:71","text":"Can they not see how, among the things made by Our hands, We have created livestock they control"},{"verseKey":"36:72","text":"and made them obedient, so that some can be used for riding, some for food"},{"verseKey":"36:73","text":"some for other benefits, and some for drink? Will they not give thanks"},{"verseKey":"36:74","text":"Yet they have taken other gods besides God to help them"},{"verseKey":"36:75","text":"though these could not do so even if they called a whole army of them together"},{"verseKey":"36:76","text":"So [Prophet] do not be distressed at what they say: We know what they conceal and what they reveal"},{"verseKey":"36:77","text":"Can man not see that We created him from a drop of fluid? Yet- lo and behold!- he disputes openly"},{"verseKey":"36:78","text":"producing arguments against Us, forgetting his own creation. He says, ‘Who can give life back to bones after they have decayed?’"},{"verseKey":"36:79","text":"Say, ‘He who created them in the first place will give them life again: He has full knowledge of every act of creation"},{"verseKey":"36:80","text":"It is He who produces fire for you out of the green tree- lo and behold!- and from this you kindle fire"},{"verseKey":"36:81","text":"Is He who created the heavens and earth not able to create the likes of these people? Of course He is! He is the All Knowing Creator"},{"verseKey":"36:82","text":"when He wills something to be, His way is to say, “Be”- and it is"},{"verseKey":"36:83","text":"So glory be to Him in whose Hand lies control over all things. It is to Him that you will all be brought back.’"}]}