{"verses":[{"verseKey":"44:1","text":"Ha Mim"},{"verseKey":"44:2","text":"By the Scripture that makes things clear"},{"verseKey":"44:3","text":"truly We sent it down on a blessed night––We have always sent warnings––"},{"verseKey":"44:4","text":"a night when every matter of wisdom was made distinct"},{"verseKey":"44:5","text":"at Our command––We have always sent messages to man––"},{"verseKey":"44:6","text":"as a mercy [Prophet] from your Lord who sees and knows all"},{"verseKey":"44:7","text":"Lord of the heavens and the earth and everything between––if only you people were firm believers––"},{"verseKey":"44:8","text":"there is no god but Him: He gives life and death––He is your Lord and the Lord of your forefathers––"},{"verseKey":"44:9","text":"yet in [their state of] doubt they take nothing seriously"},{"verseKey":"44:10","text":"[Prophet], watch out for the Day when the sky brings forth clouds of smoke for all to see"},{"verseKey":"44:11","text":"It will envelop the people. They will cry, ‘This is a terrible torment"},{"verseKey":"44:12","text":"Lord relieve us from this torment! We believe!’"},{"verseKey":"44:13","text":"How will this [sudden] faith benefit them? When a prophet came to warn them plainly"},{"verseKey":"44:14","text":"they turned their backs on him, saying, ‘He is tutored! He is possessed!’"},{"verseKey":"44:15","text":"We shall hold the torment back for a while ––you are sure to return [to Us]––"},{"verseKey":"44:16","text":"and on the Day We seize [them] mightily We shall exact retribution"},{"verseKey":"44:17","text":"We tested the people of Pharaoh before them: a noble messenger was sent to them"},{"verseKey":"44:18","text":"saying, ‘Hand the servants of God over to me! I am a faithful messenger who has been sent to you"},{"verseKey":"44:19","text":"Do not consider yourselves to be above God! I come to you with clear authority"},{"verseKey":"44:20","text":"I seek refuge in my Lord and yours against your insults"},{"verseKey":"44:21","text":"If you do not believe me, just let me be.’"},{"verseKey":"44:22","text":"[Moses] cried to his Lord, ‘These people are evildoers!’"},{"verseKey":"44:23","text":"[God replied], ‘Escape in the night with My servants, for you are sure to be pursued"},{"verseKey":"44:24","text":"Leave the sea behind you parted and their army will be drowned.’"},{"verseKey":"44:25","text":"Many a garden and spring they left behind"},{"verseKey":"44:26","text":"many a cornfield and noble building"},{"verseKey":"44:27","text":"many a thing in which they had delighted"},{"verseKey":"44:28","text":"We gave these to another people to inherit"},{"verseKey":"44:29","text":"Neither heavens nor earth shed a tear for them, nor were they given any time"},{"verseKey":"44:30","text":"We saved the Children of Israel from their degrading suffering"},{"verseKey":"44:31","text":"at the hands of Pharaoh: he was a tyrant who exceeded all bounds"},{"verseKey":"44:32","text":"We chose them knowingly above others"},{"verseKey":"44:33","text":"We gave them revelations in which there was a clear test"},{"verseKey":"44:34","text":"These people here assert"},{"verseKey":"44:35","text":"‘There is nothing beyond our one death: we will not be resurrected"},{"verseKey":"44:36","text":"Bring back our forefathers, if what you say is true.’"},{"verseKey":"44:37","text":"Are they better than the people of Tubbaand those who flourished before them? We destroyed them all- they were guilty"},{"verseKey":"44:38","text":"We were not playing a pointless game when We created the heavens and earth and everything in between"},{"verseKey":"44:39","text":"We created them for a true purpose, but most people do not comprehend"},{"verseKey":"44:40","text":"The Day of Decision is the time appointed for all"},{"verseKey":"44:41","text":"a Day when no friend can take another’s place"},{"verseKey":"44:42","text":"No one will receive any help except for those to whom God shows mercy: He is the Mighty, the Merciful Lord"},{"verseKey":"44:43","text":"The tree of Zaqqum"},{"verseKey":"44:44","text":"will be food for the sinners"},{"verseKey":"44:45","text":"[hot] as molten metal, it boils in their bellies"},{"verseKey":"44:46","text":"like seething water"},{"verseKey":"44:47","text":"‘Take him! Thrust him into the depths of Hell"},{"verseKey":"44:48","text":"Pour scalding water over his head as punishment!’"},{"verseKey":"44:49","text":"‘Taste this, you powerful, respected man"},{"verseKey":"44:50","text":"This is what you doubted.’"},{"verseKey":"44:51","text":"But those mindful of God will be in a safe place"},{"verseKey":"44:52","text":"amid Gardens and springs"},{"verseKey":"44:53","text":"clothed in silk and fine brocade, facing one another"},{"verseKey":"44:54","text":"so it will be. We shall wed them to maidens with large, dark eyes"},{"verseKey":"44:55","text":"Secure and contented, they will call for every kind of fruit"},{"verseKey":"44:56","text":"After the one death they will taste death no more. God will guard them from the torment of Hell"},{"verseKey":"44:57","text":"a bounty from your Lord. That is the supreme triumph"},{"verseKey":"44:58","text":"We have made this Quran easy to understand- in your own language [Prophet]- so that they may take heed"},{"verseKey":"44:59","text":"So wait; the disbelievers too are waiting"}]}