{"verses":[{"verseKey":"53:1","text":"By the star when it sets"},{"verseKey":"53:2","text":"Your companion has not strayed; he is not deluded"},{"verseKey":"53:3","text":"he does not speak from his own desire"},{"verseKey":"53:4","text":"The Quran is nothing less than a revelation that is sent to him"},{"verseKey":"53:5","text":"It was taught to him by [an angel] with mighty powers"},{"verseKey":"53:6","text":"and great strength, who stood"},{"verseKey":"53:7","text":"on the highest horizon"},{"verseKey":"53:8","text":"and then approached––coming down"},{"verseKey":"53:9","text":"until he was two bow-lengths away or even closer––"},{"verseKey":"53:10","text":"and revealed to God’s servant what He revealed"},{"verseKey":"53:11","text":"[The Prophet’s] own heart did not distort what he saw"},{"verseKey":"53:12","text":"Are you going to dispute with him what he saw with his own eyes"},{"verseKey":"53:13","text":"A second time he saw him"},{"verseKey":"53:14","text":"by the lote tree beyond which none may pass"},{"verseKey":"53:15","text":"near the Garden of Restfulness"},{"verseKey":"53:16","text":"when the tree was covered in nameless [splendour]"},{"verseKey":"53:17","text":"His sight never wavered, nor was it too bold"},{"verseKey":"53:18","text":"and he saw some of the greatest signs of his Lord"},{"verseKey":"53:19","text":"[Disbelievers], consider al-Lat and al-Uzza"},{"verseKey":"53:20","text":"and the third one, Manat––"},{"verseKey":"53:21","text":"are you to have the male and He the female"},{"verseKey":"53:22","text":"That would be a most unjust distribution!––"},{"verseKey":"53:23","text":"these are nothing but names you have invented yourselves, you and your forefathers. God has sent no authority for them. These people merely follow guesswork and the whims of their souls, even though guidance has come to them from their Lord"},{"verseKey":"53:24","text":"Is man to have everything he wishes for"},{"verseKey":"53:25","text":"when the present life and the life to come belong only to God"},{"verseKey":"53:26","text":"There are many angels in heaven whose intercession will be of no use until God gives permission to those He will, whose words He will accept"},{"verseKey":"53:27","text":"Those who deny the life to come give the angels female names"},{"verseKey":"53:28","text":"They have no knowledge to base this on: they merely follow guesswork. Guesswork is of no value against the Truth"},{"verseKey":"53:29","text":"So [Prophet] ignore those who turn away from Our revelation, who want only the life of this world"},{"verseKey":"53:30","text":"Their knowledge does not go beyond that. Your Lord knows best who strays from His path and who follows guidance"},{"verseKey":"53:31","text":"Everything in the heavens and earth belongs to God. He will repay those who do evil according to their deeds, and reward, with what is best, those who do good"},{"verseKey":"53:32","text":"As for those who avoid grave sins and foul acts, though they may commit small sins, your Lord is ample in forgiveness. He has been aware of you from the time He produced you from the earth and from your hiding places in your mothers’ wombs, so do not assert your own goodness:He knows best who is mindful of Him"},{"verseKey":"53:33","text":"[Prophet], consider that man who turned away"},{"verseKey":"53:34","text":"he only gave a little and then he stopped"},{"verseKey":"53:35","text":"Does he have knowledge of the Unseen? Can he see [the Hereafter]"},{"verseKey":"53:36","text":"Has he not been told what was written in the Scriptures of Moses"},{"verseKey":"53:37","text":"and of Abraham, who fulfilled his duty"},{"verseKey":"53:38","text":"that no soul shall bear the burden of another"},{"verseKey":"53:39","text":"that man will only have what he has worked towards"},{"verseKey":"53:40","text":"that his labour will be seen"},{"verseKey":"53:41","text":"and that in the end he will be repaid in full for it"},{"verseKey":"53:42","text":"that the final goal is your Lord"},{"verseKey":"53:43","text":"that it is He who makes people laugh and weep"},{"verseKey":"53:44","text":"that it is He who gives death and life"},{"verseKey":"53:45","text":"that He Himself created the two sexes, male and female"},{"verseKey":"53:46","text":"from an ejected drop of sperm"},{"verseKey":"53:47","text":"that He will undertake the second Creation"},{"verseKey":"53:48","text":"that it is He who gives wealth and possessions"},{"verseKey":"53:49","text":"that He is the Lord of Sirius"},{"verseKey":"53:50","text":"that it was He who destroyed, in their entirety, ancient 'Ad"},{"verseKey":"53:51","text":"and Thamud"},{"verseKey":"53:52","text":"and before them the people of Noah who were even more unjust and insolent"},{"verseKey":"53:53","text":"that it was He who brought down the ruined cities"},{"verseKey":"53:54","text":"and enveloped them in the punishment He ordained for them"},{"verseKey":"53:55","text":"Which then of your Lord’s blessings do you deny"},{"verseKey":"53:56","text":"This is a warning just like the warnings sent in former times"},{"verseKey":"53:57","text":"The imminent Hour draws near"},{"verseKey":"53:58","text":"and only God can disclose it"},{"verseKey":"53:59","text":"Do you [people] marvel at this"},{"verseKey":"53:60","text":"Why do you laugh instead of weeping"},{"verseKey":"53:61","text":"Why do you pay no heed"},{"verseKey":"53:62","text":"Bow down before God and worship"}]}