{"verses":[{"verseKey":"71:1","text":"We sent Noah to his people: ‘Warn your people, before a painful punishment comes to them.’"},{"verseKey":"71:2","text":"And so he said, ‘My people, I am here to warn you plainly"},{"verseKey":"71:3","text":"Serve God, be mindful of Him and obey me"},{"verseKey":"71:4","text":"He will forgive you your sins and spare you until your appointed time––when God’s appointed time arrives it cannot be postponed. If only you understood!’"},{"verseKey":"71:5","text":"He said, ‘My Lord, I have called my people night and day"},{"verseKey":"71:6","text":"but the more I call them, the further they run away"},{"verseKey":"71:7","text":"every time I call them, so that You may forgive them, they thrust their fingers into their ears, cover their heads with their garments, persist in their rejection, and grow more insolent and arrogant"},{"verseKey":"71:8","text":"I have tried calling them openly"},{"verseKey":"71:9","text":"I have tried preaching to them in public and speaking to them in private"},{"verseKey":"71:10","text":"I said, “Ask forgiveness of your Lord: He is ever forgiving"},{"verseKey":"71:11","text":"He will send down abundant rain from the sky for you"},{"verseKey":"71:12","text":"He will give you wealth and sons; He will provide you with gardens and rivers"},{"verseKey":"71:13","text":"What is the matter with you? Why will you not fear God’s majesty"},{"verseKey":"71:14","text":"when He has created you stage by stage"},{"verseKey":"71:15","text":"Have you ever wondered how God created seven heavens, one above the other"},{"verseKey":"71:16","text":"placed the moon as a light in them and the sun as a lamp"},{"verseKey":"71:17","text":"how God made you spring forth from the earth like a plant"},{"verseKey":"71:18","text":"how He will return you into it and then bring you out again"},{"verseKey":"71:19","text":"and how He has spread the Earth out for you"},{"verseKey":"71:20","text":"to walk along its spacious paths?” ’"},{"verseKey":"71:21","text":"Noah said, ‘My Lord, they have disobeyed me and followed those whose riches and children only increase their ruin"},{"verseKey":"71:22","text":"who have made a grand plan"},{"verseKey":"71:23","text":"saying, “Do not renounce your gods"},{"verseKey":"71:24","text":"Do not renounce Wadd, Suwa, Yaghuth, Yauq, or Nasr!” They have led many astray. Lord, bring nothing but destruction down on the evildoers!’"},{"verseKey":"71:25","text":"They were drowned and sent to Hell for their evildoings: they found no one to help them against God"},{"verseKey":"71:26","text":"And Noah said, ‘Lord, do not leave any of the disbelievers on the earth"},{"verseKey":"71:27","text":"if you leave them they will lead Your servants astray and beget only sinners and disbelievers"},{"verseKey":"71:28","text":"Lord, forgive me, my parents, and whoever enters my house as a believer. Forgive believing men and women but bring nothing but ruin down on the evildoers!’"}]}