{"verses":[{"verseKey":"68:1","text":"Nūn one of the letters of the alphabet God knows best what He means by it. By the Pen with which He has inscribed the records of all creatures in the Preserved Tablet and what they inscribe that is the angels of good and righteousness."},{"verseKey":"68:10","text":"And do not obey any mean despicable oath-monger given to frequent swearing by falsehood"},{"verseKey":"68:11","text":"backbiting faultfinder that is to say calumniator scandal-monger spreading evil talk among people in order to sow dissension between them"},{"verseKey":"68:12","text":"hinderer of good niggardly with his wealth against deserving causes sinful transgressor wrongdoer"},{"verseKey":"68:13","text":"coarse-grained crude moreover ignoble an adopted son of Quraysh — namely al-Walīd b. al-Mughīra whose father claimed him after eighteen years; Ibn ‘Abbās said ‘We know of no one whom God has described in the derogatory way in which He describes him blighting him with ignominy that will never leave him the adverbial qualifier ba‘da dhālika ‘moreover’ is semantically connected to zanīm ‘ignoble’ —"},{"verseKey":"68:14","text":"only because an should be understood as li-an ‘because’ and it is semantically connected to that meaning which it is indicating he has wealth and sons."},{"verseKey":"68:15","text":"When Our signs — the Qur’ān — are recited to him he says that they are merely ‘Fables of the ancients!’ in other words he denies them in arrogance on account of the mentioned things which We have bestowed on him out of Our grace a variant reading for an of the previous verse has the interrogative a-an."},{"verseKey":"68:16","text":"We shall brand him on the snout We shall leave a distinguishing mark upon his nose one by which he will be reviled for as long as he lives; and so his nose was chopped off by a sword at Badr."},{"verseKey":"68:17","text":"Indeed We have tried them We have tested the people of Mecca with drought and famine just as We tried the owners of the garden the orchard when they vowed that they would pluck that they would pick its fruits in the morning so that the poor folk would not notice them and so that they would not then have to give them of it that portion which their father used to give them of it by way of charity."},{"verseKey":"68:18","text":"And they did not make any exception to their vow for God’s will the sentence is a new syntactically independent one in other words and that was their condition."},{"verseKey":"68:19","text":"Then a visitation from your Lord visited it that is a fire consumed it during the night while they slept."},{"verseKey":"68:2","text":"You are not O Muhammad (s) by the grace of your Lord a madman that is to say madness is precluded in your case on account of your Lord’s grace to you by way of His assigning to you prophethood and in other ways — this was a refutation of their saying that he was a madman."},{"verseKey":"68:20","text":"So by the morning it was like the darkness of night in other words black."},{"verseKey":"68:21","text":"They then called out to one another in the morning"},{"verseKey":"68:22","text":"saying ‘Go forth early to your tillage your produce ani’ghdū ‘alā harthikum constitutes an explication of the import of tanādaw ‘they called out to one another’; otherwise an relates to the verbal action to be understood as being bi-an if you are going to pluck’ if your intention is to pick the fruits the response to the conditional is indicated by what preceded it."},{"verseKey":"68:23","text":"So off they went whispering to one another talking secretly"},{"verseKey":"68:24","text":"‘No needy person shall today come to you in it’ this constitutes the explication of the preceding verse; or else an relates to the verbal action to be understood to mean bi-an."},{"verseKey":"68:25","text":"And they went forth early supposing themselves able to prohibit to prevent the poor folk from enjoying the fruit."},{"verseKey":"68:26","text":"But when they saw it blackened and charred they said ‘Assuredly we have strayed!’ from it that is to say this is not the one. Then when they recognised it they said"},{"verseKey":"68:27","text":"‘Nay but we have been deprived!’ of its fruits by our denying it to the poor folk."},{"verseKey":"68:28","text":"The most moderate the best one among them said ‘Did I not say to you “Why do you not glorify?” ’ God repenting to Him."},{"verseKey":"68:29","text":"They said ‘Glory be to God our Lord. Verily we have been wrongdoers’ by denying the poor folk what is their due."},{"verseKey":"68:3","text":"And assuredly you will have an unfailing reward."},{"verseKey":"68:30","text":"They then turned to one another blaming each other."},{"verseKey":"68:31","text":"They said ‘O yā is for calling attention to something woe to us! O destruction of ours. We have indeed been unjust."},{"verseKey":"68:32","text":"It may be that our Lord will give us in its place read yubaddilanā or yubdilanā one that is better than it. Truly we turn humbly to our Lord’ that He might accept our repentance and give us back a garden that is better than our garden — it is reported that they were indeed given a better one in its place."},{"verseKey":"68:33","text":"Such that is to say like the chastisement for these people will be the chastisement for those disbelievers of Mecca and others who contravene Our command; and the chastisement of the Hereafter is assuredly greater did they but know its chastisement they would not have contavened Our command. When they said ‘If we are resurrected we shall be given better than what you have been given the following was revealed"},{"verseKey":"68:34","text":"Verily for the God-fearing there will be the Gardens of Bliss near their Lord."},{"verseKey":"68:35","text":"Are We then to treat those who submit to Us as We treat the sinners? that is to say as belonging with them in terms of reward?"},{"verseKey":"68:36","text":"What is wrong with you? How do you judge? with such corrupt judgement?"},{"verseKey":"68:37","text":"Or am lakum means a-lakum do you have a Scripture revealed wherein you learn wherein you read"},{"verseKey":"68:38","text":"that you will indeed have in it whatever you choose?"},{"verseKey":"68:39","text":"Or do you have oaths pledges binding secured on Us until the Day of Resurrection ilā yawmi’l-qiyāmati is semantically connected to ‘alaynā ‘on Us’; these words ‘alaynā bālighatun ‘binding on Us’ contain the sense of an oath given in other words ‘Did We swear to you?’ the response to which is what follows that you will indeed have whatever you decide? to have for yourselves."},{"verseKey":"68:4","text":"And assuredly you possess a magnificent nature a magnificent religion."},{"verseKey":"68:40","text":"Ask them which of them will aver will guarantee for them that? that decision which they have made for themselves namely that they will be given better reward than the believers in the Hereafter?"},{"verseKey":"68:41","text":"Or do they have partners? who agree with them in this claim of theirs and able to guarantee it for them; if that is the case Then let them produce their partners those who will guarantee this for them if they are truthful."},{"verseKey":"68:42","text":"Mention the day when the shank is bared an expression denoting the severity of the predicament during the reckoning and the requital on the Day of Resurrection one says kashafati’l-harbu ‘an sāqin ‘the war has bared its shank’ to mean that it has intensified and they are summoned to prostrate themselves as a test of their faith but they will not be able to do so — their backs will become as stiff as a brick wall."},{"verseKey":"68:43","text":"With humbled khāshi‘atan is a circumstantial qualifier referring to the person of the verb yud‘awna ‘they are summoned’ that is to say with abject gazes which they do not raise they will be overcast enveloped by abasement; for they had indeed been summoned in this world to prostrate themselves while they were yet sound but they never used to do it by the fact that they never performed prayer."},{"verseKey":"68:44","text":"So leave Me to deal with those who deny this discourse — the Qur’ān. We will draw them on by degrees We will seize them little by little whence they do not know."},{"verseKey":"68:45","text":"And I will grant them respite; for assuredly My devising is firm My devising is severe and cannot be withstood."},{"verseKey":"68:46","text":"Or are you asking them a fee in return for delivering the Message so that they are weighed down with debt? so that they are weighed down with what they will have to give you and that is why they do not believe."},{"verseKey":"68:47","text":"Or do they possess access to the Unseen that is access to the Preserved Tablet which contains knowledge of the Unseen so that they are writing down? from it what they say."},{"verseKey":"68:48","text":"So await patiently the judgement of your Lord regarding them in the way that He wills and do not be like the one of the whale in terms of impatience and haste — this is Jonah peace be upon him — who called out who supplicated his Lord choking with grief filled with anguish inside the belly of the whale."},{"verseKey":"68:49","text":"Had it not been for a grace a mercy from his Lord that reached him he would have surely been cast out of the belly of the whale onto a wilderness a desolate land while he was blameworthy — but he was shown mercy and was therefore cast out blameless."},{"verseKey":"68:5","text":"Then you will see and they will see"},{"verseKey":"68:50","text":"But his Lord chose him for prophethood and made him one of the righteous the prophets."},{"verseKey":"68:51","text":"Indeed those who disbelieve would almost throw you down to the ground read la-yuzliqūnaka or la-yazliqūnaka with their looks looking at you in a severe way almost hurling you to the ground or making you fall from your place when they hear the Reminder the Qur’ān and they say out of envy ‘He is truly a madman!’ on account of the Qur’ān that he has brought."},{"verseKey":"68:52","text":"Yet it namely the Qur’ān is just a Reminder an admonition for all the worlds of both humans and jinn and cannot be the cause of any dementia."},{"verseKey":"68:6","text":"which of you is demented al-maftūn is a verbal noun similar in expressional form to al-ma‘qūl ‘intelligible’; al-futūn meaning al-junūn ‘insanity’ in other words is it this insanity in you or in them?"},{"verseKey":"68:7","text":"Assuredly your Lord knows best those who stray from His way and He knows best those who are guided to Him."},{"verseKey":"68:8","text":"So do not obey the deniers."},{"verseKey":"68:9","text":"They desire they yearn that law relates to the verbal action you should be pliable that you should yield to them so that they may be pliable towards you so that they may yield to you fa-yudhinūna is a supplement to tudhinu ‘you should be pliable’ but if it is understood to be the response to the optative clause of waddū ‘they yearn’ then a free standing pronoun hum should be read as implied before it after the fā’ sc. fa-hum yudhinūna."}]}