{"verses":[{"verseKey":"89:1","text":"By the dawn that is to say by the dawn of each day"},{"verseKey":"89:10","text":"and Pharaoh the one of the tent-pegs he used to fasten four pegs and tie to these the hands and feet of those whom he tortured —"},{"verseKey":"89:11","text":"those who were rebellious became tyrannical in the land"},{"verseKey":"89:12","text":"and caused much corruption therein? by way of slaying and otherwise."},{"verseKey":"89:13","text":"So your Lord poured on them a scourge of chastisement."},{"verseKey":"89:14","text":"Assuredly your Lord is ever on the watch watching over the deeds of servants nothing of which escapes Him that He may then requite them for these deeds."},{"verseKey":"89:15","text":"And as for man the disbeliever whenever his Lord tests him and honours him with wealth and other things and is gracious to him he says ‘My Lord has honoured me’."},{"verseKey":"89:16","text":"But when he tests him and restricts his provision for him he says ‘My Lord has humiliated me’."},{"verseKey":"89:17","text":"No indeed! — a disavowal of this notion in other words honour is not about wealth nor is there any humiliation in poverty rather it has to do with obedience and disobedience respectively; but the disbelievers of Mecca unmindful of this. Rather they do not honour the orphan they do not treat him with kindness despite their wealth or it means that they do not give him what is his due from an inheritance"},{"verseKey":"89:18","text":"and they do not urge neither themselves nor others the feeding of the needy;"},{"verseKey":"89:19","text":"and they devour inheritance turāth means mīrāth greedily lamman that is to say voraciously when they appropriate lammuhum the women’s and the young ones’ share of the inheritance together with their own share of it or to their own wealth;"},{"verseKey":"89:2","text":"and by the ten nights the first ten nights of Dhū’l-Hijja"},{"verseKey":"89:20","text":"and they love wealth with abounding love that is to say greatly and so they do not expend any of it a variant reading in the case of all four verbs has the second person plural."},{"verseKey":"89:21","text":"No indeed! — a deterrent for them from such conduct. When the earth is pulverised repeatedly when it is shaken until every edifice has collapsed and is destroyed"},{"verseKey":"89:22","text":"and your Lord that is to say His command and the angels arrive rank on rank saffan saffan is a circumstantial qualifier meaning ‘standing in rows’ or ‘made up of many ranks’"},{"verseKey":"89:23","text":"and Hell on that day is brought near pulled by seventy thousand sets of reins each set of reins pulled by the hands of seventy thousand angels as it groans and seethes in fury; on that day yawma’idhin is a substitution for idhā ‘when’ the response to which is the following man that is to say the disbeliever will remember his prodigal conduct in it but how will remembering avail him now? the interrogative is meant as a denial in other words his remembering that will not be of any use to him."},{"verseKey":"89:24","text":"He will say as he remembers ‘O yā is for calling attention to something would that I had sent ahead good deeds and faith for my life!’ for a good life in the Hereafter or it means ‘during my life’ in the world."},{"verseKey":"89:25","text":"Then on that day none shall mete out read yu‘adhdhibu His God’s chastisement that is to say He shall not delegate it to any other;"},{"verseKey":"89:26","text":"and likewise none shall bind read yūthiqu His bind a variant reading has yu‘adhdhabu ‘none shall be chastised’ and yūthaqu ‘none shall be bound’ so that the suffixed pronoun of ‘adhābahu and wathāqahu refers to the chastisement and the binds of the disbeliever the meaning then being ‘none shall be chastised as he shall and none shall be bound as he shall be bound’."},{"verseKey":"89:27","text":"‘O soul at peace! the one secure namely the believing one."},{"verseKey":"89:28","text":"Return — this is said to it upon death — to your Lord that is to say return to His command and to His will pleased with the reward pleasing in God’s sight with your deeds; in other words return O soul combining both descriptions both of which are circumstantial qualifiers. And it will be said to it at the Resurrection"},{"verseKey":"89:29","text":"Then enter among My righteous servants!"},{"verseKey":"89:3","text":"and by the even the pair and the odd read watr or witr two alternative forms the single"},{"verseKey":"89:30","text":"And enter My Paradise!’ with them."},{"verseKey":"89:4","text":"and by the night in motion falling or receding"},{"verseKey":"89:5","text":"Is there in that oath an oath for one of sense? one of intellect the response to the oath has been omitted that is to say it is to be understood as something like la-tu‘adhdhabunna yā kuffāra Makka ‘you will assuredly be chastised O disbelievers of Mecca!’."},{"verseKey":"89:6","text":"Have you not seen do you not know O Muhammad (s) how your Lord dealt with ‘Ād"},{"verseKey":"89:7","text":"Iram — these were the former people of ‘Ād Irama is an explicative supplement or a substitution and it is treated as a diptote because it is a proper noun and feminine — of the towering ones that is to say the tall ones — the tallest one among them would reach four hundred cubits —"},{"verseKey":"89:8","text":"the like of which was not created in the land in terms of their power of assault and strength"},{"verseKey":"89:9","text":"and Thamūd who hollowed hewed the rocks sakhr is the plural of sakhra in the valley the Wādī al-Qurā rocks which they used as dwellings"}]}