{"verses":[{"verseKey":"17:1","text":"Glory be to the One Who took His servant ˹Muḥammad˺ by night from the Sacred Mosque to the Farthest Mosque whose surroundings We have blessed, so that We may show him some of Our signs. Indeed, He alone is the All-Hearing, All-Seeing"},{"verseKey":"17:2","text":"And We gave Moses the Scripture and made it a guide for the Children of Israel, ˹stating:˺ “Do not take besides Me any other Trustee of Affairs"},{"verseKey":"17:3","text":"˹O˺ descendants of those We carried with Noah ˹in the Ark˺! He was indeed a grateful servant.”"},{"verseKey":"17:4","text":"And We warned the Children of Israel in the Scripture, “You will certainly cause corruption in the land twice, and you will become extremely arrogant"},{"verseKey":"17:5","text":"When the first of the two warnings would come to pass, We would send against you some of Our servants of great might, who would ravage your homes. This would be a warning fulfilled"},{"verseKey":"17:6","text":"Then ˹after your repentance˺ We would give you the upper hand over them and aid you with wealth and offspring, causing you to outnumber them"},{"verseKey":"17:7","text":"If you act rightly, it is for your own good, but if you do wrong, it is to your own loss. “And when the second warning would come to pass, your enemies would ˹be left to˺ totally disgrace you and enter the Temple ˹of Jerusalem˺ as they entered it the first time, and utterly destroy whatever would fall into their hands"},{"verseKey":"17:8","text":"Perhaps your Lord will have mercy on you ˹if you repent˺, but if you return ˹to sin˺, We will return ˹to punishment˺. And We have made Hell a ˹permanent˺ confinement for the disbelievers.”"},{"verseKey":"17:9","text":"Surely this Quran guides to what is most upright, and gives good news to the believers—who do good—that they will have a mighty reward"},{"verseKey":"17:10","text":"And ˹it warns˺ those who do not believe in the Hereafter ˹that˺ We have prepared for them a painful punishment"},{"verseKey":"17:11","text":"And humans ˹swiftly˺ pray for evil as they pray for good. For humankind is ever hasty"},{"verseKey":"17:12","text":"We made the day and night as two signs. So We made the sign of the night devoid of light, and We made the sign of the day ˹perfectly˺ bright, so that you may seek the bounty of your Lord and know the number of years and calculation ˹of time˺. And We have explained everything in detail"},{"verseKey":"17:13","text":"We have bound every human’s destiny to their neck. And on the Day of Judgment We will bring forth to each ˹person˺ a record which they will find laid open"},{"verseKey":"17:14","text":"˹And it will be said,˺ “Read your record. You ˹alone˺ are sufficient this Day to take account of yourself.”"},{"verseKey":"17:15","text":"Whoever chooses to be guided, it is only for their own good. And whoever chooses to stray, it is only to their own loss. No soul burdened with sin will bear the burden of another. And We would never punish ˹a people˺ until We have sent a messenger ˹to warn them˺"},{"verseKey":"17:16","text":"Whenever We intend to destroy a society, We command its elite ˹to obey Allah˺ but they act rebelliously in it. So the decree ˹of punishment˺ is justified, and We destroy it utterly"},{"verseKey":"17:17","text":"˹Imagine˺ how many peoples We have destroyed after Noah! And sufficient is your Lord as All-Aware and All-Seeing of the sins of His servants"},{"verseKey":"17:18","text":"Whoever desires this fleeting world ˹alone˺, We hasten in it whatever We please to whoever We will; then We destine them for Hell, where they will burn, condemned and rejected"},{"verseKey":"17:19","text":"But whoever desires the Hereafter and strives for it accordingly, and is a ˹true˺ believer, it is they whose striving will be appreciated"},{"verseKey":"17:20","text":"We provide both the former and the latter from the bounty of your Lord. And the bounty of your Lord can never be withheld"},{"verseKey":"17:21","text":"See how We have favoured some over others ˹in this life˺, but the Hereafter is certainly far greater in rank and in favour"},{"verseKey":"17:22","text":"Do not set up any other god with Allah, or you will end up condemned, abandoned"},{"verseKey":"17:23","text":"For your Lord has decreed that you worship none but Him. And honour your parents. If one or both of them reach old age in your care, never say to them ˹even˺ ‘ugh,’ nor yell at them. Rather, address them respectfully"},{"verseKey":"17:24","text":"And be humble with them out of mercy, and pray, “My Lord! Be merciful to them as they raised me when I was young.”"},{"verseKey":"17:25","text":"Your Lord knows best what is within yourselves. If you are righteous, He is certainly All-Forgiving to those who ˹constantly˺ turn to Him"},{"verseKey":"17:26","text":"Give to close relatives their due, as well as the poor and ˹needy˺ travellers. And do not spend wastefully"},{"verseKey":"17:27","text":"Surely the wasteful are ˹like˺ brothers to the devils. And the Devil is ever ungrateful to his Lord"},{"verseKey":"17:28","text":"But if you must turn them down ˹because you lack the means to give˺—while hoping to receive your Lord’s bounty—then ˹at least˺ give them a kind word"},{"verseKey":"17:29","text":"Do not be so tight-fisted, for you will be blameworthy; nor so open-handed, for you will end up in poverty"},{"verseKey":"17:30","text":"Surely your Lord gives abundant or limited provisions to whoever He wills. He is certainly All-Aware, All-Seeing of His servants"},{"verseKey":"17:31","text":"Do not kill your children for fear of poverty. We provide for them and for you. Surely killing them is a heinous sin"},{"verseKey":"17:32","text":"Do not go near adultery. It is truly a shameful deed and an evil way"},{"verseKey":"17:33","text":"Do not take a ˹human˺ life—made sacred by Allah—except with ˹legal˺ right. If anyone is killed unjustly, We have given their heirs the authority, but do not let them exceed limits in retaliation, for they are already supported ˹by law˺"},{"verseKey":"17:34","text":"Do not come near the wealth of the orphan—unless intending to enhance it—until they attain maturity. Honour ˹your˺ pledges, for you will surely be accountable for them"},{"verseKey":"17:35","text":"Give in full when you measure, and weigh with an even balance. That is fairest and best in the end"},{"verseKey":"17:36","text":"Do not follow what you have no ˹sure˺ knowledge of. Indeed, all will be called to account for ˹their˺ hearing, sight, and intellect"},{"verseKey":"17:37","text":"And do not walk on the earth arrogantly. Surely you can neither crack the earth nor stretch to the height of the mountains"},{"verseKey":"17:38","text":"The violation of any of these ˹commandments˺ is detestable to your Lord"},{"verseKey":"17:39","text":"This is part of the wisdom which your Lord has revealed to you ˹O Prophet˺. And do not set up any other god with Allah ˹O humanity˺, or you will be cast into Hell, blameworthy, rejected"},{"verseKey":"17:40","text":"Has your Lord favoured you ˹pagans˺ with sons and taken angels as ˹His˺ daughters? You are truly making an outrageous claim"},{"verseKey":"17:41","text":"We have surely varied ˹the signs˺ in this Quran so perhaps they may be mindful, but it only drives them farther away"},{"verseKey":"17:42","text":"Say, ˹O Prophet,˺ “Had there been other gods besides Him—as they claim—then they would have certainly sought a way to ˹challenge˺ the Lord of the Throne.”"},{"verseKey":"17:43","text":"Glorified and Highly Exalted is He above what they claim"},{"verseKey":"17:44","text":"The seven heavens, the earth, and all those in them glorify Him. There is not a single thing that does not glorify His praises—but you ˹simply˺ cannot comprehend their glorification. He is indeed Most Forbearing, All-Forgiving"},{"verseKey":"17:45","text":"When you ˹O Prophet˺ recite the Quran, We put a hidden barrier between you and those who do not believe in the Hereafter"},{"verseKey":"17:46","text":"We have cast veils over their hearts—leaving them unable to comprehend it—and deafness in their ears. And when you mention your Lord alone in the Quran, they turn their backs in aversion"},{"verseKey":"17:47","text":"We know best how they listen to your recitation and what they say privately—when the wrongdoers say, “You would only be following a bewitched man.”"},{"verseKey":"17:48","text":"See how they call you names ˹O Prophet˺! So they have gone so ˹far˺ astray that they cannot find the ˹Right˺ Way"},{"verseKey":"17:49","text":"And they say ˹mockingly˺, “When we are reduced to bones and ashes, will we really be raised as a new creation?”"},{"verseKey":"17:50","text":"Say, ˹O Prophet,˺ “˹Yes, even if˺ you become stones, or iron"},{"verseKey":"17:51","text":"or whatever you think is harder to bring to life!” Then they will ask ˹you˺, “Who will bring us back ˹to life˺?” Say, “The One Who created you the first time.” They will then shake their heads at you and ask, “When will that be?” Say, “Perhaps it is soon!”"},{"verseKey":"17:52","text":"On the Day He will call you, you will ˹instantly˺ respond by praising Him, thinking you had remained ˹in the world˺ only for a little while"},{"verseKey":"17:53","text":"Tell My ˹believing˺ servants to say only what is best. Satan certainly seeks to sow discord among them. Satan is indeed a sworn enemy to humankind"},{"verseKey":"17:54","text":"Your Lord knows you best. He may have mercy on you if He wills, or punish you if He wills. We have not sent you ˹O Prophet˺ as a keeper over them"},{"verseKey":"17:55","text":"Your Lord knows best all those in the heavens and the earth. And We have surely favoured some prophets above others, and to David We gave the Psalms"},{"verseKey":"17:56","text":"Say, ˹O Prophet,˺ “Invoke those you claim ˹to be divine˺ besides Him—they do not have the power to undo harm from you or transfer it ˹to someone else˺.”"},{"verseKey":"17:57","text":"˹Even˺ the closest ˹to Allah˺ of those invoked would be seeking a way to their Lord, hoping for His mercy, and fearing His punishment. Indeed, your Lord’s torment is fearsome"},{"verseKey":"17:58","text":"There is not a ˹wicked˺ society that We will not destroy or punish with a severe torment before the Day of Judgment. That is written in the Record"},{"verseKey":"17:59","text":"Nothing keeps Us from sending the ˹demanded˺ signs except that they had ˹already˺ been denied by earlier peoples. And We gave Thamûd the she-camel as a clear sign, but they wrongfully rejected it. We only send the signs as a warning"},{"verseKey":"17:60","text":"And ˹remember, O Prophet˺ when We told you, “Certainly your Lord encompasses the people.” And We have made what We brought you to see as well as the cursed tree ˹mentioned˺ in the Quran only as a test for the people. We keep warning them, but it only increases them greatly in defiance"},{"verseKey":"17:61","text":"And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who protested, “Should I prostrate to the one You have created from mud?”"},{"verseKey":"17:62","text":"Adding, “Do you see this one you honoured above me? If you delay my end until the Day of Judgment, I will certainly take hold of his descendants, except for a few.”"},{"verseKey":"17:63","text":"Allah responded, “Be gone! Whoever of them follows you, Hell will surely be the reward for all of you—an ample reward"},{"verseKey":"17:64","text":"And incite whoever you can of them with your voice, mobilize against them all your cavalry and infantry, manipulate them in their wealth and children, and make them promises.” But Satan promises them nothing but delusion"},{"verseKey":"17:65","text":"˹Allah added,˺ “You will truly have no authority over My ˹faithful˺ servants.” And sufficient is your Lord as a Guardian"},{"verseKey":"17:66","text":"It is your Lord Who steers the ships for you through the sea, so that you may seek His bounty. Surely He is ever Merciful to you"},{"verseKey":"17:67","text":"When you are touched with hardship at sea, you ˹totally˺ forget all ˹the gods˺ you ˹normally˺ invoke, except Him. But when He delivers you ˹safely˺ to shore, you turn away. Humankind is ever ungrateful"},{"verseKey":"17:68","text":"Do you feel secure that He will not cause the land to swallow you up, or unleash upon you a storm of stones? Then you will find none to protect you"},{"verseKey":"17:69","text":"Or do you feel secure that He will not send you back to sea once again, and send upon you a violent storm, drowning you for your denial? Then you will find none to avenge you against Us"},{"verseKey":"17:70","text":"Indeed, We have dignified the children of Adam, carried them on land and sea, granted them good and lawful provisions, and privileged them far above many of Our creatures"},{"verseKey":"17:71","text":"˹Beware of˺ the Day We will summon every people with their leader. So whoever will be given their record in their right hand will read it ˹happily˺ and will not be wronged ˹even by the width of˺ the thread of a date stone"},{"verseKey":"17:72","text":"But whoever is blind ˹to the truth˺ in this ˹world˺ will be blind in the Hereafter, and ˹even˺ far more astray from the ˹Right˺ Way"},{"verseKey":"17:73","text":"They definitely ˹thought they˺ were about to lure you away from what We have revealed to you ˹O Prophet˺, hoping that you would attribute something else to Us falsely—and then they would have certainly taken you as a close friend"},{"verseKey":"17:74","text":"Had We not made you steadfast, you probably would have inclined to them a little"},{"verseKey":"17:75","text":"and then We truly would have made you taste double ˹punishment˺ both in this life and after death, and you would have found no helper against Us"},{"verseKey":"17:76","text":"They were about to intimidate you to drive you out of the land ˹of Mecca˺, but then they would not have survived after you ˹had left˺ except for a little while"},{"verseKey":"17:77","text":"˹This has been˺ Our way with the messengers We sent before you. And you will never find any change in Our way"},{"verseKey":"17:78","text":"Observe the prayer from the decline of the sun until the darkness of the night and the dawn prayer, for certainly the dawn prayer is witnessed ˹by angels˺"},{"verseKey":"17:79","text":"And rise at ˹the last˺ part of the night, offering additional prayers, so your Lord may raise you to a station of praise"},{"verseKey":"17:80","text":"And say, “My Lord! Grant me an honourable entrance and an honourable exit and give me a supporting authority from Yourself.”"},{"verseKey":"17:81","text":"And declare, “The truth has come and falsehood has vanished. Indeed, falsehood is bound to vanish.”"},{"verseKey":"17:82","text":"We send down the Quran as a healing and mercy for the believers, but it only increases the wrongdoers in loss"},{"verseKey":"17:83","text":"When We grant people Our favours, they turn away, acting arrogantly. But when touched with evil, they lose all hope"},{"verseKey":"17:84","text":"Say, ˹O Prophet,˺ “Everyone acts in their own way. But your Lord knows best whose way is rightly guided.”"},{"verseKey":"17:85","text":"They ask you ˹O Prophet˺ about the spirit. Say, “Its nature is known only to my Lord, and you ˹O humanity˺ have been given but little knowledge.”"},{"verseKey":"17:86","text":"If We willed, We could have certainly taken away what We have revealed to you ˹O Prophet˺—then you would find none to guarantee its return from Us—"},{"verseKey":"17:87","text":"had it not been for the mercy of your Lord. Indeed, His favour upon you is immense"},{"verseKey":"17:88","text":"Say, ˹O Prophet,˺ “If ˹all˺ humans and jinn were to come together to produce the equivalent of this Quran, they could not produce its equal, no matter how they supported each other.”"},{"verseKey":"17:89","text":"And We have truly set forth every ˹kind of˺ lesson for humanity in this Quran, yet most people persist in disbelief"},{"verseKey":"17:90","text":"They challenge ˹the Prophet˺, “We will never believe in you until you cause a spring to gush forth from the earth for us"},{"verseKey":"17:91","text":"or until you have a garden of palm trees and vineyards, and cause rivers to flow abundantly in it"},{"verseKey":"17:92","text":"or cause the sky to fall upon us in pieces, as you have claimed, or bring Allah and the angels before us, face to face"},{"verseKey":"17:93","text":"or until you have a house of gold, or you ascend into heaven—and even then we will not believe in your ascension until you bring down to us a book that we can read.” Say, “Glory be to my Lord! Am I not only a human messenger?”"},{"verseKey":"17:94","text":"And nothing has prevented people from believing when guidance comes to them except their protest: “Has Allah sent a human as a messenger?”"},{"verseKey":"17:95","text":"Say, ˹O Prophet,˺ “Had there been angels walking the earth, well settled, We would have surely sent down for them an angel from heaven as a messenger.”"},{"verseKey":"17:96","text":"Say, “Sufficient is Allah as a Witness between me and you. He is certainly All-Knowing, All-Seeing of His servants.”"},{"verseKey":"17:97","text":"Whoever Allah guides is truly guided. And whoever He leaves to stray, you will find no guardians for them besides Him. And We will drag them on their faces on the Day of Judgment—deaf, dumb, and blind. Hell will be their home. Whenever it dies down, We will flare it up for them"},{"verseKey":"17:98","text":"That is their reward for rejecting Our signs and asking ˹mockingly˺, “When we are reduced to bones and ashes, will we really be raised as a new creation?”"},{"verseKey":"17:99","text":"Have they not realized that Allah, Who created the heavens and the earth, can ˹easily˺ re-create them? He has ˹already˺ set for them a time, about which there is no doubt. But the wrongdoers persist in denial"},{"verseKey":"17:100","text":"Say ˹to them, O Prophet˺, “Even if you were to possess the ˹infinite˺ treasuries of my Lord’s mercy, then you would certainly withhold ˹them˺, fearing they would run out—for humankind is ever stingy!”"},{"verseKey":"17:101","text":"We surely gave Moses nine clear signs. ˹You, O Prophet, can˺ ask the Children of Israel. When Moses came to them, Pharaoh said to him, “I really think that you, O Moses, are bewitched.”"},{"verseKey":"17:102","text":"Moses replied, “You know well that none has sent these ˹signs˺ down except the Lord of the heavens and the earth as insights. And I really think that you, O Pharaoh, are doomed.”"},{"verseKey":"17:103","text":"So Pharaoh wanted to scare the Israelites out of the land ˹of Egypt˺, but We drowned him and all of those with him"},{"verseKey":"17:104","text":"And We said to the Children of Israel after Pharaoh, “Reside in the land, but when the promise of the Hereafter comes to pass, We will bring you all together.”"},{"verseKey":"17:105","text":"We have sent down the Quran in truth, and with the truth it has come down. We have sent you ˹O Prophet˺ only as a deliverer of good news and a warner"},{"verseKey":"17:106","text":"˹It is˺ a Quran We have revealed in stages so that you may recite it to people at a deliberate pace. And We have sent it down in successive revelations"},{"verseKey":"17:107","text":"Say, ˹O Prophet,˺ “Believe in this ˹Quran˺, or do not. Indeed, when it is recited to those who were gifted with knowledge before it ˹was revealed˺, they fall upon their faces in prostration"},{"verseKey":"17:108","text":"and say, ‘Glory be to our Lord! Surely the promise of our Lord has been fulfilled.’"},{"verseKey":"17:109","text":"And they fall down upon their faces weeping, and it increases them in humility.”"},{"verseKey":"17:110","text":"Say, ˹O Prophet,˺ “Call upon Allah or call upon the Most Compassionate—whichever you call, He has the Most Beautiful Names.” Do not recite your prayers too loudly or silently, but seek a way between"},{"verseKey":"17:111","text":"And say, “All praise is for Allah, Who has never had ˹any˺ offspring; nor does He have a partner in ˹governing˺ the kingdom; nor is He pathetic, needing a protector. And revere Him immensely.”"}]}