{"verses":[{"verseKey":"38:1","text":"Ṣãd. By the Quran, full of reminders"},{"verseKey":"38:2","text":"˹This is the truth,˺ yet the disbelievers are ˹entrenched˺ in arrogance and opposition"},{"verseKey":"38:3","text":"˹Imagine˺ how many peoples We destroyed before them, and they cried out when it was too late to escape"},{"verseKey":"38:4","text":"Now, the pagans are astonished that a warner has come to them from among themselves. And the disbelievers say, “This is a magician, a total liar"},{"verseKey":"38:5","text":"Has he reduced ˹all˺ the gods to One God? Indeed, this is something totally astonishing.”"},{"verseKey":"38:6","text":"The chiefs among them went forth saying, “Carry on, and stand firm in devotion to your gods. Certainly this is just a scheme ˹for power˺"},{"verseKey":"38:7","text":"We have never heard of this in the previous faith. This is nothing but a fabrication"},{"verseKey":"38:8","text":"Has the Reminder been revealed ˹only˺ to him out of ˹all of˺ us?” In fact, they are ˹only˺ in doubt of My ˹revealed˺ Reminder. In fact, ˹they do so because˺ they have not yet tasted My punishment"},{"verseKey":"38:9","text":"Or ˹is it because˺ they possess the treasuries of the mercy of your Lord—the Almighty, the Giver ˹of all bounties˺"},{"verseKey":"38:10","text":"Or ˹is it because˺ the kingdom of the heavens and the earth and everything in between belongs to them? Let them then climb their way ˹to heaven, if their claim is true˺"},{"verseKey":"38:11","text":"This is just another ˹enemy˺ force bound for defeat out there"},{"verseKey":"38:12","text":"Before them, the people of Noah denied ˹the truth˺, as did ’Âd, Pharaoh of the mighty structures"},{"verseKey":"38:13","text":"Thamûd, the people of Lot, and the residents of the Forest. These were ˹all˺ enemy forces"},{"verseKey":"38:14","text":"Each rejected their messenger, so My punishment was justified"},{"verseKey":"38:15","text":"These ˹pagans˺ are awaiting nothing but a single Blast that cannot be stopped"},{"verseKey":"38:16","text":"They say ˹mockingly˺, “Our Lord! Hasten for us our share ˹of the punishment˺ before the Day of Reckoning.”"},{"verseKey":"38:17","text":"Be patient ˹O Prophet˺ with what they say. And remember Our servant, David, the man of strength. Indeed, he ˹constantly˺ turned ˹to Allah˺"},{"verseKey":"38:18","text":"We truly subjected the mountains to hymn ˹Our praises˺ along with him in the evening and after sunrise"},{"verseKey":"38:19","text":"And ˹We subjected˺ the birds, flocking together. All turned to him ˹echoing his hymns˺"},{"verseKey":"38:20","text":"We strengthened his kingship, and gave him wisdom and sound judgment"},{"verseKey":"38:21","text":"Has the story of the two plaintiffs, who scaled the ˹wall of David’s˺ sanctuary, reached you ˹O Prophet˺"},{"verseKey":"38:22","text":"When they came into David’s presence, he was startled by them. They said, “Have no fear. ˹We are merely˺ two in a dispute: one of us has wronged the other. So judge between us with truth—do not go beyond ˹it˺—and guide us to the right way"},{"verseKey":"38:23","text":"This is my brother. He has ninety-nine sheep while I have ˹only˺ one. ˹Still˺ he asked me to give it up to him, overwhelming me with ˹his˺ argument.”"},{"verseKey":"38:24","text":"David ˹eventually˺ ruled, “He has definitely wronged you in demanding ˹to add˺ your sheep to his. And certainly many partners wrong each other, except those who believe and do good—but how few are they!” Then David realized that We had tested him so he asked for his Lord’s forgiveness, fell down in prostration, and turned ˹to Him in repentance˺"},{"verseKey":"38:25","text":"So We forgave that for him. And he will indeed have ˹a status of˺ closeness to Us and an honourable destination"},{"verseKey":"38:26","text":"˹We instructed him:˺ “O David! We have surely made you an authority in the land, so judge between people with truth. And do not follow ˹your˺ desires or they will lead you astray from Allah’s Way. Surely those who go astray from Allah’s Way will suffer a severe punishment for neglecting the Day of Reckoning.”"},{"verseKey":"38:27","text":"We have not created the heavens and earth and everything in between without purpose—as the disbelievers think. So woe to the disbelievers because of the Fire"},{"verseKey":"38:28","text":"Or should We treat those who believe and do good like those who make mischief throughout the land? Or should We treat the righteous like the wicked"},{"verseKey":"38:29","text":"˹This is˺ a blessed Book which We have revealed to you ˹O Prophet˺ so that they may contemplate its verses, and people of reason may be mindful"},{"verseKey":"38:30","text":"And We blessed David with Solomon—what an excellent servant ˹he was˺! Indeed, he ˹constantly˺ turned ˹to Allah˺"},{"verseKey":"38:31","text":"˹Remember˺ when the well-trained, swift horses were paraded before him in the evening"},{"verseKey":"38:32","text":"He then proclaimed, “I am truly in love with ˹these˺ fine things out of remembrance for Allah,” until they went out of sight"},{"verseKey":"38:33","text":"˹He ordered,˺ “Bring them back to me!” Then he began to rub down their legs and necks"},{"verseKey":"38:34","text":"And indeed, We tested Solomon, placing a ˹deformed˺ body on his throne, then he turned ˹to Allah in repentance˺"},{"verseKey":"38:35","text":"He prayed, “My Lord! Forgive me, and grant me an authority that will never be matched by anyone after me. You are indeed the Giver ˹of all bounties˺.”"},{"verseKey":"38:36","text":"So We subjected to him the wind, blowing gently at his command to wherever he pleased"},{"verseKey":"38:37","text":"And ˹We subjected to him˺ every builder and diver of the jinn"},{"verseKey":"38:38","text":"and others bound together in chains"},{"verseKey":"38:39","text":"˹Allah said,˺ “This is Our gift, so give or withhold ˹as you wish˺, never to be called to account.”"},{"verseKey":"38:40","text":"And he will indeed have ˹a status of˺ closeness to Us and an honourable destination"},{"verseKey":"38:41","text":"And remember Our servant Job, when he cried out to his Lord, “Satan has afflicted me with distress and suffering.”"},{"verseKey":"38:42","text":"˹We responded,˺ “Stomp your foot: ˹now˺ here is a cool ˹and refreshing˺ spring for washing and drinking.”"},{"verseKey":"38:43","text":"And We gave him back his family, twice as many, as a mercy from Us and a lesson for people of reason"},{"verseKey":"38:44","text":"˹And We said to him,˺ “Take in your hand a bundle of grass, and strike ˹your wife˺ with it, and do not break your oath.” We truly found him patient. What an excellent servant ˹he was˺! Indeed, he ˹constantly˺ turned ˹to Allah˺"},{"verseKey":"38:45","text":"And remember Our servants: Abraham, Isaac, and Jacob—the men of strength and insight"},{"verseKey":"38:46","text":"We truly chose them for the honour of proclaiming the Hereafter"},{"verseKey":"38:47","text":"And in Our sight they are truly among the chosen and the finest"},{"verseKey":"38:48","text":"Also remember Ishmael, Elisha, and Ⱬul-Kifl. All are among the best"},{"verseKey":"38:49","text":"This is ˹all˺ a reminder. And the righteous will certainly have an honourable destination"},{"verseKey":"38:50","text":"the Gardens of Eternity, whose gates will be open for them"},{"verseKey":"38:51","text":"There they will recline, calling for abundant fruit and drink"},{"verseKey":"38:52","text":"And with them will be maidens of modest gaze and equal age"},{"verseKey":"38:53","text":"This is what you are promised for the Day of Reckoning"},{"verseKey":"38:54","text":"This is indeed Our provision that will never end"},{"verseKey":"38:55","text":"That is that. And the transgressors will certainly have the worst destination"},{"verseKey":"38:56","text":"Hell, where they will burn. What an evil place to rest"},{"verseKey":"38:57","text":"Let them then taste this: boiling water and ˹oozing˺ pus"},{"verseKey":"38:58","text":"and other torments of the same sort"},{"verseKey":"38:59","text":"˹The misleaders will say to one another,˺ “Here is a crowd ˹of followers˺ being thrown in with us. They are not welcome, ˹for˺ they ˹too˺ will burn in the Fire.”"},{"verseKey":"38:60","text":"The followers will respond, “No! You are not welcome! You brought this upon us. What an evil place for settlement!”"},{"verseKey":"38:61","text":"Adding, “Our Lord! Whoever brought this upon us, double their punishment in the Fire.”"},{"verseKey":"38:62","text":"The tyrants will ask ˹one another˺, “But why do we not see those we considered to be lowly"},{"verseKey":"38:63","text":"Were we wrong in mocking them ˹in the world˺? Or do our eyes ˹just˺ fail to see them ˹in the Fire˺?”"},{"verseKey":"38:64","text":"This dispute between the residents of the Fire will certainly come to pass"},{"verseKey":"38:65","text":"Say, ˹O Prophet,˺ “I am only a warner. And there is no god ˹worthy of worship˺ except Allah—the One, the Supreme"},{"verseKey":"38:66","text":"˹He is the˺ Lord of the heavens and the earth and everything in between—the Almighty, Most Forgiving.”"},{"verseKey":"38:67","text":"Say, “This ˹Quran˺ is momentous news"},{"verseKey":"38:68","text":"from which you ˹pagans˺ are turning away.”"},{"verseKey":"38:69","text":"˹And say,˺ “I had no knowledge of the highest assembly ˹in heaven˺ when they differed ˹concerning Adam˺"},{"verseKey":"38:70","text":"What is revealed to me is that I am only sent with a clear warning.”"},{"verseKey":"38:71","text":"˹Remember, O Prophet˺ when your Lord said to the angels, “I am going to create a human being from clay"},{"verseKey":"38:72","text":"So when I have fashioned him and had a spirit of My Own ˹creation˺ breathed into him, fall down in prostration to him.”"},{"verseKey":"38:73","text":"So the angels prostrated all together—"},{"verseKey":"38:74","text":"but not Iblîs, who acted arrogantly, becoming unfaithful"},{"verseKey":"38:75","text":"Allah asked, “O Iblîs! What prevented you from prostrating to what I created with My Own Hands? Did you ˹just˺ become proud? Or have you always been arrogant?”"},{"verseKey":"38:76","text":"He replied, “I am better than he is: You created me from fire and him from clay.”"},{"verseKey":"38:77","text":"Allah commanded, “Then get out of Paradise, for you are truly cursed"},{"verseKey":"38:78","text":"And surely upon you is My condemnation until the Day of Judgment.”"},{"verseKey":"38:79","text":"Satan appealed, “My Lord! Then delay my end until the Day of their resurrection.”"},{"verseKey":"38:80","text":"Allah said, “You will be delayed"},{"verseKey":"38:81","text":"until the appointed Day.”"},{"verseKey":"38:82","text":"Satan said, “By Your Glory! I will certainly mislead them all"},{"verseKey":"38:83","text":"except Your chosen servants among them.”"},{"verseKey":"38:84","text":"Allah concluded, “The truth is—and I ˹only˺ say the truth—"},{"verseKey":"38:85","text":"I will surely fill up Hell with you and whoever follows you from among them, all together.”"},{"verseKey":"38:86","text":"Say, ˹O Prophet,˺ “I do not ask you for any reward for this ˹Quran˺, nor do I pretend to be someone I am not"},{"verseKey":"38:87","text":"It is only a reminder to the whole world"},{"verseKey":"38:88","text":"And you will certainly know its truth before long.”"}]}