{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 4, "bookName": "Chapter: Mentioning The Prohibition Of One Who Is Junub Performing Ghusl In Standing Water", "hadiths": [{"id": 1, "hadithNumber": "396", "text": "Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'None of you should perform ghusl in standing water while he is Junub.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:396", "inBookReference": "Book 4, Hadith 1"}, {"id": 2, "hadithNumber": "397", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"None of you should urinate into standing water and then perform Ghusl or Wudu' with it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:397", "inBookReference": "Book 4, Hadith 2"}, {"id": 3, "hadithNumber": "398", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) forbade urinating into standing water and then performing Ghusl from Janabah in it.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:398", "inBookReference": "Book 4, Hadith 3"}, {"id": 4, "hadithNumber": "399", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) forbade urinating into standing water then performing Ghusl with it.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:399", "inBookReference": "Book 4, Hadith 4"}, {"id": 5, "hadithNumber": "400", "text": "It was narrated that Abu Hurairah said: \"None of you should urinate into standing water which does not flow and then perform Ghusl with it.\" (One of the narrators) Sufyan said: \"They said to Hisham - meaning Ibn Hassan - 'Ayyub only attributed this Hadith to Abu Hurairah?' So he said: 'If Ayyub is not able to raise up a narration then he does not raise it.'\" [1]\n\n[1] That is, he narrated it from Abu Hurairah, rather than from him from the Prophet (ﷺ) while others narrated it in Marfu' form or \"raised\" to the Prophet (ﷺ) And perhaps by: \"If he is able to not raise it\" he means: \"If he is not able to raise it.\" And Allah knows best.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:400", "inBookReference": "Book 4, Hadith 5"}, {"id": 6, "hadithNumber": "401", "text": "It was narrated from Jabir that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, let him not enter a bath house except wearing an Izar (waist wrap).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:401", "inBookReference": "Book 4, Hadith 6"}, {"id": 7, "hadithNumber": "402", "text": "'Abdullah bin Abi Awfa narrated that the Prophet (ﷺ) would supplicate: \"Allahumma tahhirni min adh-dhunub wal-khataya. Allahumma naqqini minha kama yunaqqa ath-thawb al-abyad min ad-danas, Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid (O Allah, purify me of sin and error, O Allah cleanse me of it as a white garment is cleansed of dirt, O Allah purify me with snow and hail and cold water).\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:402", "inBookReference": "Book 4, Hadith 7"}, {"id": 8, "hadithNumber": "403", "text": "It was narrated that Ibn Abi Awfa said: \"The Prophet (ﷺ) used to say: 'Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid, Allahumma tahhirni min adh-dhunub kama yutahhar ath-thawb al-abyad min ad-danas (O Allah, purify me with snow and hail and cold water, O Allah, purify me of sin as a white garment is cleansed of dirt).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Abi Awfa said:", "reference": "https://sunnah.com/nasai:403", "inBookReference": "Book 4, Hadith 8"}, {"id": 9, "hadithNumber": "404", "text": "It was narrated that 'Abdullah bin Abi Qais said: \"I asked 'Aishah: 'How did the Messenger of Allah (ﷺ) sleep while he was Junub? Did he perform Ghusl before sleeping or sleep before performing Ghusl?' She said: 'He did both. Sometimes he would perform Ghusl then sleep, and sometimes he would perform Wudu' then sleep.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin Abi Qais said:", "reference": "https://sunnah.com/nasai:404", "inBookReference": "Book 4, Hadith 9"}, {"id": 10, "hadithNumber": "405", "text": "It was narrated that Ghudaif bin Al-Harith said: \"I entered upon 'Aishah and asked her: 'Did the Messenger of Allah (ﷺ) perform Ghusl at the beginning of the night or at the end?' She said: 'Both. Sometimes he performed Ghusl at the beginning and sometimes at the end.' I said: 'Praise be to Allah who has made the matter flexible.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Ghudaif bin Al-Harith said:", "reference": "https://sunnah.com/nasai:405", "inBookReference": "Book 4, Hadith 10"}, {"id": 11, "hadithNumber": "406", "text": "It was narrated from Ya'la that the Messenger of Allah (ﷺ) saw a man performing Ghusl in an open place, so he ascended the Minbar and praised and glorified Allah, then he said: 'Allah, the Mighty and Sublime, is forbearing, modest and concealing, and He loves modesty and concealment. When any one of you performs Ghusl, let him conceal himself.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:406", "inBookReference": "Book 4, Hadith 11"}, {"id": 12, "hadithNumber": "407", "text": "It was narrated from Safwan bin Ya'la that his father said: \"The Messenger of Allah (ﷺ) said: 'Allah loves concealment, so when any one of you performs Ghusl let him conceal himself with something.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Safwan bin Ya'la that his father said:", "reference": "https://sunnah.com/nasai:407", "inBookReference": "Book 4, Hadith 12"}, {"id": 13, "hadithNumber": "408", "text": "It was narrated that Maimunah said: \"I put some water out for the Messenger of Allah (ﷺ), then I concealed him\" - and she mentioned how he performed Ghusl, then she said: \"Then I brought him a cloth (a towel) but he did not want it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Maimunah said:", "reference": "https://sunnah.com/nasai:408", "inBookReference": "Book 4, Hadith 13"}, {"id": 14, "hadithNumber": "409", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'While Ayyub, peace be upon him, was bathing naked, locusts of gold landed on him and he started to collect them in his garment. Then his Lord called him (saying): \"O Ayyub, did I not make you rich?\" he said: \"Yes, O Lord, but I cannot do without Your blessing.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:409", "inBookReference": "Book 4, Hadith 14"}, {"id": 15, "hadithNumber": "410", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah (ﷺ) used to perform Ghusl from a vessel which was the size of a Faraq [1] and he and I used to perform Ghusl from a single vessel.\"\n\n[1] See No. 230", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:410", "inBookReference": "Book 4, Hadith 15"}, {"id": 16, "hadithNumber": "411", "text": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) used to perform Ghusl, he and I from a single vessel, both of us scooping water from it.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:411", "inBookReference": "Book 4, Hadith 16"}, {"id": 17, "hadithNumber": "412", "text": "'Abdur-Rahman bin Al-Qasim said: \"I heard Al-Qasim narrating that 'Aishah said: 'I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from a single vessel for Janabah.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:412", "inBookReference": "Book 4, Hadith 17"}, {"id": 18, "hadithNumber": "413", "text": "It was narrated that 'Aishah said: \"I remember competing over the vessel [1] with the Messenger of Allah (ﷺ), when he and I were performing Ghusl from it.\"\n\n[1] See the following narration and no. 240.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:413", "inBookReference": "Book 4, Hadith 18"}, {"id": 19, "hadithNumber": "414", "text": "It was narrated that 'Aishah said: \"I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from one vessel. He would compete with me and I would with him (to take the water) until he would say: 'Leave me some,' and I would say, 'Leave me some.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:414", "inBookReference": "Book 4, Hadith 19"}, {"id": 20, "hadithNumber": "415", "text": "Umm Hani' narrated that she entered upon the Prophet (ﷺ) on the day of the Conquest of Makkah, when he was performing Ghusl - while a garment was screening him - from a vessel in which were traces of dough. She said: He prayed Ad-Duha - but I do not know how many Rak'ahs he prayed - after he finished Ghusl.'\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:415", "inBookReference": "Book 4, Hadith 20"}, {"id": 21, "hadithNumber": "416", "text": "'Aishah said: \"I remember performing Ghusl - myself and the Messenger of Allah (ﷺ), from this\" - a vessel like a Sa' or smaller. \"We both started taking water from it and I poured water over my head with my hand, three times, without undoing any of my hair.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:416", "inBookReference": "Book 4, Hadith 21"}, {"id": 22, "hadithNumber": "417", "text": "It was narrated from Ibrahim bin Muhammad bin Al-Muntashir that his father said: \"I heard Ibn 'Umar say: 'I would rather wake up in the morning covered in tar than wake up and enter Ihram with the smell of perfume coming from me.' I entered upon 'Aishah and told her what he had said, and she said: 'I put perfume on the Messenger of Allah (ﷺ) and he went round to all his wives, then in the morning he entered Ihram.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibrahim bin Muhammad bin Al-Muntashir that his father said:", "reference": "https://sunnah.com/nasai:417", "inBookReference": "Book 4, Hadith 22"}, {"id": 23, "hadithNumber": "418", "text": "It was narrated that Maimunah said: \"The Messenger of Allah (ﷺ) performed Wudu' as for prayer, but did not wash his feet, and he washed his private part and whatever had got onto it, then he poured water over himself, then he moved his feet and washed them.\" She said: \"This is Ghusl from Janabah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Maimunah said:", "reference": "https://sunnah.com/nasai:418", "inBookReference": "Book 4, Hadith 23"}, {"id": 24, "hadithNumber": "419", "text": "It was narrated that Maimunah bint Al-Harith, the wife of the Prophet (ﷺ), said: \"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would start by washing his hands, then he would pour water with his right hand onto his left and wash his private part, then he would strike his hand on the ground then wipe it then wash it. Then he would perform Wudu' as for prayer, then he would pour water on his head and all of his body. Then he would move and wash his feet.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Maimunah bint Al-Harith, the wife of the Prophet (ﷺ), said:", "reference": "https://sunnah.com/nasai:419", "inBookReference": "Book 4, Hadith 24"}, {"id": 25, "hadithNumber": "420", "text": "It was narrated that 'Aishah said: \"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would wash his hands, then perform Wudu' as for prayer, then he would perform Ghusl, then run his fingers through his hair to be sure that the water pour water over his head three times, then wash the rest of his body.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:420", "inBookReference": "Book 4, Hadith 25"}, {"id": 26, "hadithNumber": "421", "text": "It was narrated that 'Aishah said: \"The Prophet (ﷺ) used to like to start with the right as much as he could when purifying himself, putting on sandals and combing his hair\" - and he (the narrator) said in Wasit (a place in Iraq): \"And in all his affairs.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:421", "inBookReference": "Book 4, Hadith 26"}, {"id": 27, "hadithNumber": "422", "text": "It was narrated from Abu Salamah from 'Aishah, and, from 'Amr bin Sa'd, from Nafi', from Ibn 'Umar: That 'Umar asked the Messenger of Allah (ﷺ) about Ghusl from Janabah - and the narrations agree on this - that one should start by pouring water on the right hand two or three times, then put the right hand into the vessel and pour water with it onto the private parts, with the left hand on the private parts to wash off whatever is there, until it is clean; then put the left hand on the dust if one wants to, then pour water over the left hand until it is clean; then wash the hands three times, (sniff water into the nose) and rinse the mouth, and wash the face and forearms, three times each until when reaching the head, he does not wipe the head, rather he pours water over it. This is how the Messenger of Allah (ﷺ) performed Ghusl according to what was mentioned.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Salamah from 'Aishah, and, from 'Amr bin Sa'd, from Nafi', from Ibn 'Umar:", "reference": "https://sunnah.com/nasai:422", "inBookReference": "Book 4, Hadith 27"}, {"id": 28, "hadithNumber": "423", "text": "It was narrated that 'Aishah said: \"When the Messenger of Allah (ﷺ0 performed Ghusl from Janabah, he would wash his hands, then perform Wudu' as for prayer, then run his fingers through his hair until he was sure the water had reached the scalp, then he would pour water over his head three times, then wash the rest of his body.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:423", "inBookReference": "Book 4, Hadith 28"}, {"id": 29, "hadithNumber": "424", "text": "It was narrated that 'Aishah said: \"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would call for something like a vessel used for milking a she-camel, then he would take (some water) in his hand and start with the right side of his head, then the left, then take (some water) in his hands and start pouring it on his head.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:424", "inBookReference": "Book 4, Hadith 29"}, {"id": 30, "hadithNumber": "425", "text": "It was narrated from Jubair bin Mut'im that mention of Ghusl was made in the presence of the Prophet (ﷺ) and he said: \"As for me, I pour water on my head three times.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:425", "inBookReference": "Book 4, Hadith 30"}, {"id": 31, "hadithNumber": "426", "text": "It was narrated that Jabir said: \"When the Messenger of Allah (ﷺ) performed Ghusl, he would pour water on his head three times.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:426", "inBookReference": "Book 4, Hadith 31"}, {"id": 32, "hadithNumber": "427", "text": "It was narrated from 'Aishah: \"A woman asked the Prophet (ﷺ): 'O Messenger of Allah, how should I perform Ghusl when I become pure?' He said: 'Take a piece of cotton wool scented with musk and clean yourself with it.' She said: 'How should I clean myself with it?' He said: 'Clean yourself with it.' She said: \"How should I clean myself with it?' The Messenger of Allah (ﷺ) said: 'Subhan Allah!' and turned away from her.\" 'Aishah understood what the Messenger of Allah (ﷺ) meant, and said: \"So I pulled her toward me and told her what the Messenger of Allah (ﷺ) meant.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Aishah:", "reference": "https://sunnah.com/nasai:427", "inBookReference": "Book 4, Hadith 32"}, {"id": 33, "hadithNumber": "428", "text": "It was narrated that Maimunah, the wife of the Prophet (ﷺ), said: \"The Prophet (ﷺ) performed Ghusl from Janabah; he washed his private part then rubbed his hand on the ground or the wall, then he performed Wudu' as for prayer, then he poured water over his head and the rest of his body.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Maimunah, the wife of the Prophet (ﷺ), said:", "reference": "https://sunnah.com/nasai:428", "inBookReference": "Book 4, Hadith 33"}, {"id": 34, "hadithNumber": "429", "text": "Ja'far bin Muhammad said: \"My father told me: 'We came to Jabir bin 'Abdullah and asked him about the Hajj of the Prophet (ﷺ). He narrated; \"The Messenger of Allah (ﷺ) set out when there were five (days) remaining in Dhul-Qa'dah, and we set out with him. When he came to Dhul-Hulaifah, Asma' bint 'Umais gave birth to Muhammad bin Abi Bakr. She sent word to the Messenger of Allah (ﷺ) asking what he should do. He said: 'Perform Ghusl, bind yourself with a cloth then begin (the Talbiyah for Ihram).'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:429", "inBookReference": "Book 4, Hadith 34"}, {"id": 35, "hadithNumber": "430", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah (ﷺ) would not perform Wudu' after Ghusl.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:430", "inBookReference": "Book 4, Hadith 35"}, {"id": 36, "hadithNumber": "431", "text": "'Aishah said: \"I used to put perfume on the Messenger of Allah (ﷺ) and he would go around to all his wives, then enter Ihram in the morning with the smell of perfume coming from him.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:431", "inBookReference": "Book 4, Hadith 36"}, {"id": 37, "hadithNumber": "432", "text": "It was narrated that Jabir bin 'Abdullah said: \"The Messenger of Allah (ﷺ) said: 'I have been given five things that were not given to anyone before me: I have been supported with fear being struck into the hearts of my enemy for a distance of one month's travel; the earth has been made a place of prostration and a means of purification for me, so wherever a man of my Ummah is when the time for prayer comes, let him pray; I have been given the intercession which was not given to any Prophet before me; and I have been sent to all of mankind whereas the Prophets before me were sent to their own people.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin 'Abdullah said:", "reference": "https://sunnah.com/nasai:432", "inBookReference": "Book 4, Hadith 37"}, {"id": 38, "hadithNumber": "433", "text": "It was narrated from Abu Sa'eed that two men performed Tayammum and prayed, then they found water when there was still time left for prayer. One of them performed Wudu' and repeated the prayer, and the other did not. They asked the Prophet (ﷺ) about that and he said to the one who did not repeat the prayer: \"You followed the Sunnah and your prayer is acceptable.\" And he said to the other: \"And you will have something like the reward of two prayers.\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:433", "inBookReference": "Book 4, Hadith 38"}, {"id": 39, "hadithNumber": "434", "text": "It was narrated from 'Ata' bin Yasar that two men - and he quoted the Hadith.", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:434", "inBookReference": "Book 4, Hadith 39"}, {"id": 40, "hadithNumber": "40", "text": "It was narrated from Tariq bin Shaihab that a man became Junub and did not pray. He came to the Prophet (ﷺ) and told him about that, and he said: \"You did the right thing.\" Then another man became Junub so he performed Tayammum and prayed. He came (to the Prophet (ﷺ)) who said to him what he had said to the other man- meaning, \"You did the right thing.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:434b", "inBookReference": "Book 4, Hadith 40"}, {"id": 41, "hadithNumber": "435", "text": "It was narrated that Ibn 'Abbas said: \"Ali, Al-Miqdad and 'Ammar were talking. 'Ali said: 'I am a man who emits a lot of Madhi but I am too shy to ask the Messenger of Allah (ﷺ) about that because of his daughter's position with me, so let one of you ask him.' He told me that one of them - but I forgot who - asked him, and the Prophet (ﷺ) said: 'That is Madhi. If any one of you notices that, let him wash it off himself and perform Wudu' as for prayer or similar to the Wudu' of prayer.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:435", "inBookReference": "Book 4, Hadith 41"}, {"id": 42, "hadithNumber": "436", "text": "It was narrated that 'Ali, may Allah be please with him, said: \"I was a man who emotted a great deal of Madhi. I told a man to ask the Prophet (ﷺ) (about that) and he said: 'Wudu' (is required) for that.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Ali, may Allah be please with him, said:", "reference": "https://sunnah.com/nasai:436", "inBookReference": "Book 4, Hadith 42"}, {"id": 43, "hadithNumber": "437", "text": "It was narrated that 'Ali said: \"I felt too shy to ask the Messenger of Allah (ﷺ) about Madhi because of Fatimah, so I told Al-Miqdad to ask him, and he said: 'Wudu' (is required) for that.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Ali said:", "reference": "https://sunnah.com/nasai:437", "inBookReference": "Book 4, Hadith 43"}, {"id": 44, "hadithNumber": "438", "text": "'Ali said: \"I sent Al-Miqdad to the Messenger of Allah (ﷺ) to ask him about Madhi, and he said: 'Perform Wudu' and sprinkle water over your private part.'\"\nAbu 'Abdur-Rahman said: Makhramah (one of the narrators) did not hear anything from his father.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:438", "inBookReference": "Book 4, Hadith 44"}, {"id": 45, "hadithNumber": "439", "text": "It was narrated that Sulaiman bin Yasar said: \"Ali bin Abi Talib sent Al-Miqdad to the Messenger of Allah (ﷺ) to ask him about a man who notices Madhi. The Messenger of Allah (ﷺ) said: 'Let him wash his penis then perform Wudu'.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Sulaiman bin Yasar said:", "reference": "https://sunnah.com/nasai:439", "inBookReference": "Book 4, Hadith 45"}, {"id": 46, "hadithNumber": "440", "text": "It was narrated from Al-Miqdad bin Al-Aswad thatt 'Ali bin Abi Talib, peace be upon him, told him to ask the Messenger of Allah (ﷺ) about a man who gets close to a woman and Madhi comes out of him. (He said: ) \"For his daughter is (married) to me and I feel too shy to ask him.\" So he asked the Messenger of Allah (ﷺ) about that and he said: \"If any one of you notices that let him sprinkle water on his private parts and perform Wudu' as for prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:440", "inBookReference": "Book 4, Hadith 46"}, {"id": 47, "hadithNumber": "441", "text": "Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'When any one of you gets up after (sleeping) at night, let him not put his hand into the vessel until he has poured water on it two or three times, for none of you knows where his hand spent the night.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:441", "inBookReference": "Book 4, Hadith 47"}, {"id": 48, "hadithNumber": "442", "text": "It was narrated that Ibn 'Abbas said: \"I prayed with the Prophet (ﷺ) one night, and I stood on his left, but he made me stand on his right, and he prayed. Then he reclined on his side and took a nap, then the Mu'adhdhin came to him and he prayed, and did not perform Wudu'.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:442", "inBookReference": "Book 4, Hadith 48"}, {"id": 49, "hadithNumber": "443", "text": "It was narrated from Anas that the Messenger of Allah (ﷺ) said: \"If anyone of you feels drowsy during his Salah, let him go and take a nap.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Anas that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:443", "inBookReference": "Book 4, Hadith 49"}, {"id": 50, "hadithNumber": "444", "text": "It was narrated that Busrah said: \"The Messenger of Allah (ﷺ) said: 'Whoever touches his private part, let him perform Wudu'.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Busrah said:", "reference": "https://sunnah.com/nasai:444", "inBookReference": "Book 4, Hadith 50"}, {"id": 51, "hadithNumber": "445", "text": "It was narrated from Busrah bint Safwan that the Prophet (ﷺ) said: \"If any one of you touches his private part with his hand, let him perform Wudu'.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Busrah bint Safwan that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:445", "inBookReference": "Book 4, Hadith 51"}, {"id": 52, "hadithNumber": "446", "text": "It was narrated that Marwan bin Al-Hakam said that one should perform Wudu' after touching one's penis. Marwan said: \"Busrah bint Safwan told me that.\" 'Urwah sent someone to check that, and she said: \"The Messenger of Allah (ﷺ) mentioned what Wudu' is done for, and said: 'Touching the penis.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:446", "inBookReference": "Book 4, Hadith 52"}, {"id": 53, "hadithNumber": "447", "text": "It was narrated from Busrah bin Safwan that the Prophet (ﷺ) said: \"Whoever touches his penis, he should not perform Salah until he performs Wudu'.\"\nAbu 'Abdur-Rahman (An-Nasa'i) said: Hisham bin 'Urwah did not hear this Hadith from his father.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Busrah bin Safwan that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:447", "inBookReference": "Book 4, Hadith 53"}]}