{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 6, "bookName": "Chapter: How Jibril Led The Prayer And The Definition Of The Times Of The Five Daily Prayers", "hadiths": [{"id": 1, "hadithNumber": "494", "text": "It was narrated from Ibn Shihab that 'Umar bin 'Abdul-'Aziz delayed the 'Asr prayer a little. 'Urwah said to him: \"Jibril came down and led the Messenger of Allah (ﷺ) in prayer.\" 'Umar said: \"Watch what you are saying, O 'Urwah!\" He said: \"I heard Bashir bin Abi Mas'ud say: 'I heard Abu Mas'ud say: \"I heard the Messenger of Allah (ﷺ) say: 'Jibril came down and led me in prayer, and I prayed with him, then I prayed with him, then I prayed with him, then I prayed with him, then I prayed with him - and he counted off five prayers on his fingers.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:494", "inBookReference": "Book 6, Hadith 1"}, {"id": 2, "hadithNumber": "495", "text": "Shu'bah said: \"Sayyar bin Salamah, narrated to us, he said: 'I heard my father ask Abu Barzah about the prayer of the Messenger of Allah (ﷺ).' I said: 'Did you really hear him?' He said: 'As I can hear you now.' He said: 'I heard my father ask about the prayer of the Messenger of Allah (ﷺ).' He said: 'He would not mind if he delayed it - meaning 'Isha' until midnight, and he did not like to sleep before it or speak after it.'\" Shu'bah said: \"Then I met him later on and asked him. He said: 'He used to pray Zauhr when the sun had passed its zenith, and (he would pray) 'Asr and a man could walk to the farthest point in Al-Madinah and the sun would still be clear and hot. And Maghrib, I do not know the time he mentioned.' After that I met him and asked him, and he said: 'He used to pray Fajr then after the prayer a man could regarding it, sitting next to him, look at the face of someone he knew and he could recognize it.' He said: 'And he used to recite in it between sixty and one hundred (verses).'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:495", "inBookReference": "Book 6, Hadith 2"}, {"id": 3, "hadithNumber": "496", "text": "It was narrated from Az-Zuhri he said: \"Anas told me that the Messenger of Allah (ﷺ) went out when the sun had passed its zenith, and led them in Zuhr prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Az-Zuhri he said:", "reference": "https://sunnah.com/nasai:496", "inBookReference": "Book 6, Hadith 3"}, {"id": 4, "hadithNumber": "497", "text": "It was narrated that Khabbab said: \"We complained to the Messenger of Alalh (ﷺ) about how hot the sand was, but he did not respond to our complaint.\" It was said to Abu Ishaq (one of the narrators): \"Did they complain regarding his praying it early?\" He said: \"Yes.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Khabbab said:", "reference": "https://sunnah.com/nasai:497", "inBookReference": "Book 6, Hadith 4"}, {"id": 5, "hadithNumber": "498", "text": "Hamzah Al-'A'idhi said: \"I heard Anas bin Malik say: 'When the Prophet (ﷺ) halted, he would not move on until he had prayed Zuhr.' A man said: 'Even if it was the middle of the day?' He said: 'Even if it was the middle of the day.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:498", "inBookReference": "Book 6, Hadith 5"}, {"id": 6, "hadithNumber": "499", "text": "Khalid bin Dinar Abu Khaldah said: \"I heard Anas bin Malik say: 'When it was hot, the Messenger of Allah (ﷺ) would wait until it cooled down to pray, and when it was cold he would hasten to pray.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:499", "inBookReference": "Book 6, Hadith 6"}, {"id": 7, "hadithNumber": "500", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'If it is very hot, wait until it cools down before you pray, for intense heat is a breeze from Hell.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:500", "inBookReference": "Book 6, Hadith 7"}, {"id": 8, "hadithNumber": "501", "text": "It was narrated from Abu Musa in a Marfu' [1] report: \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"\n\n[1] Meaning he attributed it to the Prophet (ﷺ).", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Musa in a Marfu' [1] report:", "reference": "https://sunnah.com/nasai:501", "inBookReference": "Book 6, Hadith 8"}, {"id": 9, "hadithNumber": "502", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: This is 'Jibril, peace be upon you, he came to teach you your religion. He prayed Subh when the dawn appeared, and he prayed Zuhr when the sun had (passed its zenith), and he prayed 'Asr when he saw that the shadow of a thing was equal to its height, then he prayed Maghrib when the sub had set and it is permissible for the fasting person to eat. Then he prayed 'Isha' when the twilight had disappeared. Then he came to him the following day and prayed Subh when it had got a little lighter, then he prayed Zuhr when the shadow of a thing was equal to its height, then he prayed 'Asr when the shadow of a thing was equal to twice its height, then he prayed Maghrib at the same time as before, then he prayed 'Isha' when a short period of the night had passed. Then he said: 'The prayer is between the times when you prayed yesterday and the times when you prayed today.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:502", "inBookReference": "Book 6, Hadith 9"}, {"id": 10, "hadithNumber": "503", "text": "It was narrated that 'Abdullah bin Mas'ud said: \"The Prophet (ﷺ) prayed Zuhr when the length of (a person's shadow) was between three and five feet in summer, and between five and seven feet in winter.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin Mas'ud said:", "reference": "https://sunnah.com/nasai:503", "inBookReference": "Book 6, Hadith 10"}, {"id": 11, "hadithNumber": "504", "text": "It was narrated that Jabir said: \"A man asked the Messenger of Allah (ﷺ) about the times of prayer. He said: 'Pray with me.' So he prayed Zuhr when the sun had passsed its zenith, 'Asr when the shadow of a thing was equal to its height, Maghrib when the sun had set and 'Isha' when the twilight had disappeared.\" He said: \"Then he prayed Zuhr when the shadow of a man was equal in length to his height, 'Asr when the length of a man's shadow was twice his height, and Maghrib just before the twilight disappeared.\" (One of the narrators) 'Abdullah bin Al-Harith said: \"then he said: 'With regard to 'Isha' I think it is up to one-third of the night.'\" [1]\n\n[1] The speaker there is Thawr, who narrated it from 'Ata' from Jabir.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:504", "inBookReference": "Book 6, Hadith 11"}, {"id": 12, "hadithNumber": "505", "text": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) prayed 'Asr when the sun was in her room and the shadow had not appeared on her wall.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:505", "inBookReference": "Book 6, Hadith 12"}, {"id": 13, "hadithNumber": "506", "text": "It was narrated from Anas: \"The Messenger of Allah (ﷺ) used to pray 'Asr, then a person could go to Quba'.\" One of them [1] said: \"And he would come to them when they were prayed.\" The other said: \"And the sub was still high.\"\n\n[1] Both Az-Zuhri and Ishaq bin 'Abdullah narrated it from Anas, so the reference is about them.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Anas:", "reference": "https://sunnah.com/nasai:506", "inBookReference": "Book 6, Hadith 13"}, {"id": 14, "hadithNumber": "507", "text": "It was narrated that Anas bin Malik said: \"The Messenger of Allah (ﷺ) used to pray 'Asr when the sun was still high and bright, and a person could go to Al-'Awali [1] when the sun was still high.\"\n\n[1] Al-'Awali is the southern most district of Al-Madinah, and it is very big. Its nearest limit is at a distance of about two miles from the center of Al-Madinah. While its furthest limit is about eight miles.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas bin Malik said:", "reference": "https://sunnah.com/nasai:507", "inBookReference": "Book 6, Hadith 14"}, {"id": 15, "hadithNumber": "508", "text": "It was narrated that Anas bin Malik said: \"The Messenger of Allah (ﷺ) used to lead us in 'Asr prayer when the sun was still bright and high.\"", "grade": null, "narratedBy": "It was narrated that Anas bin Malik said:", "reference": "https://sunnah.com/nasai:508", "inBookReference": "Book 6, Hadith 15"}, {"id": 16, "hadithNumber": "509", "text": "It was narrated that Abu Bakr bin 'Uthman bin Sahl bin Hunaif said: \"I heard Abu Umamah bin Sahl say: 'We prayed Zuhr with 'Umar bin 'Abdul-'Aziz, then we went out and entered upon Anas bin Malik, and we found him praying 'Asr.'\" I said: \"O uncle, what is this prayer that you prayed?\" He said: \"'Asr; this is the prayer of the Messenger of Allah (ﷺ) that we used to pray with him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Bakr bin 'Uthman bin Sahl bin Hunaif said:", "reference": "https://sunnah.com/nasai:509", "inBookReference": "Book 6, Hadith 16"}, {"id": 17, "hadithNumber": "510", "text": "It was narrated that Abu Salamah said: \"We prayed at the time of 'Umar bin 'Abdul-'Aziz, then we went to Anas bin Malik and found him praying. when he finished he said to us: 'Have you prayed?' We said: 'We prayed Zuhr.' He said: 'I prayed 'Asr.' They said: 'You have prayed early.' He said: 'Rather I prayed as I saw my companions pray.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Abu Salamah said:", "reference": "https://sunnah.com/nasai:510", "inBookReference": "Book 6, Hadith 17"}, {"id": 18, "hadithNumber": "511", "text": "Al-'Ala' narrated to us that he entered upon Anas bin Malik in his house in Al-Basrah, when he had finished Zuhr, and his house was beside the Masjid. \"When we entered upon him, he said: 'Have you prayed 'Asr?' We said: 'No, we have just finished Zuhr.' He said: 'Pray 'Asr.' So we got up and prayed, and when we finished he said: 'I heard the Messenger of Allah (ﷺ) say: \"That is the prayer of the hypocrite: he sits and delays 'Asr prayer until (the sun) is between the horns of the Shaitan, then he gets up and pecks four (Rak'ahs) in which he only remembers Allah a little.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:511", "inBookReference": "Book 6, Hadith 18"}, {"id": 19, "hadithNumber": "19", "text": "It was narrated from Salim, from his father, that the Messenger of Allah (ﷺ) said: \"The one who misses 'Asr prayer, it is as if he has been robbed of his family and his wealth.\" It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"The one who misses 'Asr prayer, it is as if he has been robbed of his family and his wealth.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim, from his father, that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:", "inBookReference": "Book 6, Hadith 19"}, {"id": 20, "hadithNumber": "513", "text": "It was narrated from Jabir bin 'Abdullah that Jibril came to the Prophet (ﷺ) to teach him the times of prayer. Jibril went forward, with the Messenger of Allah (ﷺ) behind him and the people behind the Messenger of Allah (ﷺ), and he prayed Zurh when the sun had passed its zenith. Then he came to him when the shadow of a person was equal to his height, and did as he had done before; Jibril went forward, with the Messenger of Allah (ﷺ) behind him and the people behind the Messenger of Allah (ﷺ), and he prayed 'Asr. Then Jibril came to him when the sun had set; Jibril went forward, with the Messenger of Allah (ﷺ) behind him and the people behind the Messenger of Allah (ﷺ), and he prayed Al-Ghadah. [1] Then he came to him on the second day when a man's shadow was equal to his height, and did as he had done the day before, he prayed Zuhr. Then he came to him when the shadow of a man was twice his height, and did what he had done the day before, and prayed 'Asr. Then he came to him when the sun had set and did what he had done the day before, and prayed Maghrib. Then we slept and got up, and slept and got up again. Then he came to him and did what he had done the day before and prayed 'Isha.' The  he came to him when the (the light of) dawn was spread (on the horizon) [2] and the starts were still clear in the sky, and he did the same as he had done the day before, and prayed Al-Ghadah. Then he said: ' The time between these two is the time for prayer.'\"\n\n[1] Meaning Fajr, the morning prayer.\n[2] The Fajr prayer was elongated because the Prophet recited at length during the prayer, so that it ended just before sunrise. That defined the end of the time for Fajr, as the beginning of the time was defined by the  moment when he started the first Rak'ah.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:513", "inBookReference": "Book 6, Hadith 20"}, {"id": 21, "hadithNumber": "514", "text": "It was narrated from Abu Hurairah, may Allah be pleased with him, that the Prophet (ﷺ) said: \"Whoever catches up with two Rak'ahs of 'Asr prayer before the sun sets, or one Rak'ah of the Subh prayer before the sun rises, has caught it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah, may Allah be pleased with him, that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:514", "inBookReference": "Book 6, Hadith 21"}, {"id": 22, "hadithNumber": "515", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever catches up with one Rak'ah of 'Asr prayer before the sun sets, or catches up with one Rak'ah of Fajr before the sun rises, has caught it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:515", "inBookReference": "Book 6, Hadith 22"}, {"id": 23, "hadithNumber": "516", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"If any one of you catches the first prostration of 'Asr prayer before the sun sets, let him complete his prayer, and if he catches up with the first prostration of Fajr prayer before the sub rises, let him complete his prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:516", "inBookReference": "Book 6, Hadith 23"}, {"id": 24, "hadithNumber": "517", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Whoever catches up with a Rak'ah of the Subh prayer before the sun rises, then he has caught up with Subh, and whoever catches up with a Rak'ah of 'Asr prayer before the sun sets, then he has caught up with 'Asr.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:517", "inBookReference": "Book 6, Hadith 24"}, {"id": 25, "hadithNumber": "518", "text": "It was narrated from Nasr bin 'Abdur-Rahman, from his grandfather Mu'adh, that he performed Tawaf with Mu'adh bin 'Afra' but he did not pray. \"I said: 'Are you not going to pray?' He said: 'The Messenger of Allah (ﷺ) said: 'There is no prayer after 'Asr until the sun has set, nor after Subh until the sun has risen.'\"", "grade": "Da'if (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:518", "inBookReference": "Book 6, Hadith 25"}, {"id": 26, "hadithNumber": "519", "text": "It was narrated from Sulaiman bin Buraidah that his father said: \"A man came to the Messenger of Allah (ﷺ) and asked him about the times of prayer. He said: 'Stay with us for these two days.' Then he told Bilal to say the Iqamah at dawn and he prayed Fajr. Then he told him to do that when the sun had passed its zenith and he prayed Zuhr. Then he told him to do that when the sun was still bright, and he said the Iqamah for 'Asr. Then he told him to do that when the last part of the sun had dissapeared, and he said the Iqamah for Maghrib. Then he told him to do that when the twilight had disappeared and he said the Iqamah for 'Isha'. The following day, he prayed Fajr when there was light, then he delayed Zuhr until it was cooler, and waited until it was much cooler before praying 'Asr but the sun was still clear, so he prayed 'Asr later than on the first day. Then he prayed Maghrib before the twilight disappeared. Then he told him to say the Iqamah for 'Isha' when one-third of the night had passed, and he prayed, then he said: 'Where is the one who was asking about the times of prayer? The times of your prayer are between the times you have seen.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Sulaiman bin Buraidah that his father said:", "reference": "https://sunnah.com/nasai:519", "inBookReference": "Book 6, Hadith 26"}, {"id": 27, "hadithNumber": "520", "text": "It was narrated from a man of Aslam, who was one of the Companions of the Prophet (ﷺ), that they used to pray Maghrib with the Prophet (ﷺ),then they would go back to their families in the furthest part of Al-Madinah, shooting arrows and seeing where they landed. [1]\n\n[1] Because it was still bright enough.", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:520", "inBookReference": "Book 6, Hadith 27"}, {"id": 28, "hadithNumber": "521", "text": "It was narrated that Abu Basrah Al-Ghifari said: \"The Messenger of Allah (ﷺ) led us in praying 'Asr in Al-Mukhammas. He said: 'This prayer was enjoined upon those who came before you, but they neglected it. Whoever prays it regularly will have a two-fold reward, and there is no prayer after it until the Shahid appears.\" And the Shahid is \"the star.\" [1]\n\n[1] This is a statement of one of the narrators, and Allah knows best.", "grade": null, "narratedBy": "It was narrated that Abu Basrah Al-Ghifari said:", "reference": "https://sunnah.com/nasai:521", "inBookReference": "Book 6, Hadith 28"}, {"id": 29, "hadithNumber": "522", "text": "It was narrated from 'Abdullah bin 'Amr - and (one of the narrators) Shu'bah said: \"Sometimes he (Qatadah, his teacher) narrated it as a Marfu' report and sometimes he did not\" - \"The time for Zuhr prayer is until 'Asr comes, and the time for 'Asr prayer is until the sun turns yellow. the time for Maghrib is until the twilight disappears, and the time for 'Isha' is until the night is halfway through, and the time for Subh is until the sun rises.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin 'Amr - and (one of the narrators) Shu'bah said:", "reference": "https://sunnah.com/nasai:522", "inBookReference": "Book 6, Hadith 29"}, {"id": 30, "hadithNumber": "523", "text": "Abu Bakr bin Abi Musa narrated that his father said: \"A man came to the Prophet (ﷺ) asking him about the times of prayer, and he did not answer him. He told Bilal to say the Iqamah at dawn broke, then he told him to say the Iqamah for Zuhr when the sun had passed its zenith and a person would say: 'It is the middle of the day,' but he (the Prophet (ﷺ)) knew better. Then he told him to say the Iqamah for 'Asr when the sun was still high. Then he told him to say the Iqamah for Maghrib when the sun had set. Then he told him to say the Iqamah for 'Isha' when the twilight had dissapeared. Then the next day he told him to say the Iqamah for Fajr, at a time such that when after he had finished one would say: 'The sun has risen.' Then he delayed Zuhr until it was nearly the time of 'Asr compared to the day before. Then he delayed 'Asr, to a time such that when he finished one would say: 'The su has turned red.' Then he delayed Maghrib until the twilight was about to disappear. Then he delayed 'Isha' until one-third of the night had passed. Then he said: 'The time (for prayer) is between these times.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:523", "inBookReference": "Book 6, Hadith 30"}, {"id": 31, "hadithNumber": "524", "text": "Al-Husain bin Bashir bin Sallam narrated that his father said: \"Muhammad bin 'Ali and I entered upon Jabir bin 'Abdullah Al-Ansari. We said to him: 'Tell us about the prayer of the Messenger of Allah (ﷺ).' That was at the time of Al-Hajjaj bin Yusuf. He said: 'The Messenger of Allah (ﷺ) came out and prayed Zuhr when the sun had passed its zenith and the shadow (of a thing) was the length of a sandal-strap. Then he prayed 'Asr when the shadow of a man was the length of a sandal-strap plus his height. Then he prayed Maghrib when the sun had set. Then he prayed 'Isha' when the twilight disappeared. Then he prayed Fajr when dawn broke. The next day he prayed Zuhr when a man's shadow was equal to his height. Then he prayed 'Asr when a man's shadow was twice his height, and (the time between the prayer and sunset) lasted as long as it takes a swift rider to reach Dhul-Hulaifah. Then he prayed Maghrib when the sun set, then he prayed 'Isha' when one-third or one-half of the night had passed'\" - (One of the narrators) Zaid, was not sure - \"then he prayed Fajr when it had become bright.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:524", "inBookReference": "Book 6, Hadith 31"}, {"id": 32, "hadithNumber": "525", "text": "Sayyar bin Salamah said: \"I entered upon Abu Barzah, and my fatehr asked him: 'How did the Messenger of Allah (ﷺ) pray the prescribed prayers?' He said: 'He used to pray Zuhr, which you call Al-Uula (the first) when the sun passed its zenith; he used to pray 'Asr when one of us could go back to his hoome in the farthest part of Al-Madinah while the sun was still bright.' I forgot what he said about Maghrib. 'And he used to like to delay 'Isha', which you call Al-'Atamah, and he did not like to sleep before it nor talk after it. And he used to finish the Al-Ghadah (Fajr) prayer when a man could recognize his neighbor, and he used to recite (in it) between sixty and one hundred verses.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:525", "inBookReference": "Book 6, Hadith 32"}, {"id": 33, "hadithNumber": "526", "text": "Jabir bin 'Abdullah said: \"Jibril, peace be upon him, came to the Prophet (ﷺ) when the sun had passed its zenith and said: 'Get up, O Muhammad, and pray Zuhr when the sun has passed its zenith.' Then he waited until a man's shadow was equal to his height. Then he came to him for 'Asr and said: 'Get up, O Muhammad, and pray 'Asr.' Then he waited until the sunset, then he came to him and said: 'Get up, O Muhammad, and pray Maghrib.' So he got up and prayed it when the sun had set. Then he waited until the twilight disappeared, then he came to him and said: 'Get up, O Muhammad, and pray 'Isha'.' So he got up and prayed it. Then he came to him when dawn broke and said: 'Get up, O Muhammad, and pray.' So he got up and prayed Subh.' So he got up and prayed Subh. Then he came to him the next day when a man's shadow was equal to his height, and said: 'Get up, O Muhammad, and pray.' So he prayed Zuhr. Then Jibril came to him when a man's shadow was equal to twice his length and said: 'Get up, O Muhammad, and pray.' So he prayed 'Asr. Then he came to him for Maghrib when the sun set, at exactly the same time as the day before, and said: 'Get up, O Muhammad, and pray.' So he prayed Maghrib. Then he came to him for 'Isha' when the first third of the night had passed, and said: 'Get up and pray.' So he prayed 'Isha'. Then he came to him for Subh when it had become very bright, and said: 'Get up and pray.' So he prayed Subh. Then he said: 'The times of prayer one between those two (limits).'\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:526", "inBookReference": "Book 6, Hadith 33"}, {"id": 34, "hadithNumber": "527", "text": "It was narrated that Muhammad bin 'Amr bin Hasan said: \"Al-Hajjaj arrived, and we asked Jabir bin 'Abdullah, who said: 'The Messenger of Allah (ﷺ) prayed Zuhr at the time of intense heat, [1] and 'Asr when the sun was white and clear, and Maghrib when the sun set, and with 'Isha' it would depend - if he saw that the people had gathered, he would pray early, and if he saw that they had not come yet, he would delay it.'\"\n\n[1] Meaning, at the earliest time.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Muhammad bin 'Amr bin Hasan said:", "reference": "https://sunnah.com/nasai:527", "inBookReference": "Book 6, Hadith 34"}, {"id": 35, "hadithNumber": "528", "text": "It was narrated that An-Nu'man bin Bashir said: \"I am the most knowledgeable of people about the time of the 'Isha' prayer. The Prophet (ﷺ) used to pray it when the moon set on the third night of the month.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that An-Nu'man bin Bashir said:", "reference": "https://sunnah.com/nasai:528", "inBookReference": "Book 6, Hadith 35"}, {"id": 36, "hadithNumber": "529", "text": "It was narrated that An-Nu'man bin Bashir said: \"By Allah, I am the most knowledgeable of people about the time of the 'Isha' prayers. The Prophet (ﷺ) used to pray it when the moon set on the third night of the month.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that An-Nu'man bin Bashir said:", "reference": "https://sunnah.com/nasai:529", "inBookReference": "Book 6, Hadith 36"}, {"id": 37, "hadithNumber": "530", "text": "Sayyar bin Salamah said: \"My father and I entered upon Abu Barzah, and my father said to him: 'How did the Messenger of Allah (ﷺ) pray the prescribed prayers?' He said: He used to pray Zuhr, which you call Al-Uala (the first) when the sun passed its zenith; he used to pray 'Asr then one of us could go back to his home in the farthest part of Al-Madinah when the sun was still bright.'\" - He said: \"I forgot what he said to me about Maghrib.\" - \"And he used to like to delay 'Isha', which you call Al-'Atamah, and he did not like to sleep before it nor speak after it. And he used to finish the Al-Ghadah (Fajr) prayer when a man could recognize his neighbor, and he used to recite between sixty and one hundred verses.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:530", "inBookReference": "Book 6, Hadith 37"}, {"id": 38, "hadithNumber": "531", "text": "It was narrated that Ibn Juraij said: \"I said to 'Ata': 'What is the best time you think I should pray Al-'Atamah, either in congregation or on my own?' He said: 'I heard Ibn 'Abbas say: \"The Messenger of Allah (ﷺ) delayed Al-'Atamah one night until the people had slept and woken up, then slept and woken up again. Then 'Umar got up and said: 'The prayer, the prayer!'\" 'Ata' said: 'Ibn 'Abbas said: \"The Messenger of Allah (ﷺ) came out, and it is as if I can see him now, with water dripping from his head, putting his hand on the side of his head. [He said: \"And he indicated (how)\"].'\" I checked with 'Ata' how the Prophet (ﷺ) put his hand on his head, and he showed me the same way as Ibn 'Abbas had done. 'Ata' spread his fingers a little, then placed them with the tips of his fingers on his forehead, then he drew his fingers together on his head until his thumb touched the edge of the ear that is next to the face, then moved it to his temple and forehead, then he said: 'Were it not that I would impose too much difficulty for my Ummah, I would have commanded them to offer this prayer only at this time.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Juraij said:", "reference": "https://sunnah.com/nasai:531", "inBookReference": "Book 6, Hadith 38"}, {"id": 39, "hadithNumber": "532", "text": "It was narrated that Ibn 'Abbas said: \"The Prophet (ﷺ) delayed 'Isha' one night until part of the night had passed. Then 'Umar, may Allah be pleased with him, got up and called out: 'The prayer, O Messenger of Allah! The women and children have gone to sleep.' Then the Messenger of Allah (ﷺ) came out with water dripping from his head, saying: 'This is (the best) time (for 'Isha'), were it not that this would be too difficult for my Ummah.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:532", "inBookReference": "Book 6, Hadith 39"}, {"id": 40, "hadithNumber": "533", "text": "It was narrated that Jabir bin Samurah said: \"The Messenger of Allah (ﷺ) used to delay the later 'Isha'.\"[1]\n\n[1] It is described as the later 'Isha' prayer because the Maghrib prayer is sometimes called 'Isha' prayer, but it is the first 'Isha'. Some scholars are of the opinion that it is disliked to call Maghrib 'Isha' without qualifying it as the first 'Isha'. See Fath Al-Bari.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin Samurah said:", "reference": "https://sunnah.com/nasai:533", "inBookReference": "Book 6, Hadith 40"}, {"id": 41, "hadithNumber": "534", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Were it not that I would impose too much difficulty on my Ummah, I would have commanded them to delay 'Isha' and to use the Siwak for every prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:534", "inBookReference": "Book 6, Hadith 41"}, {"id": 42, "hadithNumber": "535", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah (ﷺ) delayed A;-'Atamah one night, and 'Umar, may Allah be pleased with him, called out to him: 'The women and children have gone to sleep.' The Messenger of Allah (ﷺ) came out and said: 'No one is waiting for it except you.' At that time no prayer was offered except in Al-Madinah. Then he said: 'Pray it between the time when the twilight disappears and when one-third of the night has passed.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:535", "inBookReference": "Book 6, Hadith 42"}, {"id": 43, "hadithNumber": "536", "text": "It was narrated that 'Aishah the Mother of the Believers said: \"The Prophet (ﷺ) delayed the prayer one night until most of the night had passed and the people in the Masjid had gone home to sleep, then he went out and prayed, and said: 'This is indeed its (prayer) time, were it not that I would impose too much difficulty on my Ummah.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah the Mother of the Believers said:", "reference": "https://sunnah.com/nasai:536", "inBookReference": "Book 6, Hadith 43"}, {"id": 44, "hadithNumber": "537", "text": "It was narrated that Ibn 'Umar said: \"We stayed in the Masjid one night waiting for the Messenger of Allah (ﷺ) to pray 'Isha'. He came out to us when one-third of the night or more had passed, and he said when he came out: 'You are waiting for a prayer for which the followers of no other religion are waiting. Were it not that I would impose too much difficulty on my Ummah, I would have led them in prayer at this time.' Then he commanded the Mu'adhdhin to say the Iqamah and he prayed.\"", "grade": null, "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:537", "inBookReference": "Book 6, Hadith 44"}, {"id": 45, "hadithNumber": "538", "text": "It was narrated that Abu Sa'eed Al-Khudri said: \"The Messenger of Allah (ﷺ) led us in Maghrib prayer, then he did not come out to us until half the night had passed. Then he came out and led them in prayer, then he said: 'The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the prayer. Were it not for the weakness of the weak and, the sickness of the sick, I would have commanded that this prayer be delayed until halfway through the night.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Sa'eed Al-Khudri said:", "reference": "https://sunnah.com/nasai:538", "inBookReference": "Book 6, Hadith 45"}, {"id": 46, "hadithNumber": "539", "text": "Humaid said: \"Anas was asked: 'Did the Prophet (ﷺ) use a ring?' He said: 'Yes. One night he delayed the later 'Isha' prayer, until almost halfway through the night. When he prayed the Prophet (ﷺ) turned his face toward us and said: 'You are still in a state of prayer so long as you waiting for it.'\" Anas said: 'It is as if I can see the luster of his ring.' According to the narration of 'Ali - that is, Ibn Hujr - \"until halfway through the night.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:539", "inBookReference": "Book 6, Hadith 46"}, {"id": 47, "hadithNumber": "540", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"If the people knew what (virtue) there was in the call to prayer and the first row, and they not find any way to get to do that [1] other than by drawing lots, they would do that. If they knew what (virtue) there was in coming early to prayer, they would compete to be first in the Masjid. If they knew what (virtue) there was in Al-'Atamah and Subh, they would come to them even if they had to crawl.\"\n\n[1] Indicating the two mentioned items: that is the call to prayer and praying in the first row.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:540", "inBookReference": "Book 6, Hadith 47"}, {"id": 48, "hadithNumber": "541", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (ﷺ) said: 'Do not let the Bedouin make you change the name of this prayer of yours, for they delay the prayer until it is very dark because of their preoccupation with camels and milking them. Verily, it is 'Isha'.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:541", "inBookReference": "Book 6, Hadith 48"}, {"id": 49, "hadithNumber": "542", "text": "It was narrated that Ibn 'Umar said: \"I heard the Messenger of Allah (ﷺ) say on the Minbar: 'Do not let the Bedouin make you change the name of your prayer; verily, it is 'Isha'.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:542", "inBookReference": "Book 6, Hadith 49"}, {"id": 50, "hadithNumber": "543", "text": "Ja'far bin Muhammad bin 'Ali bin Al-Husain narrated from his father, that Jabir bin 'Abdullah said: \"The Messenger of Allah (ﷺ) prayed Subh as soon as he was certain the dawn had appeared.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:543", "inBookReference": "Book 6, Hadith 50"}, {"id": 51, "hadithNumber": "544", "text": "Humaid narrated from Ans that a man came to the Prophet (ﷺ) and asked him about the time of the Subh prayer. The following morning he commanded that the Iqamah for prayer be said when dawn broke, and he led us in prayer. The next day when there was light he commanded that the Iqamah for prayer be said and he led us in prayer. Then he said: \"Where is the one who was asking about the time for prayer? (It is) between these two times.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:544", "inBookReference": "Book 6, Hadith 51"}, {"id": 52, "hadithNumber": "545", "text": "It was narrated that 'Aishah said: \"When the Messenger of Allah (ﷺ) has prayed Subh, the women would depart, wrapped in their wrappers, unrecognizable because of the darkness.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:545", "inBookReference": "Book 6, Hadith 52"}, {"id": 53, "hadithNumber": "546", "text": "It was narrated that 'Aishah said: \"The women used to pray Subh with the Messenger of Allah (ﷺ), wrapped in their wrappers, then they would return, and no one would recognize them because of the darkness.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:546", "inBookReference": "Book 6, Hadith 53"}, {"id": 54, "hadithNumber": "547", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) prayed Fajr on the day of Khaibar during the time it was still dark, when he was near the enemy. Then he attacked them and said: 'Allahu Akbar! Khaibar is destroyed!' Twice. 'Then, when it descends in their courtyard, evil will be the morning for those who had been warned!'\" [1]\n\n[1] As-Saffat 37:177", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:547", "inBookReference": "Book 6, Hadith 54"}, {"id": 55, "hadithNumber": "548", "text": "It was narrated from Rafi' bin Khadij that the Prophet (ﷺ) said: \"Pray Fajr when the dawn shines.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Rafi' bin Khadij that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:548", "inBookReference": "Book 6, Hadith 55"}, {"id": 56, "hadithNumber": "549", "text": "It was narrated from Mahmud bin Labid, from some men among his people who were of the Ansar, that the Messenger of Allah (ﷺ) said: \"The more you delay Fajr, the greater the reward.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:549", "inBookReference": "Book 6, Hadith 56"}, {"id": 57, "hadithNumber": "550", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever catches up with a prostration of Subh before the sun rises, then he has caught up with it; and whoever catches up with a prostration of 'Asr before the sun sets, then he has caught up with it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:550", "inBookReference": "Book 6, Hadith 57"}, {"id": 58, "hadithNumber": "551", "text": "It was narrated from 'Aishah that the Prophet (ﷺ) said: \"Whoever catches up with a Rak'ah of Fajr before the sun rises, then he has caught up with it; and whoever catches up with a Rak'ah of 'Asr before the sun sets, then he has caught up with it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Aishah that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:551", "inBookReference": "Book 6, Hadith 58"}, {"id": 59, "hadithNumber": "552", "text": "It was narrated that Anas bin Malik said: \"The Messenger of Allah (ﷺ) used to pray Zuhr when the sun passed its zenith, and he would pray 'Asr between these two prayers; and he would pray Maghrib when the sun had set, and he used to pray 'Isha' when the twilight had disappeared,\" then he said straight after that: \"And he would pray Fajr when a man could see clearly.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas bin Malik said:", "reference": "https://sunnah.com/nasai:552", "inBookReference": "Book 6, Hadith 59"}, {"id": 60, "hadithNumber": "553", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Whoever catches up with a Rak'ah of the prayer, then he has caught up with the prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:553", "inBookReference": "Book 6, Hadith 60"}, {"id": 61, "hadithNumber": "554", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Whoever catches up with a Rak'ah of the prayer, then he has caught up with it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:554", "inBookReference": "Book 6, Hadith 61"}, {"id": 62, "hadithNumber": "555", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever catches up with a Rak'ah of the prayer, then he has caught up with the prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:555", "inBookReference": "Book 6, Hadith 62"}, {"id": 63, "hadithNumber": "556", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'Whoever catches up with a Rak'ah of the prayer has caught up with it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:556", "inBookReference": "Book 6, Hadith 63"}, {"id": 64, "hadithNumber": "557", "text": "It was narrated from Salim, from his father, that the Prophet (ﷺ) said: \"Whoever catches up with with a Rak'ah of Jumu'ah or any other (prayer), his prayer is complete.\"", "grade": null, "narratedBy": "It was narrated from Salim, from his father, that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:557", "inBookReference": "Book 6, Hadith 64"}, {"id": 65, "hadithNumber": "558", "text": "It was narrated from Salim that the Messenger of Allah (ﷺ) said: \"Whoever catches up with a Rak'ah of one of the prayers has caught up with it, except that he has to make up the portion that he missed.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:558", "inBookReference": "Book 6, Hadith 65"}, {"id": 66, "hadithNumber": "559", "text": "It was narrated from 'Abdullah As-Sunabihi that the Messenger of Allah (ﷺ) said: \"The sun rises and with it the horn of the Shaitan, then when it is fully risen, he goes away. Then when it approaches the meridian he comes near to it, and when it has passed the zenith he goes away. Then when it is close to setting, he comes near to it, then when it has set, he goes away.\" And the Messenger of Allah (ﷺ) forbade praying at those times.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah As-Sunabihi that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:559", "inBookReference": "Book 6, Hadith 66"}, {"id": 67, "hadithNumber": "560", "text": "It was narrated that Musa bin 'Ali bin Rabah said: \"I heard my father say: 'I heard 'Uqbah bin 'Amir Al-Juhani say: There are three times during which the Messenger of Allah (ﷺ) forbade us to pray in or bury our dead: When the sun has clearly stated to rise, until it is fully risen; when it is directly overhead at noon, until it has passed its zenith; and when it is close to setting, until it has fully set.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Musa bin 'Ali bin Rabah said:", "reference": "https://sunnah.com/nasai:560", "inBookReference": "Book 6, Hadith 67"}, {"id": 68, "hadithNumber": "561", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) forbade praying after 'Asr until the sun had set, and after Subh until the sun had risen.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:561", "inBookReference": "Book 6, Hadith 68"}, {"id": 69, "hadithNumber": "562", "text": "It was narrated that Ibn 'Abbas said: \"I heard more than one of the Companions of the Prophet (ﷺ) - including 'Umar who was one of the dearest of them to me - that the Messenger of Allah (ﷺ) forbade praying after Fajr until the sun had risen, and praying after 'Asr until the sun had set.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:562", "inBookReference": "Book 6, Hadith 69"}, {"id": 70, "hadithNumber": "563", "text": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"No one of you should deliberately try to pray when the sun is rising, or when it is setting.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:563", "inBookReference": "Book 6, Hadith 70"}, {"id": 71, "hadithNumber": "564", "text": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) forbade praying when the sun is rising or setting.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:564", "inBookReference": "Book 6, Hadith 71"}, {"id": 72, "hadithNumber": "565", "text": "It was narrated from Musa bin 'Ali that his father said: \"I heard 'Uqbah bin 'Amir say: 'There are three times during which the Messenger of Allah (ﷺ) forbade us from praying or burying our dead: When the sun had clearly started to rise until it was fully risen, when it was directly overhead at noon until it has passed the zenith, and when it was close to setting until it had fully set.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Musa bin 'Ali that his father said:", "reference": "https://sunnah.com/nasai:565", "inBookReference": "Book 6, Hadith 72"}, {"id": 73, "hadithNumber": "566", "text": "It was narrated from Damrah bin Sa'eed that he heard Abu Sa'eed Al-Khudri say: \"The Messenger of Allah (ﷺ) forbade praying after Subh until the sun had risen, and praying after 'Asr until the sun had set.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Damrah bin Sa'eed that he heard Abu Sa'eed Al-Khudri say:", "reference": "https://sunnah.com/nasai:566", "inBookReference": "Book 6, Hadith 73"}, {"id": 74, "hadithNumber": "567", "text": "It was narrated from 'Ata' bin Yazid that he heard Abu Sa'eed Al-Khudri say: \"I heard the Messenger of Allah (ﷺ) say: 'There is no prayer after Fajr until the sun has clearly risen, and no prayer after 'Asr until the sun has fully set.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Ata' bin Yazid that he heard Abu Sa'eed Al-Khudri say:", "reference": "https://sunnah.com/nasai:567", "inBookReference": "Book 6, Hadith 74"}, {"id": 75, "hadithNumber": "568", "text": "(Another chain) from Abu Sa'eed Al-Khudri, from the Messenger of Allah (ﷺ) with a similar report.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:568", "inBookReference": "Book 6, Hadith 75"}, {"id": 76, "hadithNumber": "569", "text": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) forbade praying after 'Asr.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:569", "inBookReference": "Book 6, Hadith 76"}, {"id": 77, "hadithNumber": "77", "text": "It was narrated from Ibn Tawus that his father said: \"'Aishah, may Allah be please with her, said: 'Umar, may Allah be please with him, is not correct, rather the Messenger of Allah (ﷺ) only prohibited, as he said: 'Do no deliberately seek to pray when the sun is rising or when it is setting, for it rises between the horns of a Shaitan.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn Tawus that his father said:", "reference": "https://sunnah.com/nasai:", "inBookReference": "Book 6, Hadith 77"}, {"id": 78, "hadithNumber": "571", "text": "Ibn 'Umar said: \"The Messenger of Allah (ﷺ) said: 'When the edge of the sun rises, then delay prayer until it has fully risen, and when the edge of the sun starts to set, delay prayer until it has fully set.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:571", "inBookReference": "Book 6, Hadith 78"}, {"id": 79, "hadithNumber": "572", "text": "Abu Yahya Sulaim bin 'Amir, Damrah bin Habib and Abu Talhah Nu'aim bin Ziyad said: \"We heard Abu Umamah Al-Bahili say: 'I heard 'Amrah bin 'Abasah say: I said: 'O Messenger of Allah, is there any moment which brings one close to Allah than another, or any moment that should be sought out for remembering Allah? He said: 'Yes, the closest that the Lord is to His slave is in the last part of the night, so if you can be among those who remember Allah at that time, then do so. For prayer is attended and witnessed (by the angels) until the sun rises, then it rises between the two horns of the Shaitan, that is the time when the disbelievers pray, so do not pray until the sun had risen to the height of a spear and its rays have disappeared. Then prayer is attended and witness (by the angels) until the sun is directly overhead at midday, and that is the time when the gates of Hell are opened and it is stoked up. So do not pray until the shadows appear. Then prayer is attended and witnessed (by angels) until the sun sets, and it sets between the horns of a Shaitan, and that is the time when the disbelievers pray.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:572", "inBookReference": "Book 6, Hadith 79"}, {"id": 80, "hadithNumber": "573", "text": "It was narrated that 'Ali said: \"The Messenger of Allah (ﷺ)forbade praying after 'Asr unless the sun was still white, clear and high.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Ali said:", "reference": "https://sunnah.com/nasai:573", "inBookReference": "Book 6, Hadith 80"}, {"id": 81, "hadithNumber": "574", "text": "It was narrated that Hisham said: \"My father told me: 'Aishah said: 'The Messenger of Allah (ﷺ) never neglected to pray two Rak'ahs after 'Asr in my house.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hisham said:", "reference": "https://sunnah.com/nasai:574", "inBookReference": "Book 6, Hadith 81"}, {"id": 82, "hadithNumber": "575", "text": "It was narrated that Al-Aswad said: 'Aishah said: \"The Messenger of Allah (ﷺ) never entered upon me after 'Asr but he prayed them (the two Rak'ahs).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Al-Aswad said:", "reference": "https://sunnah.com/nasai:575", "inBookReference": "Book 6, Hadith 82"}, {"id": 83, "hadithNumber": "576", "text": "It was narrated that Abu Ishaq said: \"I heard Masruq and Al-Aswad say: We bear witness that 'Aishah said: 'When the Messenger of Allah (ﷺ) was with me after 'Asr, he would pray them (these two Rak'ahs).'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Ishaq said:", "reference": "https://sunnah.com/nasai:576", "inBookReference": "Book 6, Hadith 83"}, {"id": 84, "hadithNumber": "577", "text": "It was narrated that 'Aishah said: \"There are two prayers that the Messenger of Allah (ﷺ) never neglected to pray them in my house secretly nor publicly: Two Rak'ahs before Fajr and two Rak'ahs after 'Asr.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:577", "inBookReference": "Book 6, Hadith 84"}, {"id": 85, "hadithNumber": "578", "text": "It was narrated from Abu Salamah that he asked 'Aishah about the two prostrations (Rak'ahs) that the Messenger of Allah (ﷺ) used to pray after 'Asr. She said: \"He used to pray them before 'Asr, but if he got distracted or forgot them, he would pray them after 'Asr, and if he did a prayer he would be constant in it.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:578", "inBookReference": "Book 6, Hadith 85"}, {"id": 86, "hadithNumber": "579", "text": "It was narrated from Umm Salamah that the Prophet (ﷺ) once prayed two Rak'ahs after 'Asr in her house. She asked him about that and he said: \"They are two Rak'ahs that I used to pray after Zuhr, but I got distracted and forgot them until I prayed 'Asr.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:579", "inBookReference": "Book 6, Hadith 86"}, {"id": 87, "hadithNumber": "580", "text": "It was narrated that Umm Salamah said: \"The Messenger of Allah (ﷺ) got distracted and did not pray the two Rak'ahs before 'Asr so he prayed them after 'Asr.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Umm Salamah said:", "reference": "https://sunnah.com/nasai:580", "inBookReference": "Book 6, Hadith 87"}, {"id": 88, "hadithNumber": "581", "text": "'Imran bin Hudair said: \"I asked Lahiq about the two Rak'ahs before sunset. He said: \"Abdullah bin Az-Zubair used to pray them, and Mu'awiyah sent word to him asking: 'What are these two Rak'ahs at sunset?' He had to refer to Umm Salamah, and Umm Salamah said: 'The Messenger of Allah (ﷺ) used to pray two Rak'ahs before 'Asr, then he was distracted and did not pray them, so he prayed them when the sun set, and I never saw him pray them before or after that.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:581", "inBookReference": "Book 6, Hadith 88"}, {"id": 89, "hadithNumber": "582", "text": "It was narrated from Yazid bin Abi Habib that Abu Al-Khair told him: \"Abu Tamim Al-Jaishani stood up to pray two Rak'ahs before Maghrib, and I said to 'Uqbah bin 'Amir: 'Look at this man, what prayer is he praying?' He turned and looked at him, and said: 'This is a prayer that we used to pray at the time of the Messenger of Allah (ﷺ).'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Yazid bin Abi Habib that Abu Al-Khair told him:", "reference": "https://sunnah.com/nasai:582", "inBookReference": "Book 6, Hadith 89"}, {"id": 90, "hadithNumber": "583", "text": "It was narrated from Ibn 'Umar that Hafsah said: \"When the dawn appears, the Messenger of Allah (ﷺ) would only pray two short Rak'ahs.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that Hafsah said:", "reference": "https://sunnah.com/nasai:583", "inBookReference": "Book 6, Hadith 90"}, {"id": 91, "hadithNumber": "584", "text": "It was narrated that 'Amr bin 'Abasah said: \"I came to the Messenger of Allah, who became Muslim with you?' He said: 'Free men and slaves.' I said: 'Is there any moment which brings one closer to Allah than another?' He said: 'Yes, the last part of the night, so pray as much as you want until you pray Subh, then stop until the sun has risen until and it looks like a shield and (its shinning)spreads. Then pray as much as you want until an object's shadow is at its shortest, then stop until the sun passes its zenith, for Hell is stoked at midday. Then pray 'Asr, then stop until you pray 'Asr, then stop until the sun has set, for it sets between the horns of a Shaitan and rises between the horns of a Shaitan.'\" [1]\n\n[1] Similar has been recorded by Muslim.", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that 'Amr bin 'Abasah said:", "reference": "https://sunnah.com/nasai:584", "inBookReference": "Book 6, Hadith 91"}, {"id": 92, "hadithNumber": "585", "text": "It was narrated from Jubair bin Mut'im that the Prophet (ﷺ) said: \"O Banu 'Abd Manaf, do not prevent anyone from circumambulating this House and praying at any time he wants of night or day.\"", "grade": null, "narratedBy": "It was narrated from Jubair bin Mut'im that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:585", "inBookReference": "Book 6, Hadith 92"}, {"id": 93, "hadithNumber": "586", "text": "It was narrated that Anas bin Malik said: \"If the Messenger of Allah (ﷺ) was setting out on a journey before the sun passed its zenith, he would delay Zuhr until the time of 'Asr, then he would stop and combine the prayer. If the sun passed its zenith before he set out, he would pray Zuhr and then set off.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas bin Malik said:", "reference": "https://sunnah.com/nasai:586", "inBookReference": "Book 6, Hadith 93"}, {"id": 94, "hadithNumber": "587", "text": "It was narrated from Abu At-Tufail 'Amir bin Wathilah that Mu'adh bin Jabal told him that they went out with the Messenger of Allah (ﷺ) in the year of Tabuk, and the Messenger of Allah (ﷺ) was joining Zuhr and 'Asr, and Maghrib and 'Isha'. He delayed the prayer one day then he went out and prayed Zuhr and 'Asr together, then he went in and came out again and prayed Maghrib and 'Isha'.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:587", "inBookReference": "Book 6, Hadith 94"}, {"id": 95, "hadithNumber": "588", "text": "Kathir bin Qarawanda said: \"I asked Salim bin 'Abdullah about how his father prayed when traveling. We asked him: 'Did he combine any of his prayers when traveling?' He said that Safiyyah bint Abi 'Ubaid was married to him, and she wrote to him, when he was at some farmland of his, saying: 'This is the last of my days in this world, and the first day of the Hereafter.\" [1] He rode quickly to go to her, and when the time for Zuhr came, the Mu'adhdhin said to him: \"The prayer, O Abu 'Abdur-Rahman!\" But he paid no attention to him until it was between the time for the two prayers, then he stopped and said: \"Say the Iqamah and when I say the Taslim, say the Iqamah.\" Then he rode on again, and when the sun set the Mu'adhdhin said to him; \"The prayer!\" He said: \"Do as you did for Zuhr and 'Asr.\" When the stars had appeared, he stopped and said to the Mu'adhdhin: \"Say the Iqamah and when I say the Taslim, say the Iqamah.\" He prayed, then when he had finished he turned to us and said: \"The Messenger of Allah (ﷺ) said: 'If any one of you has an urgent need that he fears he may miss, let him pray like this.'\"\n\n[1] Meaning that she was dying.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:588", "inBookReference": "Book 6, Hadith 95"}, {"id": 96, "hadithNumber": "589", "text": "It was narrated that Ibn 'Abbas said: \"I prayed with the Prophet (ﷺ) in Al-Madinah, eight  together and seven together. He delayed Zuhr and brought 'Asr forward, and he delayed Maghrib and brought 'Isha' forward.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:589", "inBookReference": "Book 6, Hadith 96"}, {"id": 97, "hadithNumber": "590", "text": "It was narrated from Ibn 'Abbas that he prayed Al-Uula (Zuhr) and 'Asr together in Al-Basrah with nothing in between them, and he prayed Maghrib and 'Isha' together with nothing in between them. He did that because he was busy and Ibn 'Abbas said that he had prayed Zuhr and 'Isha' together with the Messenger of Allah (ﷺ) in Al-Madinah, eight Rak'ahs with nothing in between.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:590", "inBookReference": "Book 6, Hadith 97"}, {"id": 98, "hadithNumber": "591", "text": "It was narrated that Isma'il bin 'Abdur-Rahman, a Shaikh of the Quraish, said: \"I accompanied Ibn 'Umar to Al-Hima. [1] When the sun set I felt too nervous to remind him of the prayer, so he went on until the light on the horizon had disappeared and it was getting dark, then he stopped and prayed Maghrib, three Rak'ahs, then he prayed two Rak'ahs immediately afterwards, then he said: 'This what I saw the Messenger of Allah (ﷺ) do.'\"\n\n[1] A place near Madinah.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Isma'il bin 'Abdur-Rahman, a Shaikh of the Quraish, said:", "reference": "https://sunnah.com/nasai:591", "inBookReference": "Book 6, Hadith 98"}, {"id": 99, "hadithNumber": "592", "text": "It was narrated that Az-Zuhri said: \"Salim told me that his father said: 'I saw the Messenger of Allah (ﷺ), when he was in a hurry to travel, delaying Maghrib so that he could combine it with 'Isha'.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Az-Zuhri said:", "reference": "https://sunnah.com/nasai:592", "inBookReference": "Book 6, Hadith 99"}, {"id": 100, "hadithNumber": "593", "text": "It was narrated that Jabir said: \"The sun set when the Messenger of Allah (ﷺ) was in Makkah, and he joined the two prayers in Sarif.: [1]\n\n[1] A valley about 12 km northeast of Makkah on the way to Al-Madinah.", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:593", "inBookReference": "Book 6, Hadith 100"}, {"id": 101, "hadithNumber": "594", "text": "It was narrated from Anas that the Messenger of Allah (ﷺ) said: \"If the Messenger of Allah (ﷺ) wanted to travel quickly, he would delay Zuhr until the time of 'Asr and combine them, and he would delay Maghrib until he combined it with 'Isha' when the twilight had disappeared.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated from Anas that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:594", "inBookReference": "Book 6, Hadith 101"}, {"id": 102, "hadithNumber": "595", "text": "Nafi' said: \"I went out with 'Abdullah bin 'Umar on a journey to some of his land. Then someone came to him and said: 'Safiyyah bint Abi 'Ubaid is sick, try to get there before it is too late.' He set out quickly, accompanied by a man of the Quraish. The sun set but he did not pray, although I knew him to be very careful about praying on time. When he slowed down I said: 'The prayer, may Allah have mercy on you.' He turned to me but carried on until the twilight was almost gone, then he stopped and prayed Maghrib, then he said the Iqamah for 'Isha', at that time the twilight had totally disappeared and led us in prayer. Then he turned to us and said: 'If the Messenger of Allah (ﷺ) was in a hurry to travel he would do this.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:595", "inBookReference": "Book 6, Hadith 102"}, {"id": 103, "hadithNumber": "596", "text": "It was narrated that Nafi' said: \"We came back with Ibn 'Umar from Makkah. One night he kept on travelling until evening came, and we thought that he had forgotten the prayer!' But he kept quiet and kept going until the twilight had almost disappeared, then he stopped and prayed, and when the twilight disappeared he prayed 'Isha'. Then he turned to us and said: This is what we used to do with the Messenger of Allah (ﷺ) if he was in a hurry to travel.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Nafi' said:", "reference": "https://sunnah.com/nasai:596", "inBookReference": "Book 6, Hadith 103"}, {"id": 104, "hadithNumber": "597", "text": "Kathir bin Qarawanda said: \"We asked Salim bin 'Abdullah about prayer while traveling. We said: 'Did 'Abdullah combine any of his prayer while traveling?' He said: 'No, except at Jam'.'[1] Then he paused, and said: 'Safiyyah was married to him, and she sent word to him that she was in her last day in this world and the first day in the Hereafter. So he ride off in a hurry, and I was with him. The time for prayer came and the Mu'adhdhin said to him: 'The prayer, O Abu 'Abdur-Rahman! But he kept going until it was between the time for the two prayer. Then he stopped and said to the Mu'adhdhin: \"Say the Iqamah, and when I say the Taslim at the end of Zuhr, say the Iqamah (again) straight away.\" So he said the Iqamah and he prayed Zuhr, two Rak'ahs, then he said the Iqamah (again) straight away, and he prayed 'Asr, two Rak'ahs. Then he rode off quickly until the sun set and the Mu'adhdhin said to him: \"The prayer, O Abu 'Abdur-Rahman!\" He said: \"Do what you did before.\" He rode on until the starts appeared, then he stopped and said: \"Say the Iqamah, then when I say the Taslim, say the Iqamah. So he said the Iqamah and he prayed Maghrib, three Rak'ahs, then he said the Iqamah (again) straight away and he prayed 'Isha', then he said one Taslim, turning his face. Then he said: \"The Messenger of Allah (ﷺ) said: 'If any one of you has urgent need that he fears he may miss, let him pray like this.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:597", "inBookReference": "Book 6, Hadith 104"}, {"id": 105, "hadithNumber": "598", "text": "It was narrated from Ibn 'Umar that if the Messenger of Allah (ﷺ) was in a hurry to travel, he would combine Maghrib and 'Isha'.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:598", "inBookReference": "Book 6, Hadith 105"}, {"id": 106, "hadithNumber": "599", "text": "It was narrated that Ibn 'Umar said: \"If the Messenger of Allah (ﷺ) was in a hurry to travel, or some emergency arose, he would combine Maghrib and 'Isha'.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:599", "inBookReference": "Book 6, Hadith 106"}, {"id": 107, "hadithNumber": "600", "text": "Sufyan said: \"I heard Az-Zuhri say: 'Salim told me that his father said: 'I saw the Prophet (ﷺ), if he was in a hurry to travel, joining Maghrib and 'Isha'.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:600", "inBookReference": "Book 6, Hadith 107"}, {"id": 108, "hadithNumber": "601", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah (ﷺ) prayed Zuhr and 'Asr together, and Maghrib and 'Isha' together, when there was no fear and he was not traveling.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:601", "inBookReference": "Book 6, Hadith 108"}, {"id": 109, "hadithNumber": "602", "text": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) used to pray in Al-Madinah combining two prayer. Joining Zuhr and 'Asr, and Maghrib and 'Isha', when there was no fear nor rain. It was said to him: \"Why?\" He said: \"So that there would not be any hardship on his Ummah.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:602", "inBookReference": "Book 6, Hadith 109"}, {"id": 110, "hadithNumber": "603", "text": "It was narrated that Ibn 'Abbas said: \"I prayed behind the Messenger of Allah (ﷺ) eight (Rak'ahs) together and seven (Rak'ahs) together.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:603", "inBookReference": "Book 6, Hadith 110"}, {"id": 111, "hadithNumber": "604", "text": "Ja'far bin Muhammad narrated from his father that Jabir bin 'Abdullah said: \"The Messenger of Allah (ﷺ) traveled until he came to 'Arafah, where he found that the tent had pitched for him. He stayed there until the sun had passed its zenith, then he called for Al-Qaswa' which was saddled for him. When he reached the bottom of the valley he addressed the people. Then Bilal called the Adhan, then the Iqamah, then he prayed Zuhr, then he called the Iqamah, then he prayed 'Asr, and he did not offer any other prayer in between.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:604", "inBookReference": "Book 6, Hadith 111"}, {"id": 112, "hadithNumber": "605", "text": "It was narrated from 'Abdullah bin Yazid that Abu Ayyub Al-Ansari told him, that during the Farewell Pilgrimage. He prayed with the Messenger of Allah (ﷺ) Maghrib and 'Isha' prayers together at Al-Muzdalifah.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:605", "inBookReference": "Book 6, Hadith 112"}, {"id": 113, "hadithNumber": "606", "text": "It was narrated that Sa'eed bin Jubair said: \"I was with Ibn 'Umar when he departed from 'Arafah. When he came to Jam' (Al-Muzdalifah), he combined Maghrib and 'Isha', and when he finished he said: 'The Messenger of Allah (ﷺ) did similar to this in this place.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Sa'eed bin Jubair said:", "reference": "https://sunnah.com/nasai:606", "inBookReference": "Book 6, Hadith 113"}, {"id": 114, "hadithNumber": "607", "text": "It was narrated from Ibn 'Umar that the Prophet (ﷺ) prayed Maghrib and 'Isha' at Al-Muzdalifah.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:607", "inBookReference": "Book 6, Hadith 114"}, {"id": 115, "hadithNumber": "608", "text": "It was narrated that 'Abdullah said: \"I never saw the Messenger of Allah (ﷺ) combine any two prayers except in Al-Muzdalifah, and on that day he prayed Subh before its time.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah said:", "reference": "https://sunnah.com/nasai:608", "inBookReference": "Book 6, Hadith 115"}, {"id": 116, "hadithNumber": "609", "text": "It was narrated from Usamah bin Zaid, whom the Prophet (ﷺ) had seated behind him on his camel on the way from 'Arafah, that when he reached the mountain pass, he dismounted and urinated - and he did not say that he passed water. He (Usamah) said: \"I poured water for him from a small vessel and he performed a light Wudu'. I said to him: 'The prayer.' He said: 'The prayer is still ahead of you.' When he came to Al-Muzdalifah he prayed Maghrib, then they untied the saddles of their mounts and then he prayed 'Isha'.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:609", "inBookReference": "Book 6, Hadith 116"}, {"id": 117, "hadithNumber": "610", "text": "Al-Walid bin Al'Ayzar said: \"I heard Abu 'Amr Ash-Shaibani say: 'The owner of this house - and he pointed to the house of 'Abdullah - said: I asked the Messenger of Allah (ﷺ): 'Which deed is most beloved to Allah, may He be exalted?' He said: 'Prayer offered on time, honoring one's parents, and Jihad in the cause of Allah.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:610", "inBookReference": "Book 6, Hadith 117"}, {"id": 118, "hadithNumber": "611", "text": "It was narrated that 'Abdullah bin Mas'ud said: \"I asked the Messenger of Allah (ﷺ) which action is most beloved to Allah? He said: 'Establishing prayer on time, honoring one's parents and Jihad in the cause of Allah.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin Mas'ud said:", "reference": "https://sunnah.com/nasai:611", "inBookReference": "Book 6, Hadith 118"}, {"id": 119, "hadithNumber": "612", "text": "It was narrated from Ibrahim bin Muhammad bin Al-Muntashir that his father was in the Masjid of 'Amr bin Shurahbil and the Iqamah for prayer was said, so they were waiting for him. He said: \"I was praying Witr, and 'Abdullah was asked: 'Is there any Witr after the Adhan?' He said: \"Yes, and after the Iqamah, and he narrated that the Prophet (ﷺ) slept and missed the prayer until the sun rose then prayed.'\" And the wording is that of Yahya.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:612", "inBookReference": "Book 6, Hadith 119"}, {"id": 120, "hadithNumber": "613", "text": "It was narrated that Anas said: The Messenger of Allah (ﷺ) said: \"Whoever forgets a prayer, let him pray it when he remembers it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:613", "inBookReference": "Book 6, Hadith 120"}, {"id": 121, "hadithNumber": "614", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) was asked about a man who slept and missed the prayer, or forgot it. He said: 'The expiation for that is to pray it when he remembers it.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:614", "inBookReference": "Book 6, Hadith 121"}, {"id": 122, "hadithNumber": "615", "text": "It was narrated that Abu Qatadah said: \"They told the Prophet (ﷺ) that they had slept and missed the prayer. He said: 'There is no negligence when one sleeps, rather negligence is when one is awake. If any one of you forgets a prayer or sleeps and misses it, let him pray it when he remembers it.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Qatadah said:", "reference": "https://sunnah.com/nasai:615", "inBookReference": "Book 6, Hadith 122"}, {"id": 123, "hadithNumber": "616", "text": "It was narrated that Abu Qatadah said: \"The Messenger of Allah (ﷺ) said: 'There is no negligence when one sleeps, rather negligence is when one does not offer one prayer until the time of the next prayer comes and he realizes that he has missed a prayer.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Qatadah said:", "reference": "https://sunnah.com/nasai:616", "inBookReference": "Book 6, Hadith 123"}, {"id": 124, "hadithNumber": "617", "text": "It was narrated from Abu Qatadah that when they missed the prayer because they slept until the sun rose, the Messenger of Allah (ﷺ) said: \"Let any one of you pray it during its time tomorrow.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:617", "inBookReference": "Book 6, Hadith 124"}, {"id": 125, "hadithNumber": "618", "text": "It was narrated that Abu Hurairah said: The Messenger of Allah (ﷺ) said: If you forget a prayer, pray it when you remember it, for Allah says: \"and perform the Salah for My remembrance.\" [1]\n\n[1] Ta-Ha 20:14.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:618", "inBookReference": "Book 6, Hadith 125"}, {"id": 126, "hadithNumber": "619", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Whoever forgets a prayer, let him pray it when he remembers it, for Allah says: and perform the Salah for My remembrance.\" [1]\n\n[1] Ta-Ha 20:14.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:619", "inBookReference": "Book 6, Hadith 126"}, {"id": 127, "hadithNumber": "620", "text": "It was narrated from Ma'mar, from Az-Zuhri, from Sa'eed bin Al-Musayyab, that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'Whoever forgets a prayer, let him pray it when he remembers it, for Allah says: \"and perform prayer when you remember (li dhikra).'\" I said to Az-Zuhri: \"Is that how the Messenger of Allah (ﷺ) recited it?\" He said: \"Yes.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ma'mar, from Az-Zuhri, from Sa'eed bin Al-Musayyab, that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:620", "inBookReference": "Book 6, Hadith 127"}, {"id": 128, "hadithNumber": "621", "text": "It was narrated from Buraid bin Abi Mariam that his father said: \"We were with the Messenger of Allah (ﷺ) on a journey, and we kept going one night, then when it was nearly morning the Messenger of Allah (ﷺ) dismounted and slept, and the people slept too. We did not wake up until the sun had risen. The Messenger of Allah (ﷺ) asked the Mu'adhdhin to call the Adhan, then he prayed the two Rak'ahs before Fajr, then he asked him to say the Iqamah, then he led the people in prayer. Then he told us about everything that will happen until the Hour begins.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Buraid bin Abi Mariam that his father said:", "reference": "https://sunnah.com/nasai:621", "inBookReference": "Book 6, Hadith 128"}, {"id": 129, "hadithNumber": "622", "text": "It was narrated that 'Abdullah bin Mas'ud said: \"We were with the Messenger of Allah (ﷺ) and we were prevented from praying Zuhr, 'Asr, Maghrib and 'Isha'. I felt very upset about that and I said to myself: 'We are with the Messenger of Allah (ﷺ) and (fighting) for the sake of Allah.' Then the Messenger of Allah (ﷺ) commanded Bilal to say the Iqamah and he led us in praying Zuhr. Then he said the Iqamah and he led us in praying 'Asr. Then he said the Iqamah and he led us in praying Maghrib. Then he said the Iqamah and he led us in praying 'Isha'. Then he went around among us and told us: 'There is no group on Earth who is remembering Allah, the Mighty and Sublime, except you.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin Mas'ud said:", "reference": "https://sunnah.com/nasai:622", "inBookReference": "Book 6, Hadith 129"}, {"id": 130, "hadithNumber": "623", "text": "It was narrated that Abu Hurairah said: \"We stopped to camp at the end of the night with the Messenger of Allah (ﷺ), and we did not wake up until the sun had risen. The Messenger of Allah (ﷺ) said: 'Let each man take hold of his camel's head (and leave), for the Shaitan was here in this place with us.' We did that, then he called for water and performed Wudu', then he prayed two Rak'ahs, then the Iqamah was said and he prayed Al-Ghadah (Fajr).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:623", "inBookReference": "Book 6, Hadith 130"}, {"id": 131, "hadithNumber": "624", "text": "It was narrated from Nafi' bin Jubair, from his father, that the Messenger of Allah (ﷺ) said during a journey: \"Who will watch out for dawn for us, so that we do not sleep and miss the dawn prayer?\" Bilal said: 'I will.' He turned to face the direction where the sun woke them up, then they got up. He said: 'Perform Wudu'.' Then Bilal called the Adhan and he prayed two Rak'ahs, and they prayed the two (Sunnah) Rak'ahs of Fajr, then they prayed Fajr.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:624", "inBookReference": "Book 6, Hadith 131"}, {"id": 132, "hadithNumber": "625", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah (ﷺ) set out at nightfall, then stopped to camp at the end of the night, and he did not wake up until the sun had risen or had partly risen. He did not pray until the sun had risen (fully), then he prayed, and that was the 'middle prayer' (Salat Al-Wusta).\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:625", "inBookReference": "Book 6, Hadith 132"}]}