{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 9, "bookName": "Chapter: Facing the Qibla", "hadiths": [{"id": 1, "hadithNumber": "742", "text": "Narrated Al Bara bin Azib: Al Bara bin Azib said: The messenger of Allah (peace be upon him) came to Al-Madinah and prayed toward Bait-al-Maqdis for sixteen months, then he was commanded to pray toward the Ka'bah. A man who had prayed with the prophet (peace be upon him)passed by some of the Ansar and said: \"I bear witness that the messenger of Allah (peace be upon him) has been commanded to face toward the Ka'bah. So they turned to face the Ka'bah\".", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Al Bara bin Azib:", "reference": "https://sunnah.com/nasai:742", "inBookReference": "Book 9, Hadith 1"}, {"id": 2, "hadithNumber": "743", "text": "It was narrated that Ibn Umar said: \"The messenger of Allah (peace be upon him) used to pray atop his mount while travelling, facing whatever direction it was facing.\" (One of the narrators) Malik said: \"Abdullah bin Dinar said: and Ibn Umar used to do likewise\".", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Umar said:", "reference": "https://sunnah.com/nasai:743", "inBookReference": "Book 9, Hadith 2"}, {"id": 3, "hadithNumber": "744", "text": "It was narrated that Abdullah said: \"The messenger of Allah (peace be upon him) used to pray atop his mount while traveling, facing whatever direction it was facing, and he would pray witr atop it, but he did not pray the prescribed prayers atop it \".", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abdullah said:", "reference": "https://sunnah.com/nasai:744", "inBookReference": "Book 9, Hadith 3"}, {"id": 4, "hadithNumber": "745", "text": "It was narrated that Ibn Umar said: \"While the people were in Quba praying Subh prayer, someone came to them and said that revelation had come to Messenger of Allah(ﷺ) the night before, and he had been commanded to face Ka'bah. So face toward it. They had been facing toward Ash-Sham, so they turned to face toward Ka'bah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Umar said:", "reference": "https://sunnah.com/nasai:745", "inBookReference": "Book 9, Hadith 4"}, {"id": 5, "hadithNumber": "746", "text": "It was narrated that Aisha(ra) said: \"The messenger of Allah(ﷺ) was asked during the campaign of Tabuk about the Sutra of one who is praying. He said: \"Something as high as the back of a camel saddle.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Aisha(ra) said:", "reference": "https://sunnah.com/nasai:746", "inBookReference": "Book 9, Hadith 5"}, {"id": 6, "hadithNumber": "747", "text": "Narrated Ibn Umar: It was narrated from Ibn Umar concerning the Messenger of Allah (ﷺ) he said: \"He used to set up a short spear then pray facing toward it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Ibn Umar:", "reference": "https://sunnah.com/nasai:747", "inBookReference": "Book 9, Hadith 6"}, {"id": 7, "hadithNumber": "748", "text": "It was narrated that Sahl bin Abi Hathmah said: \"When anyone of you prays toward a Sutra, let him get close to it and not allow the Shaitan to sever his prayer for him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Sahl bin Abi Hathmah said:", "reference": "https://sunnah.com/nasai:748", "inBookReference": "Book 9, Hadith 7"}, {"id": 8, "hadithNumber": "749", "text": "Narrated Abdullah bin Umar: It was narrated from Abdullah bin Umar that the Messenger of Allah (ﷺ) entered the Ka'bah with Usamah bin Zaid, Bilal and Uthman bin Talha  al Hajabi, and locked the door behind him. Abdullah bin Umar said: \"I asked Bilal when he came out: \" What did the Messenger of Allah (ﷺ) do?\" He said: \"He stood with one pillar to his left, two pillars to his right and three pillars behind him - at that time the House stood on six pillars - and he prayed with approximately three forearm's length between him and the wall.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abdullah bin Umar:", "reference": "https://sunnah.com/nasai:749", "inBookReference": "Book 9, Hadith 8"}, {"id": 9, "hadithNumber": "750", "text": "It was narrated that Abu Dharr said: The messenger of Allah(ﷺ) said: \"When anyone of you stands to pray, then he is screened if he has in front of him something as high as the back of a camel saddle. If he does not have something as high as the back of a camel saddle in front of him, then his prayer is nullified by a woman, a donkey or a black dog.\" I (one of the narrators)said: \"What is the difference between a black dog, a yellow one and a red one?\" He said: I asked the Messenger of Allah (ﷺ) just like you and he said:\"The black dog is a shaitan.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Dharr said:", "reference": "https://sunnah.com/nasai:750", "inBookReference": "Book 9, Hadith 9"}, {"id": 10, "hadithNumber": "751", "text": "It was narrated that Qatadah said: \"I aid to Jabir bin Zaid: \"What invalidates prayer?\" He said: \"Ibn Abbas used to say: A menstruating woman and a dog.\" (One of the narrators)Yahya said: \"Shubah said it was a marfu report.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Qatadah said:", "reference": "https://sunnah.com/nasai:751", "inBookReference": "Book 9, Hadith 10"}, {"id": 11, "hadithNumber": "752", "text": "It was narrated that Ibn Abbas said: \"Al-Fadl and I came riding a female donkey of ours, and the Messenger of Allah(ﷺ) was leading the people at Arafat.\" Then he said something to that effect. \"We passed by part of the row, and then we dismounted and left the donkey grazing, and the Messenger of Allah(ﷺ)did not say anything to us.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Abbas said:", "reference": "https://sunnah.com/nasai:752", "inBookReference": "Book 9, Hadith 11"}, {"id": 12, "hadithNumber": "753", "text": "It was narrated that Al-Fadl  bin 'Abbas said: \"The Messenger of Allah(ﷺ)visited Al Abbas in some land of ours outside the city, and we had a small dog and a donkey which was grazing. The Messenger of Allah(ﷺ) prayed Asr and they\nwere in front of him, and they were \nnot shooed away or pushed away.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that Al-Fadl  bin 'Abbas said:", "reference": "https://sunnah.com/nasai:753", "inBookReference": "Book 9, Hadith 12"}, {"id": 13, "hadithNumber": "754", "text": "It was narrated that Suhaib said: \"I heard Ibn Abbas narrate that he passed in front of the \nMessenger of Allah (ﷺ), he and a young boy of Banu Hashim, riding a donkey in front of the Messenger of Allah(ﷺ) when he was praying. \nThen they dismounted and joined the prayer, and he did not stop praying. Then two young girls of\nBanu Abdul-Muttalib started running around and grabbing him by the knees. He separated them\nbut he did not stop praying.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Suhaib said:", "reference": "https://sunnah.com/nasai:754", "inBookReference": "Book 9, Hadith 13"}, {"id": 14, "hadithNumber": "755", "text": "It was narrated that Aishah, may Allah be pleased with her, said: \"I was in front of the Messenger of Allah (ﷺ) when he was praying, and when I wanted to leave I did not want to get up and pass in front of him, so I just slipped away slowly and quietly.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Aishah, may Allah be pleased with her, said:", "reference": "https://sunnah.com/nasai:755", "inBookReference": "Book 9, Hadith 14"}, {"id": 15, "hadithNumber": "756", "text": "Narrated Busr bin Saeed: It was narrated from Busr bin Sa'eed said that Zaid bin Khalid sent him to Abu Juhaim to ask him what he had heard the Messenger of Allah (ﷺ) say about one who passes in front of a person who is praying? Abu Juhaim said: \"The Messenger of Allah(ﷺ)said: \"If the one who passes in front of a person who is praying knew what (burden of sin) there is on him, standing for forty would be better for him than passing in front of him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Busr bin Saeed:", "reference": "https://sunnah.com/nasai:756", "inBookReference": "Book 9, Hadith 15"}, {"id": 16, "hadithNumber": "757", "text": "Narrated Abu Saeed: It was narrated from Abu Saeed that the  Messenger of Allah(ﷺ) said: \" If anyone of you is praying, he should not let anyone pass in front of him, and if he insists (on passing) then let him fight him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Abu Saeed:", "reference": "https://sunnah.com/nasai:757", "inBookReference": "Book 9, Hadith 16"}, {"id": 17, "hadithNumber": "758", "text": "Narrated Kathir bin Kathir: It was narrated from Kathir bin Kathir, from his father, that his grandfather said: \"I saw the Messenger of Allah (ﷺ) circumambulate the House seven times, then he prayed two Rak'ahs at the edge of the Maqam, and there was nothing between him and the people who were performing Tawaf.\"", "grade": "Da'if (Darussalam)", "narratedBy": "Narrated Kathir bin Kathir:", "reference": "https://sunnah.com/nasai:758", "inBookReference": "Book 9, Hadith 17"}, {"id": 18, "hadithNumber": "759", "text": "It was narrated that Aisha said: \"The Messenger of Allah(ﷺ)used to pray at night while I was lying down sleeping between him and the Qibla on his bed. When he wanted to pray witr he would wake me up and I would pray witr\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Aisha said:", "reference": "https://sunnah.com/nasai:759", "inBookReference": "Book 9, Hadith 18"}, {"id": 19, "hadithNumber": "760", "text": "It was narrated that Abu Marthad al Ghanawi said: \"The Messenger of Allah(ﷺ)said: 'Do not pray toward graves and do not sit on them.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Marthad al Ghanawi said:", "reference": "https://sunnah.com/nasai:760", "inBookReference": "Book 9, Hadith 19"}, {"id": 20, "hadithNumber": "761", "text": "It was narrated that Aisha said: \"In my house there was a cloth on which there were images, which I covered a closet which is in the house, and the Messenger of Allah (ﷺ) used to pray toward it. Then he  said: '0 Aisha, take it away from me.' So I removed it and made pillows out of it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Aisha said:", "reference": "https://sunnah.com/nasai:761", "inBookReference": "Book 9, Hadith 20"}, {"id": 21, "hadithNumber": "762", "text": "It was narrated that 'Aishah\nsaid: \"The Messenger of Allah (ﷺ) had a mat which he would spread in the day and make into a small booth at night to pray in it. The people found out about that and they prayed when he prayed, with the mat in between him and them. He said: 'Do as much of good deeds as you can, for Allah does not get tired (of giving reward) until you get tired. And the most beloved of deeds to Allah are those that are continuous, even if they are few.' Then he stopped that prayer and did not return to it until Allah took him (in death), and if he started to do something he would persist in it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah\nsaid:", "reference": "https://sunnah.com/nasai:762", "inBookReference": "Book 9, Hadith 21"}, {"id": 22, "hadithNumber": "763", "text": "It was narrated from Abu Hurairah that someone asked the Messenger of Allah(ﷺ) about praying in a single garment, and he said: \"Does everyone of you have two garments?\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:763", "inBookReference": "Book 9, Hadith 22"}, {"id": 23, "hadithNumber": "764", "text": "Narrated Umar bin Abi Salamah: It was narrated from Umar bin Abi Salamah that he saw Messenger of Allah(ﷺ)praying in a single garment in the house of Umm Salamah, putting the ends of it on his shoulders.\"", "grade": "Sahih (Darussalam)", "narratedBy": "Narrated Umar bin Abi Salamah:", "reference": "https://sunnah.com/nasai:764", "inBookReference": "Book 9, Hadith 23"}, {"id": 24, "hadithNumber": "765", "text": "It was narrated that Salamah bin Al-Akwa said: \" I said: 'O Messenger of Allah(ﷺ), I go hunting wearing nothing but a single shirt. Can I pray in it?' He said: 'Fasten it to yourself even with a thorn.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Salamah bin Al-Akwa said:", "reference": "https://sunnah.com/nasai:765", "inBookReference": "Book 9, Hadith 24"}, {"id": 25, "hadithNumber": "766", "text": "It was narrated that Sahl bin Sa'd said: \"Some men used to pray with Messenger of Allah(ﷺ) tying their lower garments tight like children, it was said to the women: 'Do not raise your heads until the men have sat up completely.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Sahl bin Sa'd said:", "reference": "https://sunnah.com/nasai:766", "inBookReference": "Book 9, Hadith 25"}, {"id": 26, "hadithNumber": "767", "text": "It was narrated that 'Amr bin Salamah said: \"When my people came back from the Prophet (ﷺ)they said that he had said: 'Let the one who recites the Quran most lead you in prayer.' So they called me and taught me how to bow and \nprostrate, and I used to lead them in prayer, wearing a torn cloak, and they used to say to my father: 'Will you not conceal your son's backside from us?\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Amr bin Salamah said:", "reference": "https://sunnah.com/nasai:767", "inBookReference": "Book 9, Hadith 26"}, {"id": 27, "hadithNumber": "768", "text": "It was narrated that Aisha said: \"The Messenger of Allah(ﷺ)used to pray at night when I was beside him and I was menstruating, and there was a garment over me, part of which was over Messenger of Allah(ﷺ)\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Aisha said:", "reference": "https://sunnah.com/nasai:768", "inBookReference": "Book 9, Hadith 27"}, {"id": 28, "hadithNumber": "769", "text": "It was narrated that Abu Huraira said: \"The Messenger of Allah(ﷺ)said: 'No one of you should pray in a single garment with no part of it on his shoulder.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Huraira said:", "reference": "https://sunnah.com/nasai:769", "inBookReference": "Book 9, Hadith 28"}, {"id": 29, "hadithNumber": "770", "text": "It was narrated that 'Uqbah bin Amir said: \"A silken Farruj was presented to the Messenger of\nAllah (ﷺ) and he put it on and offered the prayer in it, then when he had finished the prayer he tore it off as if he disliked it and said:'This is not befitting for those who\nhave Taqwa.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Uqbah bin Amir said:", "reference": "https://sunnah.com/nasai:770", "inBookReference": "Book 9, Hadith 29"}, {"id": 30, "hadithNumber": "771", "text": "It was narrated from Aisha (ra) that the Messenger of Allah(ﷺ)prayed in a khamisah that had markings, then he said: \"These markings distracted me. Take it to Abu Jahm and bring me his Anbijani (a woolen garment with no markings).\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:771", "inBookReference": "Book 9, Hadith 30"}, {"id": 31, "hadithNumber": "772", "text": "It was narrated from Awn bin Abi Juhaifah, from his father that, the Messenger of Allah(ﷺ)\nwent out in a red Hullah, and he set up a short spear (Anazah) and prayed facing toward it, while dogs, women and donkeys were passing beyond it.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:772", "inBookReference": "Book 9, Hadith 31"}, {"id": 32, "hadithNumber": "773", "text": "Khilas bin 'Amr said: \"I heard Aisha (ra) say: 'The Messenger of Allah (ﷺ), Abii Al-Qbim, and I were beneath a single blanket, and\nI was menstruating. If something got on him from me, he would wash whatever had got on him and he did not wash anywhere else, and he prayed in it then came back to me.And if anything got on him from me,he would do exactly the same and he\ndid not wash anywhere else.\"'", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:773", "inBookReference": "Book 9, Hadith 32"}, {"id": 33, "hadithNumber": "774", "text": "It was narrated that Hammam said: \"I saw Jarir urinate, then he called for water and performed wudhu, and wiped over his Khuffs, then he stood up and prayed. He was asked about that and he said: 'I saw the Prophet(ﷺ) do exactly like this.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hammam said:", "reference": "https://sunnah.com/nasai:774", "inBookReference": "Book 9, Hadith 33"}, {"id": 34, "hadithNumber": "775", "text": "Abu Maslamah - whose name is Saeed bin Yazid, a trustworthy Basri - told us: \"I asked Anas bin Malik: 'Did the Prophet (ﷺ) pray in sandals?' He said: 'Yes.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:775", "inBookReference": "Book 9, Hadith 34"}, {"id": 35, "hadithNumber": "776", "text": "It was narrated from Abdullah bin As Saib that the Messenger of Allah(ﷺ) prayed on the day of Conquest (of Makkah), and he put his sandals to his left.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:776", "inBookReference": "Book 9, Hadith 35"}]}