{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 10, "bookName": "Chapter: Mention of Al-Imamah and the congregation", "hadiths": [{"id": 1, "hadithNumber": "777", "text": "It was narrated that 'Abdullah said: \"When the Messenger of Allah(ﷺ) passed away, the Ansar said: 'Let there be an Amir from among us and an Amir from among you.' Then 'Umar came to them and said: 'Do you not know that the Messenger of Allah(ﷺ) commanded Abu Bakr to lead the people in prayer? Who mong you could accept to put himself ahead of Abu Bakr?' They said: 'We seek refuge with Allah from putting ourselves ahead of Abu Bakr.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that 'Abdullah said:", "reference": "https://sunnah.com/nasai:777", "inBookReference": "Book 10, Hadith 1"}, {"id": 2, "hadithNumber": "778", "text": "It was narrated that Abu Aliyah Al-Barra said: \"Ziyad delayed the prayer, then Ibn Samit came to me and I gave him a chair and he sat on it. I told him what Ziyad had done and he bit his lip (in disapproval), and he struck me on the thigh and said: 'I asked Abu Dharr the same question you asked me, and he struck me on the thigh as I struck you on the thigh and said: I asked the Messenger of Allah (ﷺ) the same question as you have asked me and he struck me on the thigh as I have struck you on the thigh and said: Offer the prayer on time, and if you catch up with them, then pray with them, and do not say: 'I have already prayed so I will not pray(now).\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Aliyah Al-Barra said:", "reference": "https://sunnah.com/nasai:778", "inBookReference": "Book 10, Hadith 2"}, {"id": 3, "hadithNumber": "779", "text": "It was narrated that 'Abdullih said: \"The Messenger of Allah (ﷺ) said: 'You may live to meet people who will be offering the prayer outside its (prayer) time. If you meet them, then offer the prayer on time, then pray with them and make that a voluntary prayer.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullih said:", "reference": "https://sunnah.com/nasai:779", "inBookReference": "Book 10, Hadith 3"}, {"id": 4, "hadithNumber": "780", "text": "It was narrated that Abu Masud said: \"The Messenger of Allah(ﷺ)said: 'Let the one who has most knowledge of the Book of Allah lead the people in prayer. If they are equal in terms of knowledge of the Qur'h, let the one who emigrated first (lead them). If they are equal in terms of emigration, let the one who has more knowledge of the Sunnah, (lead them). If they are equal in terms of knowledge of the Sunnah, let the one who is oldest (lead them). Do not lead a man in prayer in his place of authority, and do not sit in his place of honor, unless he\ngives you permission.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Masud said:", "reference": "https://sunnah.com/nasai:780", "inBookReference": "Book 10, Hadith 4"}, {"id": 5, "hadithNumber": "781", "text": "It was narrated that Malik bin Al-Huwairith said: \"I came to the Messenger of Allah (ﷺ) with a cousin of mine\" - once he said, \"with a  friend of mine\" - and he said: 'When you travel, call the Adhan and Iqamah, and let the older of you lead the prayer.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Malik bin Al-Huwairith said:", "reference": "https://sunnah.com/nasai:781", "inBookReference": "Book 10, Hadith 5"}, {"id": 6, "hadithNumber": "782", "text": "It was narrated from Abu Sa'eed that the Prophet (ﷺ) said: \"when there are three people let one of them lead the prayer, and the one who is most entitled to lead the prayer is the one who has \r\nmost knowledge of the Qur'an.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Sa'eed that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:782", "inBookReference": "Book 10, Hadith 6"}, {"id": 7, "hadithNumber": "783", "text": "It was narrated that Abu Masud said: \"The Messenger of Allah (ﷺ) said: 'A man should not be led in prayer in his place of authority, and no one should sit in his place of honor except with his permission.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Masud said:", "reference": "https://sunnah.com/nasai:783", "inBookReference": "Book 10, Hadith 7"}, {"id": 8, "hadithNumber": "784", "text": "It was narrated from Sahl bin Sa'd that the Messenger of Allah (ﷺ) heard that there was a dispute among Banu 'Amr bin 'Awf, so he\nwent to them with some other people to reconcile between them. The Messenger of Allah (ﷺ) was delayed there, and the time for Zuhr came. Bilal came to Abu Bakr and said to him: \"The Messenger of Allah (ﷺ) has been delayed (there) and the time for prayer has come, will you lead the people in prayer?\" Abu Bakr said: 'Yes, if you wish.' Bilal said the Iqamah and Abu Bakr went forward and said the Takbir for the people. Then the Messenger of  Allah(ﷺ) came, passing through the rows (of praying people) and stood in the (first) row and the people started clapping. Abu Bakr would never glance sideways in his prayer but when the people clapped so much he looked back and (ﷺ)Messenger of Allah (ﷺ). The Messenger of Allah(ﷺ) gestured to him to carry on praying. Aha Bakr raised his hands praising Allah the Mighty and Sublime, and retreated till he reached the (first) row. Then the Messenger ofAllah(ﷺ) went forward and led the people in the prayer. When he completed the prayer he turned to face the people and said: '0 people, why did you start clapping when something unusual happened to you in the prayer? Clapping is only for women. So whoever among you comes across something in the prayer should say: 'Subhan Allah' for there is none who will not turn round when they hear him saying Subhan Allah. 0 Abu Bakr! What prevented you from leading the people in the prayer when I gestured to you to do so?' Abu Bakr replied: 'It is not fitting for the son of Abu Quhafah to lead the prayer in the presence of the Messenger of Allah (ﷺ).'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:784", "inBookReference": "Book 10, Hadith 8"}, {"id": 9, "hadithNumber": "785", "text": "It was narrated that Anas said: \"In the last prayer that the Messenger of Allah(ﷺ) prayed with the people, he prayed wrapped up in a single garment, behind Abu Bakr.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:785", "inBookReference": "Book 10, Hadith 9"}, {"id": 10, "hadithNumber": "786", "text": "It was narrated from Aisha that Abu Bakr led the people in prayer and the Messenger of Allah (ﷺ)was in the row.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:786", "inBookReference": "Book 10, Hadith 10"}, {"id": 11, "hadithNumber": "787", "text": "It was narrated that Malik bin Al-Huwairith said: \"I heard the Messenger of Allah (ﷺ) say: 'When any one of you visits some people,he should not lead them in prayer.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Malik bin Al-Huwairith said:", "reference": "https://sunnah.com/nasai:787", "inBookReference": "Book 10, Hadith 11"}, {"id": 12, "hadithNumber": "788", "text": "It was narrated from Mahmiid bin Ar-Rabi' that 'Itbk bin Milk used to lead his people in prayer, and he was blind. He said to the\nMessenger of Allah (ﷺ): \"Sometimes it is dark or rainy or there is a flood, and I am a blind\nman; 0 Messenger of Allah (ﷺ), (come and) pray in a place in my house that I may take as a prayer-place.\" He said: \"Where would you like\nme to pray for you?\" He showed him a place in his house, and the Messenger of Allah (ﷺ) prayed there.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:788", "inBookReference": "Book 10, Hadith 12"}, {"id": 13, "hadithNumber": "789", "text": "'Amr bin Salamah Al-Jarmi said: \"Riders used to pass by us and we would leam the Qur'an from them. My father came to the Prophet (ﷺ) and he said: 'Let the one of you who knows most Qur'an leads the prayer.' My father came and said that the Messenger of Allah (ﷺ) had said: 'Let the one of you who knows most Quran lead you in prayer.' They looked and found that I was the one who knew most Qur'an, so I used to lead them in prayer when I was eight years old.'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:789", "inBookReference": "Book 10, Hadith 13"}, {"id": 14, "hadithNumber": "790", "text": "It was narrated from Abdullah bin Abi Qatadah that his father said: \"The messenger of Allah (ﷺ) said: 'When the call to prayer is given, do not stand up until you see me.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abdullah bin Abi Qatadah that his father said:", "reference": "https://sunnah.com/nasai:790", "inBookReference": "Book 10, Hadith 14"}, {"id": 15, "hadithNumber": "791", "text": "It was narrated that Anas said: \"The Iqamah for prayer was said, and the Messenger of Allah (ﷺ) was conversing privately with a man, and did not commence the prayer until the people slept.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:791", "inBookReference": "Book 10, Hadith 15"}, {"id": 16, "hadithNumber": "792", "text": "It was narrated that Abu Hurairah said: \"The Iqamah for prayer was said and the people stood in rows, and the Messenger of Allah (ﷺ) came out. Then when he stood in the place where he prayed, he remembered that he had not performed Ghusl. He said to the people: 'Stay where you are.' Then he went back to his house, then he came out with his head dripping with water. He performed Ghusl while we were standing in our rows.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:792", "inBookReference": "Book 10, Hadith 16"}, {"id": 17, "hadithNumber": "793", "text": "Sahl bin Sa'd said: \"There was some fighting among Banu 'Amr bin 'Awf, and news of that reached the Prophet (ﷺ). He prayed Zuhr, then he went to them to reconcile between them. Then he said to Bilal: 'O Bilal, if the time for Asr comes and I have not come back, then tell Abu Bakr to lead the people in prayer.' When the time (for Asr) came, Bilal called the Adhan, then the Iqamah, then he said to Abu Bakr: 'Go forward. So Abu Bakr went forward and started to pray. Then the Messenger of Allah (ﷺ) came and started passing through the rows of people until he stood behind Abu Bakr, and the people clapped. Abu Bakr was such that whenever he started praying, he would never glance sideways, but when he noticed that the clapping persisted he turned around. The Messenger of Allah (ﷺ) gestured to him to carry on praying. Abu Bakr praised Allah the Mighty and Sublime for the Messenger of Allah (ﷺ) having told him to continue. Then Abu Bakr moved backward on his heels, and when the Messenger of Allah (ﷺ) saw that, he came forward and led the people in prayer. When he completed the prayer he said: 'O Abu Bakr, when I gestured to you, what kept you from continuing (to lead the people)?' He said: 'It does not befit the son of Abu Quhafah to lead the Messenger of Allah (ﷺ) in prayer.' And he (the Prophet) said to the people: 'If you notice something (during the prayer), men should say Subhan Allah and women should clap.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:793", "inBookReference": "Book 10, Hadith 17"}, {"id": 18, "hadithNumber": "794", "text": "It was narrated from Anas that the Messenger of Allah(ﷺ) fell from a horse onto his right side.They came to visit him and the time for prayer came. When the prayer was over he said: \"The Imam is appointed to be followed. When he bows, then bow, when he stands up, then stand up, when he prostrates, then prostrate, and when he says Sami' Alldhu liman hamidah (Allah hears the one who praises Him), then say, Rabbanri\nlakal-hamd (Our Lord, to You be the praise).\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:794", "inBookReference": "Book 10, Hadith 18"}, {"id": 19, "hadithNumber": "795", "text": "It was narrated from Abu Sa'eed that the Messenger of Allah (ﷺ) saw that his companions tended to stand in the rear, so he said: \"Come forward and follow me, and let those who are behind you follow your lead. If people\ncontinue to lag behind, Allah, the Mighty and Sublime, will put them back.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:795", "inBookReference": "Book 10, Hadith 19"}, {"id": 20, "hadithNumber": "796", "text": "(Another chain) from Abu Nadrah (from Abu Sa'eed) with similar narration.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:796", "inBookReference": "Book 10, Hadith 20"}, {"id": 21, "hadithNumber": "797", "text": "It was narrated from Aisha may Allah be pleased with her, that the Messenger of Allah (ﷺ) told Abu Bakr to lead the people in prayer. She said: \"The Prophet was in front of Abu Bakr and he prayed sitting down, and Abu Bakr was leading the people in prayer, and the people were behind Abu Bakr.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:797", "inBookReference": "Book 10, Hadith 21"}, {"id": 22, "hadithNumber": "798", "text": "It was narrated that Jabir said: \"The Messenger of Allah (ﷺ) led us in Zuhr prayer and Abu Bakr was behind him. When the Messenger of Allah (ﷺ) said the Takbir, Abu Bakr said the Takbir so that the people could hear.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:798", "inBookReference": "Book 10, Hadith 22"}, {"id": 23, "hadithNumber": "799", "text": "It was narrated that Al-Aswad and 'Alqamah said: \"We entered upon 'Abdullah at midday and he said: 'There will be rulers who would be distracted from praying on time, so pray on time.' Then he stood up and prayed between him \nand I, and said: 'This is what I saw the Messenger of Allah (ﷺ) do.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Al-Aswad and 'Alqamah said:", "reference": "https://sunnah.com/nasai:799", "inBookReference": "Book 10, Hadith 23"}, {"id": 24, "hadithNumber": "800", "text": "Buraidah bin Sufyin bin Farwah Al-Aslami narrated that a slave of his grandfather who was called Mas'Od said: \"The Messenger of Allah (ﷺ) and Abu Bakr passed by me and Abu Bakr said to me: '0 Mas'ud, go to Abu Tamim' - meaning the man from whom he had been freed - 'and tell him to give us a camel so that we\ncould ride, and let him send us some food and a guide to show us the way.' So I went to my former master and told him the same, and he sent with me a camel and vessels of milk, and I brought them via a secret route. Then the time for prayer came and the Messenger of Allah (ﷺ) stood up and prayed, and Abu Bakr stood to his right. I had come to know about Islam and I was with them, so I came and stood behind them. So the Messenger of Allah (ﷺ) pushed Abu Bakr on the chest (to make him move backward) and we stood behind him.\" Abu 'Abdur-Rahman (An-Nasai)said: (This) Buraidah is not a reliable narrator of Hadith.", "grade": "Da'if (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:800", "inBookReference": "Book 10, Hadith 24"}, {"id": 25, "hadithNumber": "801", "text": "It was narrated from Anas bin Malik, that his grandmother Mulaikah invited the Messenger of\nAllah (ﷺ) to come and eat some food that she had prepared for him. Then he said: \"Get up and I will lead you in prayer.\" Anas said: \"So I got up and brought a reed mat of ours that had turned black from long use, and spreaded some\nwater on it. The Messenger of Allah (ﷺ) stood and the orphan and I stood in a row behind him, and the old woman stood behind us, and he led us in praying two Rak'ahs, then he left.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:801", "inBookReference": "Book 10, Hadith 25"}, {"id": 26, "hadithNumber": "802", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) entered upon us and the only people present were myself, my mother, the orphan and Umm  Harh, my maternal aunt. He said: 'Stand up and I will lead you in prayer.' It was not the time for a (prescribed) prayer. And he led us in prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:802", "inBookReference": "Book 10, Hadith 26"}, {"id": 27, "hadithNumber": "803", "text": "It was narrated from Anas that he and the Messenger of Allah (ﷺ) and his mother, and his maternal aunt (were together). The Messenger of Allah (ﷺ) prayed, and  he told Anas to stand on his right and his mother and maternal aunt behind them.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:803", "inBookReference": "Book 10, Hadith 27"}, {"id": 28, "hadithNumber": "804", "text": "It was narrated that Ibn 'Abbas said: \"I prayed beside the Prophet (ﷺ) and Ayesha was behind us praying with us, and I was beside the Prophet (ﷺ) praying with him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:804", "inBookReference": "Book 10, Hadith 28"}, {"id": 29, "hadithNumber": "805", "text": "It was narrated that Anas said: \"The Messenger of  Allah (ﷺ) led me and a woman from my family in prayer. He made me to stand on his right and the woman to stand behind us.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:805", "inBookReference": "Book 10, Hadith 29"}, {"id": 30, "hadithNumber": "806", "text": "It was narrated that Ibn Abbas said: \"I stayed overnight with my maternal aunt Maimunah, and the Messenger of Allah (ﷺ) got up to pray at night. I stood on his left, so he did this to me: He took me by the head and made me stand on \nhis right.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Abbas said:", "reference": "https://sunnah.com/nasai:806", "inBookReference": "Book 10, Hadith 30"}, {"id": 31, "hadithNumber": "807", "text": "It was narrated that Abu Mas'ud Al-Ansiri said: \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he-would say:'Keep (the rows) straight; do not differ from one another lest your hearts would be afflicted with discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"' Abu Mas'ud said: Today, there is much disharmony among you. ,Abu 'Abdur-Rabin (An-Nasai)said: (One of the narrators) Abu Ma'mar's name is 'Abdullah bin Sakhbarah.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Mas'ud Al-Ansiri said:", "reference": "https://sunnah.com/nasai:807", "inBookReference": "Book 10, Hadith 31"}, {"id": 32, "hadithNumber": "808", "text": "It was narrated that Qais bin 'Ubad said: \"While I was in the Masjid in the first row, a man pulled me from behind and moved me aside, and took my place. By Allah, I could not focus on my prayer, then when he left I saw that it was Ubayy bin Ka'b. He said: '0 boy, may Allah protect you from harm. This is what the Prophet instructed us to do, to stand directly behind him.' Then he (Ubayy) turned to face the Qiblah and said: 'Doomed are Ah1 Al-'Uqd, by the Lord of the Ka'bah! - three times.'Then he said: 'By Allah, I am not sad for them, but I am sad for the people whom they have misled.' I said: '0 Abu Ya'qub, what do you mean by Ah1 Al-'Uqd?' He said: 'The rulers.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Qais bin 'Ubad said:", "reference": "https://sunnah.com/nasai:808", "inBookReference": "Book 10, Hadith 32"}, {"id": 33, "hadithNumber": "809", "text": "Abu Salamah bin 'Abdur Rahman narrated that he heard Abu Hurairah say: \"The Iqamah for prayer was said, and we stood up and the rows were straightened, before the Messenger of Allah (ﷺ) came out to us. Then the Messenger of Allah (ﷺ) came to us and stood in the place where he prayed, before he said the Takbir he paused and said to us: 'Stay where you are.' So we stayed there, waiting for him, until he came out to us; he had performed Ghusl and his head was dripping with water. Then he said the Takbir and prayed.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:809", "inBookReference": "Book 10, Hadith 33"}, {"id": 34, "hadithNumber": "810", "text": "It was narrated that An-Numan bin Bashir said: \"The Messenger of Allah (ﷺ) used to straighten the rows like shaft of an arrow is straightened before the head is attached to it. He saw a man whose chest was sticking out from the row. I saw the Messenger of Allah (ﷺ) say: 'Make your rows straight or Allah will cause your faces to be deformed.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that An-Numan bin Bashir said:", "reference": "https://sunnah.com/nasai:810", "inBookReference": "Book 10, Hadith 34"}, {"id": 35, "hadithNumber": "811", "text": "It was narrated that Al-Bara bin Azib said: \"The Messenger of Allah (ﷺ) used to go between the rows from one side to another, patting our shoulders and chests and saying: 'Do not make your rows ragged or your hearts will be filled with enmity toward one another.' And he used to say: 'Allah and His angels send Salah upon the front rows.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Al-Bara bin Azib said:", "reference": "https://sunnah.com/nasai:811", "inBookReference": "Book 10, Hadith 35"}, {"id": 36, "hadithNumber": "812", "text": "It was narrated that Abu Mas'ad Al-Ansari said: \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he would say: 'Keep (the rows) straight; do not differ from one another lest your hearts should suffer from discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Mas'ad Al-Ansari said:", "reference": "https://sunnah.com/nasai:812", "inBookReference": "Book 10, Hadith 36"}, {"id": 37, "hadithNumber": "813", "text": "It was narrated from Anas that the Prophet (ﷺ) used to say: \"Make your rows straight, make your rows straight, make your rows straight. By the One in Whose Hand is my soul! I can see you behind me as I can see you in front of me.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Anas that the Prophet (ﷺ) used to say:", "reference": "https://sunnah.com/nasai:813", "inBookReference": "Book 10, Hadith 37"}, {"id": 38, "hadithNumber": "814", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ)turned to face us when he stood up to pray, before he said the Takbir and said: 'Make your rows straight and come close to one another, for I can see you behind my back.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:814", "inBookReference": "Book 10, Hadith 38"}, {"id": 39, "hadithNumber": "815", "text": "Anas narrated that the Prophet (ﷺ) said: \"Make your rows solid and close together, and keep your necks in line. By the One in Whose Hand is the soul of Muhammad! I can see the shaitan entering through the gaps in the rows as if they are small sheep.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:815", "inBookReference": "Book 10, Hadith 39"}, {"id": 40, "hadithNumber": "816", "text": "It was narrated that Jabir bin Samurah said: \"The Messenger of Allah (ﷺ) came out to us and said:'Will you not form rows as the angels form rows before their Lord? They said: 'How do the angels form rows before their lord? He said: 'They complete the first row and fill the gaps in the rows.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin Samurah said:", "reference": "https://sunnah.com/nasai:816", "inBookReference": "Book 10, Hadith 40"}, {"id": 41, "hadithNumber": "817", "text": "It was narrated from Al'Irbad bin Sariyah that the Messenger of Allah (ﷺ) used to send Salah on the first row three times and on the second row once.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:817", "inBookReference": "Book 10, Hadith 41"}, {"id": 42, "hadithNumber": "818", "text": "It was narrated from Anas that the Messenger of Allah (ﷺ) said: \"Complete the first row, then the one behind it, and if any row is to be left\nincomplete let it be the last row.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Anas that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:818", "inBookReference": "Book 10, Hadith 42"}, {"id": 43, "hadithNumber": "819", "text": "It was narrated from 'Abdullih bin 'Umar that the Messenger of Allah (ﷺ)said: \"Whoever completes a row, may Allah be generous to him, and whoever cuts a row, may Allah cut him off.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Abdullih bin 'Umar that the Messenger of Allah (ﷺ)said:", "reference": "https://sunnah.com/nasai:819", "inBookReference": "Book 10, Hadith 43"}, {"id": 44, "hadithNumber": "820", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'The best rows for men are the front rows and the worst are the last, and the best rows for women are the back rows and the worst are those in the front.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:820", "inBookReference": "Book 10, Hadith 44"}, {"id": 45, "hadithNumber": "821", "text": "It was narrated that 'Abdul Hamid bin Mahmud said: \"We were with Anas and we prayed with \none of the Amirs. They pushed us until we stood and prayed between two rows, and Anas started moving backward and said: 'We used to avoid this at the time of the Messenger of Allah (ﷺ).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdul Hamid bin Mahmud said:", "reference": "https://sunnah.com/nasai:821", "inBookReference": "Book 10, Hadith 45"}, {"id": 46, "hadithNumber": "822", "text": "It was narrated that Al Bara said: \"When we prayed behind the Messenger of Allah (ﷺ) I liked to be to his right.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Al Bara said:", "reference": "https://sunnah.com/nasai:822", "inBookReference": "Book 10, Hadith 46"}, {"id": 47, "hadithNumber": "823", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ)said: \"When any one of you leads the people in prayer, let him make it short, for among them are the sick, the weak and the elderly. And when any one of you prays by himself, let him make it as long as he wishes.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet (ﷺ)said:", "reference": "https://sunnah.com/nasai:823", "inBookReference": "Book 10, Hadith 47"}, {"id": 48, "hadithNumber": "824", "text": "It was narrated from Anas that the Prophet (ﷺ) used to make his prayer very brief but still complete when leading people.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:824", "inBookReference": "Book 10, Hadith 48"}, {"id": 49, "hadithNumber": "825", "text": "It was narrated from 'Abdullah bin Abi Qatadah, from his father that the Prophet (ﷺ) said: \"I stand in prayer, then I hear a child crying, so                  I make my prayer brief, because I do not want to cause hardship for his mother.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin Abi Qatadah, from his father that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:825", "inBookReference": "Book 10, Hadith 49"}, {"id": 50, "hadithNumber": "826", "text": "It was narrated that 'Abdullah bin 'Umar said: \"The Messenger of Allah (ﷺ) used to enjoin upon us to make the prayer short, but he would lead us in prayer and recite As-Saffat.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin 'Umar said:", "reference": "https://sunnah.com/nasai:826", "inBookReference": "Book 10, Hadith 50"}, {"id": 51, "hadithNumber": "827", "text": "It was narrated that Abu Qatadah said: \"I saw the Messenger of Allah (ﷺ)leading the people in prayer, carrying Umamah bint Abi Al-As on his shoulder. When he bowed he put her down and when he stood up from prostration he picked  her up again.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Qatadah said:", "reference": "https://sunnah.com/nasai:827", "inBookReference": "Book 10, Hadith 51"}, {"id": 52, "hadithNumber": "828", "text": "It was narrated that Abu Hurairah said: \"Muhammad (ﷺ) said: 'Does the one who raises his head before the Imam not fear that Allah may turn his head into the head of a donkey?\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:828", "inBookReference": "Book 10, Hadith 52"}, {"id": 53, "hadithNumber": "829", "text": "It was narrated that Abu Ishaq said: \"I heard 'Abdullah bin Yazid delivering a Khutbah. He said: 'Al-Bara, who was no liar,told us that when they prayed with the Messenger of Allah (ﷺ) would raise his head from bowing and they would remain standing until they saw him prostrate, then they would prostrate.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Ishaq said:", "reference": "https://sunnah.com/nasai:829", "inBookReference": "Book 10, Hadith 53"}, {"id": 54, "hadithNumber": "830", "text": "It was narrated that Hittan bin 'Abdullah said: \"Abu Musa led us in prayer and when he was sitting, a man from among the people entered and said: 'Prayer is based on righteousness and is always mentioned alongside Zakah (in the Qur'an).' When Abu Musa had said the Salam, he turned to the people and said: 'Which of you spoke these words?' The people kept quiet. Then he said: 'O Hittan, perhaps you said it?' He said: 'No, but I was afraid that you would rebuke me for it.' He said:\n'The Messenger of Allah (ﷺ) taught us our prayer and Sunnah prayers, and he said: The Imam is appointed to be followed, so when he says the Takbir, say the Takbir; when he says\n\"Not (the way) of those who earned Your Anger, nor of those who went astray,\" say Amin, and Allah will respond to you; when he rises up from bowing and says, 'Sami' Allalhu liman hamidah (Allah hears those who praise Him), say 'Rabbana lakal-hamd (Our Lord, to\nYou be praise),' and Allah will hear you; when he prostrates, prostrate, and when he sits up, sit up. The Imam should prostrate before you\ndo and sit up before you do.' The Messenger of Allah (ﷺ) said: 'This makes up for that.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hittan bin 'Abdullah said:", "reference": "https://sunnah.com/nasai:830", "inBookReference": "Book 10, Hadith 54"}, {"id": 55, "hadithNumber": "831", "text": "It was narrated that Jabir said: \"A man from the Ansar came when the Iqamah for prayer had\nbeen said. He entered the Masjid and prayed behind Muadh, and he(Muadh) made the prayer lengthy. The man went away and prayed in a  comer of the Masjid, then he left. When Muadh finished praying, it was said to him that so-and-so had done such and such. Muadh said:\n'Tomorrow I will mention that to the Messenger of Allah (ﷺ).' So Muadh came to the  Messenger of Allah (ﷺ) and told him about that. The Messenger of Allah (ﷺ) sent for him and asked him: 'What made you do what you did? He said: '0 Messenger of Allah (ﷺ), I had been working with my camel to bring water all day, and when I came the Iqamah for prayer had already been said, so I entered the Masjid and joined him in the prayer, then he recited such and such a Surah and made it lengthy, so\nI went away and prayed in a comer of the  Masjid.' The Messenger of Allah (ﷺ) said: 'Do you want to cause hardship to the people, 0 Muadh do you want to cause hardship to the\npeople, 0 Muadh do you want to cause hardship to the people, 0 Muadh?\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:831", "inBookReference": "Book 10, Hadith 55"}, {"id": 56, "hadithNumber": "832", "text": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) rode a horse and fell from it, and sustained an injury on his right\nside. He led one of the prayers sitting, and we prayed behind him sitting. When he had finished he said: \"The Imam is appointed to be followed. If he prays standing then pray standing; when he bows, bow; when he says, Sami' Allahu liman\nhamidah (Allah hears those who praise Him), say 'Rabbana lakalhamd (Our Lord, to You be praise); and if he prays sitting then pray sitting, all of you.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:832", "inBookReference": "Book 10, Hadith 56"}, {"id": 57, "hadithNumber": "833", "text": "It was narrated that Aisha said: \"When the Messenger of Allah (ﷺ) became seriously ill, Bilal came to tell him it was time to pray and he said: 'Tell Abu Bakr to lead the people in prayer.\"' She said: \"I said: '0 Messenger of Allah (ﷺ), Abu Bakr is a tender-hearted man, and when he stands in your place he will not be able to make the people \nhear his voice; why don't you tell 'Umar (to do it)?' He said: 'Tell a Abu Bakr to lead the people in the prayer.' I said to Hafsah: 'Tell him.' So she told him. He said: 'You are (like) the female companions of Yosuf. Tell Abu Bakr lead the people in prayer.\"' She said: \"So they told Abu Bakr. When he started to pray, the Messenger of Allah (ﷺ) began to feel better, so he got up and came with the help of two men, with his feet dragging along the ground. (When) he entered the Masjid, Abu\nBakr heard him coming and he wanted to step back, but the Messenger of Allah (ﷺ) gestured to him: 'Stay where you are.' Then the Messenger of Allah (ﷺ) came and sat on Abu Bakr's left, so the Messenger of Allah (ﷺ) was leading the people in prayer sitting, and Abu Bakr was standing and following the Messenger of Allah (ﷺ) and the people were following the prayer of Abu Bakr, may Allah be pleased with him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Aisha said:", "reference": "https://sunnah.com/nasai:833", "inBookReference": "Book 10, Hadith 57"}, {"id": 58, "hadithNumber": "834", "text": "It was narrated that 'Ubaidullah bin 'Abdullah said: \"I entered upon Aisha and said: 'Will you not tell me about the sickness of the Messenger of Allah (ﷺ)?' She said: 'When the Messenger of Allah (ﷺ), became seriously ill, he said: \"Have the people prayed?\" We said: \"No, they are waiting for you, 0 Messenger of Allah (ﷺ)\" He said: \"Put some water in a tub for me.\" We did that and he performed Ghusl, then he tried to  get up but he fainted. Then he came to us and said: \"Have the people prayed?\" We said: \"No, they are waiting for you, 0 Messenger of\r\nAllah (ﷺ).\" He said: \"Put some water in\r\na tub for me.\" We did that and he performed Ghusl, then he tried to get up but he fainted. Then for the third time he said the same thing. She said: The people were in the Masjid, waiting for the Messenger of Allah (ﷺ) to lead the prayer. The Messenger of Allah (ﷺ) sent word to Abu Bakr, telling him to lead the people in prayer, so the messenger came to him and said: \"The Messenger of Allah (ﷺ) is telling you  to lead the people in prayer.\" Abu Bakr was a tenderhearted man, he said: \"0 'Umar. lead the \r\nin prayer.\" But ('Umar) said: \"You have more right to that.\" So Abu Bakr led them in prayer during those days. When the Messenger of Allah (ﷺ) felt a little better, he came with\r\nthe help of two men, one of whom was Al-'Abbas, to pray Zuhr. When Abu Bakr saw him, he wanted to step back, but the Messenger of Allah (ﷺ) gestured to him not to step back. He told them (the two men) to seat him beside Abu Bakr, and Abu Bakr started to pray standing. The people were following the prayer of Abu Bakr and the Messenger of Allah (ﷺ) was praying sitting.\"'\r\n\"I ('Ubaidullah) entered upon Ibn Abbas and said 'Shall I not tell you what Aisha narrated to me about the sickness of the Messenger of Allah (ﷺ)?' He said: 'Yes.' So I told him and he did not deny any of it, but he said: 'Did she tell you the name of the man who was with Al-'Abbas?' I said: 'No.' He said: 'That\r\nwas Ali, may Allah honor his face.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Ubaidullah bin 'Abdullah said:", "reference": "https://sunnah.com/nasai:834", "inBookReference": "Book 10, Hadith 58"}, {"id": 59, "hadithNumber": "835", "text": "It was narrated that 'Amr said: \"I heard Jabir bin 'Abdullah say: 'Mu'adh used to pray with the Prophet (ﷺ) then he would go back to his people to lead them in a prayer. He stayed late one night and prayed with the Prophet (ﷺ) then he went back to his people to lead them in prayer, and he recited Surat Al-Baqarah. When a man from his people heard that, he stepped aside and prayed (on his\nown), then he left. They said: 'You have become a hypocrite, 0 so and-so!' He said: 'By Allah, I have not become a hypocrite, and I will go to the Prophet (ﷺ) and tell him \n(about that),' So he went to the Prophet and said: '0 Messenger of Allah(ﷺ), Muadh prays with you, then he comes to lead us in prayer.  You delayed the prayer, and he prayed with you then he came back to lead us in prayer, and he started to recite Shut Al-Baqarah. When I\nheard that, I stepped aside and prayed by myself, because we are people who bring water with the camels and we work hard.' The Prophet (ﷺ) said to him: '0 Muadh, do you want to cause hardship to the people? Recite such and such a Surah, and such and such a Surah.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Amr said:", "reference": "https://sunnah.com/nasai:835", "inBookReference": "Book 10, Hadith 59"}, {"id": 60, "hadithNumber": "836", "text": "837. It was narrated from Abu Bakr that the Prophet (ﷺ) offered the fear prayer (Salat Al-Khauf). He led those who were behind him in two Rak'ah and those who came (after them) in two Rak'ah, so the Prophet (ﷺ) prayed four Rak'ahs and each group prayed two.", "grade": "Da'if (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:836", "inBookReference": "Book 10, Hadith 60"}, {"id": 61, "hadithNumber": "837", "text": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Praying in congregation is twenty-seven times better than \npraying alone.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:837", "inBookReference": "Book 10, Hadith 61"}, {"id": 62, "hadithNumber": "838", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Praying in congregation is twenty-five portions better than one of you praying alone.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:838", "inBookReference": "Book 10, Hadith 62"}, {"id": 63, "hadithNumber": "839", "text": "It was narrated from that the Prophet (ﷺ) said: \"Prayer in congregation is twenty-five levels better than a prayer offered on one's own.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:839", "inBookReference": "Book 10, Hadith 63"}, {"id": 64, "hadithNumber": "840", "text": "It was narrated that Abu Sa'eed said: \"The Messenger of Allah (ﷺ)said: 'If there are three people, let one of them lead the\nothers in prayer, and the one who has the most right to lead the prayer is the one who recites\n(knows) the most (Qur'an).\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Sa'eed said:", "reference": "https://sunnah.com/nasai:840", "inBookReference": "Book 10, Hadith 64"}, {"id": 65, "hadithNumber": "841", "text": "Ibn 'Abbas said: \"I prayed beside the Prophet (ﷺ) and Aisha was behind us praying with us, and I was beside the Prophet (ﷺ) praying with him.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:841", "inBookReference": "Book 10, Hadith 65"}, {"id": 66, "hadithNumber": "842", "text": "It was narrated that Ibn Abbas said: \"I prayed with the Messenger of Allah (ﷺ)and I stood on his left. He took hold of me with his left hand and made me stand on his right.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Abbas said:", "reference": "https://sunnah.com/nasai:842", "inBookReference": "Book 10, Hadith 66"}, {"id": 67, "hadithNumber": "843", "text": "Ubay bin Ka'b said: \"One day the Messenger of Allah (ﷺ) prayed Fajr, then he said: 'Did so-and-so attend the prayer? They said: 'No.' He said: '(What about) so-and-so? They said:'No' He said: 'These two prayers. are the most burdensome for the hypocrites. If they knew what (virtue) there is in them, they would come, even if they had to crawl. And the virtue of the first row is like that\nof the row of the angels. If you knew its virtue, you would compete for it. A man's prayer with another man is greater in reward than his prayer alone. And a man's prayer with two other men is greater in reward than\nhis prayer with one other man; the more people there are, the more beloved that is to Allah, the Mighty and Sublime.\"'", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:843", "inBookReference": "Book 10, Hadith 67"}, {"id": 68, "hadithNumber": "844", "text": "It was narrated from 'Itban bin Malik that he said: \"0 Messenger of Allah (ﷺ) the floods keep me from coming to the Masjid of my people. I would like you to come and pray in a place in my house so that I can take it as a Masjid.\" The Messenger of Allah (ﷺ)  said: \"We shall do that.\" \"When the Messenger of Allah (ﷺ) entered he said: 'Where do you want (me to pray).' I showed him a comer of the house, and the Messenger of Allah (ﷺ) stood there, and we formed rows behind him, and he led us in praying two Rak'ahs.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Itban bin Malik that he said:", "reference": "https://sunnah.com/nasai:844", "inBookReference": "Book 10, Hadith 68"}, {"id": 69, "hadithNumber": "845", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) turned to face us when he stood up to pray, before he said Takbir, and said: 'Make your rows straight and fill the gaps, for I can see you from behind my back.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:845", "inBookReference": "Book 10, Hadith 69"}, {"id": 70, "hadithNumber": "846", "text": "It was narrated from 'Abdullah bin Abi Qatadah that his father said: \"We were with the Messenger of Allah (ﷺ) when some of the people said: 'Why do you not stop with us to rest awhile, 0 Messenger of Allah (ﷺ)?' He said: 'I am afraid that you will sleep and miss the prayer.' Bilal said:'I will wake you up.' So they lay down and slept, and Bilal leaned back on his mount. Then the Messenger of Allah (ﷺ) woke up when the sun had already started to rise, and he said: '0 Bilal, what about what you told us?' He said: 'I \nhave never slept like that before.' The Messenger of Allah (ﷺ) said: 'Allah, the Mighty and Sublime, takes your souls when He wills and sends them back when He wills.' Stand up 0 Bilal and call the people to prayer.' Then Bilal stood up and & called the Adhan, and they  performed Wudu' - that is, when the sun had risen (fully) - \"then he  stood and lead them in prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin Abi Qatadah that his father said:", "reference": "https://sunnah.com/nasai:846", "inBookReference": "Book 10, Hadith 70"}, {"id": 71, "hadithNumber": "847", "text": "It was narrated that Ma'din bin Abi Talhah Al-Ya'muri said: \"Abu Ad-Darda said to me: 'Where do you live?' I said: 'In a town near Hims.' Abu Ad-Darda said: 'I heard the Messenger of Allah (ﷺ) say: \"There are no three people in a town or encampment among whom prayer is not established, but the Shaitan takes control of them. Therefore, stick to the congregation, for the wolf eats \nthe sheep that strays off on its own.\" (One of the narrators (As Sa'ib) said: \"The congregation means the congregational prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ma'din bin Abi Talhah Al-Ya'muri said:", "reference": "https://sunnah.com/nasai:847", "inBookReference": "Book 10, Hadith 71"}, {"id": 72, "hadithNumber": "848", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul! I nearly ordered that firewood be gathered to be lit, then I would have ordered that the Adhan be called for prayer, and ordered a man to lead the people in prayer, then I would have gone from behind to those men and burned their houses down over them. By the One in Whose Hand is my soul! If any one of them knew that he would get a meaty bone or some meat in between two ribs, he would attend Isha'.''", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:848", "inBookReference": "Book 10, Hadith 72"}, {"id": 73, "hadithNumber": "849", "text": "It was narrated that 'Abdullah said: \"Whoever would like to meet Allah tomorrow as a Muslim, let  him regularly attend these five (daily) prayers  whenever the call for them is given (that in the mosques), for Allah prescribed for\nHis Prophet the ways of guidance, and they (the prayers) are part of those ways of guidance. I do not think that there is anyone among you who does not have a place where he prays in his house. But if you were to pray in your houses and forsake the Masjids, you would be forsaking the Sunnah of your Prophet, and if you were to forsake the Sunnah of your\nProphet you would go astray. There is no Muslim slave who performs Wudu and does it well, then walks to the prayer, but Allah will record one Hasanah (good\ndeed) for each step he takes, or raise' him one level by it or erase one sin from him. I remember how we used to take short steps, and I remember (a time) when no one stayed behind from the prayer except\na hypocrite whose hypocrisy was well known. And I have seen a man coming Supported by two others until he would be made to stand in the row.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah said:", "reference": "https://sunnah.com/nasai:849", "inBookReference": "Book 10, Hadith 73"}, {"id": 74, "hadithNumber": "850", "text": "It was narrated that Abu Hurairah said: \"A blind man came to the Messenger of Allah (ﷺ)and said: 'I do not have a guide to bring me to the prayer.' And he asked him to grant him a dispensation allowing him to pray in his house, and he gave him permission. Then when he turned away he said to him: 'Can you hear the call to prayer?' He said: 'Yes.' He said: 'Then respond to it.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:850", "inBookReference": "Book 10, Hadith 74"}, {"id": 75, "hadithNumber": "851", "text": "It was narrated from Ibn Umm Maktum that he said: \"0 Messenger of Allah (ﷺ), there are many (dangerous) pests and wild animals in Al-Madinah.\" He said: \"Can you hear (the words) 'Come prayer, come to prosperity'?\" He said \"Yes.\" He said: \"Then be quick to respond,\" and he did not grant him a dispensation.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn Umm Maktum that he said:", "reference": "https://sunnah.com/nasai:851", "inBookReference": "Book 10, Hadith 75"}, {"id": 76, "hadithNumber": "852", "text": "It was narrated from Hisham bin 'Urwah from his father that 'Abdullih bin Arqam used to lead his companions in prayer. The time for prayer came one day and he went to relieve himself then he came back and said: \"I heard the Messenger of Allah (ﷺ) say: 'If any \none of you feels the need to defecate, let him do that first, before he prays.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:852", "inBookReference": "Book 10, Hadith 76"}, {"id": 77, "hadithNumber": "853", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) said: 'If dinner is ready and the Iqamah for prayer is said, then start with dinner first.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:853", "inBookReference": "Book 10, Hadith 77"}, {"id": 78, "hadithNumber": "854", "text": "It was narrated from Abu Al Malih that his father said: \"We were with the Messenger of Allah (ﷺ) in Hunain and it rained. The \ncaller of the Messenger of Allah (ﷺ)\ncalled out, telling us: 'Pray where\nyou are.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Al Malih that his father said:", "reference": "https://sunnah.com/nasai:854", "inBookReference": "Book 10, Hadith 78"}, {"id": 79, "hadithNumber": "855", "text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Whoever performs wudu' and does it well, then sets out for the Masjid and finds that the people have already prayed, Allah will decree for him a reward like that of those who attended \n(the prayer), without reducing the slightest from their reward.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:", "reference": "https://sunnah.com/nasai:855", "inBookReference": "Book 10, Hadith 79"}, {"id": 80, "hadithNumber": "856", "text": "It was narrated that 'Uthman bin 'Affan said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever does wudu' properly, then walks to (attend) the prescribed prayer, and prays with the people or with the congregation or in the Masjid, Allah will forgive him his sins.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Uthman bin 'Affan said:", "reference": "https://sunnah.com/nasai:856", "inBookReference": "Book 10, Hadith 80"}, {"id": 81, "hadithNumber": "857", "text": "It was narrated from Mihjan that he was in a gathering with the Messenger of Allah (ﷺ) when the Adhan was called for prayer. The  A Messenger of Allah (ﷺ) got up, then he came back and Mihjan was still sitting there. The Messenger of Allah (ﷺ) said to him: \"What kept you from praying? Are you not a Muslim man?\" He said: \"Yes, but I had already prayed with my family.\" The Messenger of Allah (ﷺ)said to him: \"When you come you should pray with the people even if you have already prayed.\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:857", "inBookReference": "Book 10, Hadith 81"}, {"id": 82, "hadithNumber": "858", "text": "Jabir bin Yazid bin Al-Aswad Al Amir told us that his father said: \"I attended Fajr prayer with the Messenger of Allah (ﷺ)in Masjid Al Khaif. When he  finished praying, he saw two men at the back of the people who had not prayed with him. He said: 'Bring them here.' So they were brought to him, trembling. He said: 'What kept you from praying with us? They said: '0 Messenger of Allah (ﷺ) we has already prayed in our lodgings.' He said: 'Do not do that. If you have already prayed in your lodgings, then you come to a Masjid in which there is a \ncongregation, then pray with them, and it will be a voluntary prayer for you.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:858", "inBookReference": "Book 10, Hadith 82"}, {"id": 83, "hadithNumber": "859", "text": "It was narrated that Ahu Dharr said: \"The Messenger of Allah (ﷺ) said to me, and struck my thigh: 'What will you do if you stay among people who delay the prayer until its time is over?' He said: 'What do you command me to do?' He said: 'Offer the prayer on time, then go about your business. Then if the Iqamah for that prayer is said\nand you are in the Masjid, then pray.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ahu Dharr said:", "reference": "https://sunnah.com/nasai:859", "inBookReference": "Book 10, Hadith 83"}, {"id": 84, "hadithNumber": "860", "text": "It was narrated that Sulaiman - the freed slave of Maimunah - said: \"I saw Ibn 'Umar sitting in Al-Balat when the people were\npraying. I said: '0 Abu 'Abdur- Rahman, why are you not praying?' He said: 'I have already prayed, and I heard the Messenger of\nAllah (ﷺ) say: \"Do not repeat a prayer twice in one day.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Sulaiman - the freed slave of Maimunah - said:", "reference": "https://sunnah.com/nasai:860", "inBookReference": "Book 10, Hadith 84"}, {"id": 85, "hadithNumber": "861", "text": "It was narrated that Abu Hurairah said: \"The Messenger of (ﷺ) said: 'When you come to \npray, do not come rushing; come walking in a dignified manner, and whatever you catch up with, pray, and whatever you miss, make it  \nup.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:861", "inBookReference": "Book 10, Hadith 85"}, {"id": 86, "hadithNumber": "862", "text": "It was narrated that Abu Rafi said: \"After the Messenger of Allah (ﷺ) had prayed Asr, he would go to Banu 'Abdul-Ashhal to speak to them, until the time for Maghrib came.\" Abu Rafi said: \"While the Prophet (ﷺ) was hastening to pray\nMaghrib, we passed by and he said: 'Fie on you, fie on you!' That upset me so I slowed down because I thought hat he meant me. He said: 'What is the matter with you? Keep up!' I said: 'Is there something wrong?' He\nsaid: 'Why are you asking that? I said: 'Because you said: \"Fie on you\" to me.' He said: 'No, that was so-and-so whom I had sent to collect Zakat from the tribe of so-and-so, and he stole a Namirah and now\nhe is clothed with something similar\nmade of Fire.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Abu Rafi said:", "reference": "https://sunnah.com/nasai:862", "inBookReference": "Book 10, Hadith 86"}, {"id": 87, "hadithNumber": "863", "text": "(Another chain) with similar from  Abu Rafi.", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:863", "inBookReference": "Book 10, Hadith 87"}, {"id": 88, "hadithNumber": "864", "text": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said: \"The likeness of one who comes early to prayer is that of one who  sacrificed a camel, then the one who comes after him is like one who sacrificed a cow, then the one who comes after him is like one who sacrificed a ram, then the one who comes after him is like one who sacrificed a chicken, then the one who comes after him is like one who sacrificed an egg.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:864", "inBookReference": "Book 10, Hadith 88"}, {"id": 89, "hadithNumber": "865", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) aid: 'When the Iqamah for prayer is said, there is no prayer except the prescribed prayer.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:865", "inBookReference": "Book 10, Hadith 89"}, {"id": 90, "hadithNumber": "866", "text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"When the Iqamah for prayer is said, there is no prayer except the prescribed prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:", "reference": "https://sunnah.com/nasai:866", "inBookReference": "Book 10, Hadith 90"}, {"id": 91, "hadithNumber": "867", "text": "It was narrated that Ibn Buhainah said: \"The Iqamah for Subh prayer was said, and the Messenger of Allah (ﷺ) saw a man praying while the Mu'adhdhin saying the Iqamah. He said: 'Are you praying Subh with four\nRak'ahs?\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn Buhainah said:", "reference": "https://sunnah.com/nasai:867", "inBookReference": "Book 10, Hadith 91"}, {"id": 92, "hadithNumber": "868", "text": "It was narrated that 'Abdullah bin Sarjis said: \"A man came while the Messenger of Allah (ﷺ) was praying Subh, and he prayed two Rak'ahs then joined the prayer. When the Messenger of Allah (ﷺ) had finished praying he said: O so-and-so, which of them is your prayer - the one you prayed with\nus or the one you prayed on your own?\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin Sarjis said:", "reference": "https://sunnah.com/nasai:868", "inBookReference": "Book 10, Hadith 92"}, {"id": 93, "hadithNumber": "869", "text": "Anas said: \"The Messenger of Allah (ﷺ) came to our house and I prayed with an orphan of ours behind him, and Umm Sulaim \nprayed behind us.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:869", "inBookReference": "Book 10, Hadith 93"}, {"id": 94, "hadithNumber": "870", "text": "It was narrated that Ibn Abbas said: \"There was a woman who used to pray behind the Messenger of Allah (ﷺ) who was beautiful, one of the most beautiful of people. Some of the people used to go to the front row to avoid seeing her, and some used to go to\nthe back row so that when they bowed they could see her from beneath their armpits. Then Allah revealed the words: 'To Us are\nknown those of you who hasten forward and those who lag behind.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that Ibn Abbas said:", "reference": "https://sunnah.com/nasai:870", "inBookReference": "Book 10, Hadith 94"}, {"id": 95, "hadithNumber": "871", "text": "Abu Bakrah narrated that he entered the Masjid when the when the Prophet (ﷺ) was bowing, so he bowed outside the row. The Prophet said: \"May Allah increase you in keenness, but do not do this again.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:871", "inBookReference": "Book 10, Hadith 95"}, {"id": 96, "hadithNumber": "872", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) prayed one day then left and said: '0 so-and-so, why don't you improve your prayer? Shouldn't the one who is praying reflection how he prays it for himself? I can see behind me just as I can see in front of me.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:872", "inBookReference": "Book 10, Hadith 96"}, {"id": 97, "hadithNumber": "873", "text": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) used to pray two Rak'ahs before Zuhr and two afterward, and he used to pray two Rak'ahs after Maghrib in  his house, and two Rak'ahs after 'Isha', and he did not pray after Jumu'ah until he departed (from the Masjid), then he would pray two Rak'ahs at home.\"", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:873", "inBookReference": "Book 10, Hadith 97"}, {"id": 98, "hadithNumber": "874", "text": "It was narrated from Abu Ishaq, that 'Asim bin Damrah said: \"We asked 'Ali about the prayer of the Messenger of Allah (ﷺ). He said: 'Who among you could manage to do that?' We said: 'Even if we cannot do it, we still want to hear about it.' He said: 'When the sun reached the same height (in the east) as it reaches (in the west) at the\ntime of 'Asr, he would pray two rak'ahs, and when the sun reached the same height (in the\neast) as it reaches (in the west) at the\ntime for Zuhr he would pray four Rak'ahs. He would pray four Rak'ahs before Zuhr and two after, and he would pray four Rak'ahs before 'Asr, separating each two Rak'ahs with Taslim upon the angels who are close to Allah, and the prophets, and those who follow them of the believers and Muslims.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Ishaq, that 'Asim bin Damrah said:", "reference": "https://sunnah.com/nasai:874", "inBookReference": "Book 10, Hadith 98"}, {"id": 99, "hadithNumber": "875", "text": "It was narrated from Abu Ishaq, that Asim bin Damrah said: \"I asked 'Ali bin Abi Talib about the prayer of the Messenger of Allah (ﷺ) during the day before the prescribed prayers. He said: 'Who is able to do that?' Then he told us:'The Messenger of Allah (ﷺ) used to pray two Rak'ahs when the sun had passed its zenith, and four Rak'ahs before the middle of the day, with the Taslim at the end.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Abu Ishaq, that Asim bin Damrah said:", "reference": "https://sunnah.com/nasai:875", "inBookReference": "Book 10, Hadith 99"}]}