{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 14, "bookName": "Chapter: The Obligation of Jumu'ah", "hadiths": [{"id": 1, "hadithNumber": "1367", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'We are the last (to come) but will be the foremost on the Day of Resurrection, but they were given the Book before us and we were given it after them. They differed concerning this day which Allah, the Mighty and Sublime, had prescribed for them and Allah, the Mighty and Sublime, guided us to\"--meaning Friday--\"so the people follow us, the Jews the next day and the Christians the day after that.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:1367", "inBookReference": "Book 14, Hadith 1"}, {"id": 2, "hadithNumber": "1368", "text": "It was narrated that Hudhaifah said: \"The Messenger of Allah (ﷺ) said: 'Allah  sent astray from Friday those who came before us, so the Jews had Saturday and the Christians had Sunday. Then Allah, the Mighty and Sublime, brought us and guided us to Friday, so there is Friday, Saturday and Sunday, and thus they will follow us on the Day of Resurrection. We are the last of the people of this world but the first on the Day of Resurrection for whom judgment will be passed before all other creatures.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hudhaifah said:", "reference": "https://sunnah.com/nasai:1368", "inBookReference": "Book 14, Hadith 2"}, {"id": 3, "hadithNumber": "1368", "text": "It was narrated that Abu Hurairah said: \"The first Jumu'ah that was held with the Messenger of Allah (ﷺ) in Makkah, was a Jum'ah in Juwatha in al-Bahrain, a village of 'Abdul-Qais.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:1368", "inBookReference": "Book 14, Hadith 3"}, {"id": 4, "hadithNumber": "1369", "text": "It was narrated from Abu Al-Ja'd Ad-Damri-who was a Companion of the Prophet (ﷺ)- that the Prophet (ﷺ) said: \"Whoever missed three jumu'ahs out of negligence, Allah will place a seal over his heart.\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1369", "inBookReference": "Book 14, Hadith 4"}, {"id": 5, "hadithNumber": "1369", "text": "It was narrated from Jabir bin 'Abdullah that: The Messenger of Allah (ﷺ) said: \"Whoever misses jumu'ah three times with no cogent excuse, Allah (SWT) will place a seal on his heart.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Jabir bin 'Abdullah that:", "reference": "https://sunnah.com/nasai:1369", "inBookReference": "Book 14, Hadith 5"}, {"id": 6, "hadithNumber": "1370", "text": "It was narrated from Al-Hakam bin Mina' that: He heard Ibn Abbas and Ibn Umar narrate that while he was on the minbar, the Messenger of Allah (ﷺ) said: \"People should stop neglecting Jumu'ah or Allah will place a seal on their hearts and they will be deemed as being among the negligent.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Al-Hakam bin Mina' that:", "reference": "https://sunnah.com/nasai:1370", "inBookReference": "Book 14, Hadith 6"}, {"id": 7, "hadithNumber": "1371", "text": "It was narrated from Hafsah, the wife of the Prophet (ﷺ) that: The Prophet (ﷺ) said: \"Going to Jumu'ah is obligatory for everyone who has reached the age of puberty.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Hafsah, the wife of the Prophet (ﷺ) that:", "reference": "https://sunnah.com/nasai:1371", "inBookReference": "Book 14, Hadith 7"}, {"id": 8, "hadithNumber": "1372", "text": "It was narrated that Samurah bin Jundub said: \"The Messenger of Allah (ﷺ) said: \"Whoever misses jumu'ah with no excuse, let him give a dinar in charity, and if he cannot afford that, then half a dinar.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that Samurah bin Jundub said:", "reference": "https://sunnah.com/nasai:1372", "inBookReference": "Book 14, Hadith 8"}, {"id": 9, "hadithNumber": "1372", "text": "It was narrated from Samurah that: The Prophet (ﷺ) said: \"Whoever misses jumu'ah deliberately, he has to give a dinar, and if he cannot afford that, then half a dinar.\" At another place, it is not mentioned: \"Deliberately.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Samurah that:", "reference": "https://sunnah.com/nasai:1372", "inBookReference": "Book 14, Hadith 9"}, {"id": 10, "hadithNumber": "1373", "text": "'Abdur-Rahman Al-A'raj narrated that: He heard Abu Hurairah say: \"The Messenger of Allah (ﷺ) said: 'The best day on which the sun rises is Friday. On this day, Adam, peace be upon him, was created, on this day he was admitted to Paradise, and on this day he was taken out of it.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1373", "inBookReference": "Book 14, Hadith 10"}, {"id": 11, "hadithNumber": "1374", "text": "It was narrated from Aws bin Aws that : The Prophet (ﷺ) said: \"One of the best of your days is Friday. On this day, Adam was created and on this day he died, on this day the Trumpet will be blown, and on this day all creatures will swoon. So send a great deal of salah upon me on this day, for your salah will be presented to me.\" They said: \"O Messenger of Allah (ﷺ), how will our salah be presented to you when you have decomposed (after death)?\" He said: \"Allah, the Mighty and Sublime, has forbidden the earth to consume the bodies of the prophets, peace be upon them.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated from Aws bin Aws that :", "reference": "https://sunnah.com/nasai:1374", "inBookReference": "Book 14, Hadith 11"}, {"id": 12, "hadithNumber": "1375", "text": "It was narrated (through two chains) from 'Abdur-Rahman bin Abi Sa'eed, from his father, that: The Messenger of Allah (ﷺ) said: \"Ghusl and using siwak on Fridays are obligatory for everyone who has reached the age of puberty, and he should put on whatever he can find of perfume.\" Except that Bukair (one of the narrators in one chain) did not mention 'Abdur-Rahman, and about the perfume he said: \"Even if it is women's perfume.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated (through two chains) from 'Abdur-Rahman bin Abi Sa'eed, from his father, that:", "reference": "https://sunnah.com/nasai:1375", "inBookReference": "Book 14, Hadith 12"}, {"id": 13, "hadithNumber": "1376", "text": "It was narrated from Ibn 'Umar that: The Messenger of Allah (ﷺ) said: \"When any one of you wants to come to Jumu'ah prayer, let him perform ghusl.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:1376", "inBookReference": "Book 14, Hadith 13"}, {"id": 14, "hadithNumber": "1377", "text": "It was narrated from Abu Sa'eed Al-Khudri that: The Messenger of Allah (ﷺ) said: \"Ghusl on Friday is obligatory for everyone who has reached the age of puberty.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Sa'eed Al-Khudri that:", "reference": "https://sunnah.com/nasai:1377", "inBookReference": "Book 14, Hadith 14"}, {"id": 15, "hadithNumber": "1378", "text": "It was narrated that Jabir said: \"The Messenger of Allah (ﷺ) said: 'Every Muslim man has to perform Ghusl one day in every seven, and that is on Friday.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:1378", "inBookReference": "Book 14, Hadith 15"}, {"id": 16, "hadithNumber": "1379", "text": "'Abdullah bin Al-'Ala narrated that: He heard Al-Qasim bin Muhammad bin Abi Bakr (say) that they mentioned Ghusl on Fridays in the presence of 'Aishah and she said: \"Some people used to live in Al-'Aliyah and they would come to Jumu'ah with dirt on them (because of their work). When a breeze came it would carry their smell to the people which annoyed them. Mention of that was made to the Messenger of Allah (ﷺ) and he said: \"Why don't you perform Ghusl?\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1379", "inBookReference": "Book 14, Hadith 16"}, {"id": 17, "hadithNumber": "1380", "text": "It was narrated that Samurah said: \"The Messenger of Allah (ﷺ) said: 'Whoever performs wudu' on Friday, that is all well and good, but whoever performs Ghusl, the Ghusl is better.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Samurah said:", "reference": "https://sunnah.com/nasai:1380", "inBookReference": "Book 14, Hadith 17"}, {"id": 18, "hadithNumber": "1381", "text": "It was narrated from Aws bin Aws that: The Prophet (ﷺ) said: \"Whoever washes (Ghassala) and performs Ghusl, comes early to the Masjid and sits near the Imam, and does not engage in idle talk, he will have for every step he takes (the reward of) a year's worth of good deeds, fasting it and praying Qiyam during it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Aws bin Aws that:", "reference": "https://sunnah.com/nasai:1381", "inBookReference": "Book 14, Hadith 18"}, {"id": 19, "hadithNumber": "1382", "text": "It was narrated from 'Abdullah bin 'Umar that : 'Umar bin al-Khattab saw a Hullah and said: \"O Messenger of Allah (ﷺ), why don't you buy this and wear it on Fridays and when meeting the delegations when they come to you?\" The Messenger of Allah (ﷺ) said: \"This is worn by one who has no share in the Hereafter.\" Then something similar was brought to the Messenger of Allah (ﷺ) and he gave a Hullah to 'Umar from it. 'Umar said: \"O Messenger of Allah (ﷺ), have you given me this when you said what you said about the Hullah of 'Utarid?\" The Messenger of Allah (ﷺ) said: \"I have not given it to you to wear it.\" So 'Umar gave it to an idolator brother of his in Makkah.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin 'Umar that :", "reference": "https://sunnah.com/nasai:1382", "inBookReference": "Book 14, Hadith 19"}, {"id": 20, "hadithNumber": "1383", "text": "It was narrated from 'Abdur-Rahman bin Abi Sa'eed, from his father, that: The Messenger of Allah (ﷺ) said: \"Ghusl should be performed on Friday by everyone who has reached the age of puberty, and using the siwak, and he should put on whatever he is able of using perfume.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdur-Rahman bin Abi Sa'eed, from his father, that:", "reference": "https://sunnah.com/nasai:1383", "inBookReference": "Book 14, Hadith 20"}, {"id": 21, "hadithNumber": "1384", "text": "Abu Al-Ash'ath narrated that: He heard Aws bin Aws, the Companion of the Messenger of Allah (ﷺ) say: \"The Messenger of Allah (ﷺ) said: 'Whoever performs Ghusl on Friday and washes (Ghassala), and comes early to the Masjid, walking not riding, and sits close to the Imam and listens attentively and does not engage in idle speech, for every step he takes he will have (the reward of) a year's worth of good deeds.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1384", "inBookReference": "Book 14, Hadith 21"}, {"id": 22, "hadithNumber": "1385", "text": "It was narrated from Abu Hurairah that: The Prophet (ﷺ) said: \"When Friday comes, the angels sit at the doors of the Masjid and record who comes to Jumu'ah prayers. Then, when the Imam comes out, the angels roll up their scrolls.\" The Messenger of Allah (ﷺ) said: 'The one who comes early to Jumu'ah prayers is like one who sacrifices a camel, then like one who sacrifices a cow, then like one who sacrifices a sheep, then like one who sacrifices a duck, then like one who sacrifices a chicken, then like one who sacrifices an egg.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:1385", "inBookReference": "Book 14, Hadith 22"}, {"id": 23, "hadithNumber": "1386", "text": "It was narrated from Abu Hurairah, who was attributing it to the Prophet (ﷺ): \"When Friday comes, at every gate of the masjid there are angels who write down the people's names in the order in which they come, then when the Imam comes out, they roll up the scrolls and listen to the Khutbah. The one who comes early to the prayer is like the one who sacrifices a camel, then the one who comes after him is like the one who sacrifices a cow, then the one who comes after him is like the one who sacrifices a ram\" until he mentioned a chicken and an egg.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah, who was attributing it to the Prophet (ﷺ):", "reference": "https://sunnah.com/nasai:1386", "inBookReference": "Book 14, Hadith 23"}, {"id": 24, "hadithNumber": "1387", "text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: \"On Fridays the angels sit at the gates of the Masjid writing down the peoples' names in the order in which they come. So the people are like a man who sacrifices a camel and like a man who sacrifices a camel, then like a man who sacrifices a cow and like a man who sacrifices a cow, then like a man who sacrifices a sheep and like a man who sacrifices a sheep, then like a man who sacrifices a chicken and like a man who sacrifices a chicken, then like a man who sacrifices a sparrow and like a man who sacrifices a sparrow, then like a man who sacrifices an egg and like a man who sacrifices an egg.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:1387", "inBookReference": "Book 14, Hadith 24"}, {"id": 25, "hadithNumber": "1388", "text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: \"Whoever performs Ghusl as from Janabah on Friday, then comes (to the Masjid), it is as if he sacrificed a camel. Then the one who comes in the second hour, it is as if he sacrificed a cow. Then the one who comes in the third hour, it is as if he sacrificed a ram. Then the one who comes in the fourth hour, it is as if he sacrificed a chicken. Then the one who comes in the fifth hour, it is as if he sacrificed an egg. Then when the Imam comes out, the angels attend to listen to the Khutbah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:1388", "inBookReference": "Book 14, Hadith 25"}, {"id": 26, "hadithNumber": "1389", "text": "It was narrated from Jabir bin 'Abdullah that: The Messenger of Allah (ﷺ) said: \"Friday is twelve hours in which there is no Muslim slave who asks Allah (SWT) for something but He will give it to him, so seek it in the last hour after 'Asr.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir bin 'Abdullah that:", "reference": "https://sunnah.com/nasai:1389", "inBookReference": "Book 14, Hadith 26"}, {"id": 27, "hadithNumber": "1390", "text": "It was narrated that Ja'far bin Muhammad from his father, from Jabir bin 'Abdullah who said: \"We used to pray Jumu'ah with the Messenger of Allah (ﷺ) then we would go back and tend to our camels.\" I said: \" At what time?\" He said: \"When the sun had passed its zenith.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ja'far bin Muhammad from his father, from Jabir bin 'Abdullah who said:", "reference": "https://sunnah.com/nasai:1390", "inBookReference": "Book 14, Hadith 27"}, {"id": 28, "hadithNumber": "1391", "text": "Iyas bin Salamah bin Al-Akwa' narrated that his father said: \"We used to  pray Jumu'ah with the Messenger of Allah (ﷺ) then we would go back, and the walls had no shadow in which shade could be sought.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1391", "inBookReference": "Book 14, Hadith 28"}, {"id": 29, "hadithNumber": "1392", "text": "As-Sa'ib bin Yazid narrated that: The first Adhan used to be when the Imam sat on the Minbar on Friday, at the time of the Messenger of Allah (ﷺ) and Abu Bakr and 'Umar. During the caliphate of 'Uthman, when the number of people increased, 'Uthman commanded that a third Adhan be given on Friday, so that Adhan was given from the top of Az-Zawra, and that is how it remained.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1392", "inBookReference": "Book 14, Hadith 29"}, {"id": 30, "hadithNumber": "1393", "text": "As-Sa'ib bin Yazid said: \"The third Adhan was ordered by 'Uthman when the number of people in Al-Madinah increased. The Messenger of Allah (ﷺ) only had one Adhan, and the Adhan on Friday was when the Imam sat down.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1393", "inBookReference": "Book 14, Hadith 30"}, {"id": 31, "hadithNumber": "1394", "text": "It was narrated that As-Sa'ib bin Yazid said: \"Bilal used to call the Adhan when the Messenger of Allah (ﷺ) sat on the Minbar on Friday, and when he came down he would say the Iqamah. It continued like that during the time of Abu Bakr and 'Umar, may Allah (SWT) be pleased with them.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that As-Sa'ib bin Yazid said:", "reference": "https://sunnah.com/nasai:1394", "inBookReference": "Book 14, Hadith 31"}, {"id": 32, "hadithNumber": "1395", "text": "It was narrated that 'Amr bin Dinar said: \"I heard Jabir bin 'Abdullah say: 'The Messenger of Allah (ﷺ) said: \"If any one of you comes and the Imam has appeared, let him pray two Rak'ahs. Shu'bah (one of the narrators) said: \"On Friday.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Amr bin Dinar said:", "reference": "https://sunnah.com/nasai:1395", "inBookReference": "Book 14, Hadith 32"}, {"id": 33, "hadithNumber": "1396", "text": "Jabir bin 'Abdullah said: \"When the Messenger of Allah (ﷺ) delivered the khutbah, he used to lean against a palm tree trunk that formed one of the pillars of the Masjid. When the Minbar was made and he sat down on it, that pillar made a sound like the groaning of a camel, which the people of the Masjid heard, until the Messenger of Allah (ﷺ) came down and embraced it, then it fell silent.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1396", "inBookReference": "Book 14, Hadith 33"}, {"id": 34, "hadithNumber": "1397", "text": "It was narrated that Ka'b bin 'Ujrah said that: He entered the masjid and 'Abdur-Rahman bin Umm Al-Hakam was delivering the Khutbah while seated. \"He said: 'Look at this man who is delivering the khutbah while seated when Allah (SWT) says: And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ka'b bin 'Ujrah said that:", "reference": "https://sunnah.com/nasai:1397", "inBookReference": "Book 14, Hadith 34"}, {"id": 35, "hadithNumber": "1398", "text": "It was narrated from Aws bin Aws Ath-Thaqafi that : The Messenger of Allah (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, and comes early to the masjid and sits near the imam, is attentive and does not engage in idle talk, for every step he takes he will have (the reward of) a year's worth of good deeds, its fasting and Qiyam prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Aws bin Aws Ath-Thaqafi that :", "reference": "https://sunnah.com/nasai:1398", "inBookReference": "Book 14, Hadith 35"}, {"id": 36, "hadithNumber": "1399", "text": "It was narrated from Abu Az-Zahiriyah about 'Abdullah bin Busr, he said: \"I was sitting beside him on Friday and he said: 'A man came, stepping over people's necks, and the Messenger of Allah (ﷺ) said: 'Sit down, you are disturbing people.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Az-Zahiriyah about 'Abdullah bin Busr, he said:", "reference": "https://sunnah.com/nasai:1399", "inBookReference": "Book 14, Hadith 36"}, {"id": 37, "hadithNumber": "1400", "text": "'Amr bin Dinar narrated that: He heard Jabir bin 'Abdullah say: \"A man came when the Prophet (ﷺ) was on the minbar on a Friday. He said to him: 'Have you prayed two rak'ahs?' He said: 'No.' He said: 'Pray.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1400", "inBookReference": "Book 14, Hadith 37"}, {"id": 38, "hadithNumber": "1401", "text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: \"Whoever says to his companion on Friday, when the imam is delivering the khutbah: 'Listen attentively,' has engaged in idle talk.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:1401", "inBookReference": "Book 14, Hadith 38"}, {"id": 39, "hadithNumber": "1402", "text": "It was narrated from 'Abdullah bin Ibrahim bin Qariz and Sa'eed bin Al-Musayyab that: Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'If you say to your companion: Listen attentively on a Friday when the Imam is delivering the khutbah, then you have engaged in idle talk.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin Ibrahim bin Qariz and Sa'eed bin Al-Musayyab that:", "reference": "https://sunnah.com/nasai:1402", "inBookReference": "Book 14, Hadith 39"}, {"id": 40, "hadithNumber": "1403", "text": "It was narrated that Salman said: \"The Messenger of Allah (ﷺ) said to me: 'There is no man who purifies himself on Friday as he is commanded, then comes out of his house to the Friday prayer, and listens attentively until he finishes his prayer, but it will be an expiation for what came before it the week before.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Salman said:", "reference": "https://sunnah.com/nasai:1403", "inBookReference": "Book 14, Hadith 40"}, {"id": 41, "hadithNumber": "1404", "text": "It was narrated from 'Abdullah: \"The Prophet (ﷺ) taught us Khutbat Al-Hajah: Alhamduu lillahi nasta'inuhu wa nastagfiruhu, wa na'udhu billahi min shururi anfusina wa sayi'ati a'malina. Man yahdihillahu fala mudilla lahu wa man yudlil fala hadiya lahu. Wa ashhadu an la ilaha illallahu wa ashhadu anna Muhammadan 'abduhu wa rasuluhu. (Praise be to Allah, we seek His help and His forgiveness. We seek refuge in Allah from the evil of our own souls and from our bad deeds. Whomsoever Allah guides will never be led astray,and whomsoever Allah leaves astray, no one can guide. I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is His slave and Messenger.) Then he recited the following three verses: O you who believe! Fear Allah as He should be feared, and die not except as Muslims; O Mankind! Be dutiful to your Lord, Who created you from a single person, and from him he created his wife, and from them he created many men and women, and fear Allah through Whom you demand your mutual (rights), and (do not cut the relations of) the wombs (kinship). Surely, Allah is Ever an All-Watcher over you); O you who believe! Keep your duty to Allah and fear Him, and speak (always) the truth.)\"", "grade": null, "narratedBy": "It was narrated from 'Abdullah:", "reference": "https://sunnah.com/nasai:1404", "inBookReference": "Book 14, Hadith 41"}, {"id": 42, "hadithNumber": "1405", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (ﷺ) delivered a khutbah and said: 'When any one of you wants to go to  Jumu'ah, let him perform ghusl.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:1405", "inBookReference": "Book 14, Hadith 42"}, {"id": 43, "hadithNumber": "1406", "text": "It was narrated from Ibrahim bin Nashit that: He asked Ibn Shihab about ghusl on Friday. He said: \"It is a sunnah; Salim bin 'Abdullah told me, narrating from his father, that the Messenger of Allah (ﷺ) spoke about it from the minbar.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibrahim bin Nashit that:", "reference": "https://sunnah.com/nasai:1406", "inBookReference": "Book 14, Hadith 43"}, {"id": 44, "hadithNumber": "1407", "text": "It was narrated from 'Abdullah bin 'Abdullah (from 'Abdullah) Ibn 'Umar that: While he was standing on the minbar, the Messenger of Allah (ﷺ) said: \"Whoever among you comes (to prayer) on a Friday, let him perform ghusl.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin 'Abdullah (from 'Abdullah) Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:1407", "inBookReference": "Book 14, Hadith 44"}, {"id": 45, "hadithNumber": "1408", "text": "It was narrated that Iyad bin 'Abdullah said: \"I heard Abu Sa'eed Al-Khudri say: 'A man who appeared shabbily came on a Friday, while the Prophet (ﷺ) was delivering the Khutbah. The Messenger of Allah (ﷺ) said to him: 'Have you prayed?\" He said: 'No.\" He said: 'Pray two rak'ahs.' And he urged the people to give in charity. They gave clothes, and he gave him two garments. The following Friday, he came when the Messenger of Allah (ﷺ) was delivering the khutbah, and he urged the people to give charity. (That man) gave one of his two garments and the Messenger of Allah (ﷺ) said: 'This man came last Friday looking shabby, and I commanded the people to give charity and they gave clothes, and I said that he should be given two garments, and now he came and I commanded the people to give charity and he gave one of them. So he chided him and said: Take your garment.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Iyad bin 'Abdullah said:", "reference": "https://sunnah.com/nasai:1408", "inBookReference": "Book 14, Hadith 45"}, {"id": 46, "hadithNumber": "1409", "text": "It was narrated from Jabir bin 'Abdullah who said: \"While the Prophet (ﷺ) was delivering the khutbah on Friday, a man came and the Prophet (ﷺ) said: 'Have you prayed?' He said: 'No.' He said: Stand up and pray.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir bin 'Abdullah who said:", "reference": "https://sunnah.com/nasai:1409", "inBookReference": "Book 14, Hadith 46"}, {"id": 47, "hadithNumber": "1410", "text": "Abu Bakrah said: \"I saw the Messenger of Allah (ﷺ) on the Minbar, and Al-Hasan was with him. He would turn to the people sometimes and turn to him (Al-Hasan) sometimes, and he said: 'This son of mine is a leader (Sayyid) and Allah may make peace between two large groups of Muslims through him.'\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1410", "inBookReference": "Book 14, Hadith 47"}, {"id": 48, "hadithNumber": "1411", "text": "It was narrated from Muhammad bin 'Abdur-Rahman that: The daughter of Harithah bin An-Nu'man said: \"I memorized 'Qaf. By the Glorious Qur'an,'\" from the mouth of the Messenger of Allah (ﷺ) when he was on the minbar on Friday.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Muhammad bin 'Abdur-Rahman that:", "reference": "https://sunnah.com/nasai:1411", "inBookReference": "Book 14, Hadith 48"}, {"id": 49, "hadithNumber": "1412", "text": "It was narrated from Sufyan bin Husain that : Bishr bin Marwan raised his hands on Friday on the minbar, and 'Umarah bin Ruwaibah condemned him and said: \"The Messenger of Allah (ﷺ) did no more than this,' and he pointed with his forefinger.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Sufyan bin Husain that :", "reference": "https://sunnah.com/nasai:1412", "inBookReference": "Book 14, Hadith 49"}, {"id": 50, "hadithNumber": "1413", "text": "It was narrated from 'Abdullah bin Buraidah that his father said: \"The Prophet (ﷺ) was preaching, then Al-Hasan and Al-Husain came, wearing red shirts and stumbling in them. The Prophet (ﷺ) came down, interrupting himself, and picked them up, then he went back to the minbar and said: 'Allah has spoken the truth: Your wealth and your children are only a trial (At-Taghabun 64:15). I saw these two stumbling in their shirts and I could not continue until I had interrupted myself and picked them up.'\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin Buraidah that his father said:", "reference": "https://sunnah.com/nasai:1413", "inBookReference": "Book 14, Hadith 50"}, {"id": 51, "hadithNumber": "1414", "text": "'Abdullah bin Abi Awfa said: \"The Messenger of Allah (ﷺ) used to recite a great deal of remembrance, engage little in idle talk, make the prayer long and keep the khutbah short, and he would not refrain from walking with a widow or poor person and tending to their needs.\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1414", "inBookReference": "Book 14, Hadith 51"}, {"id": 52, "hadithNumber": "1415", "text": "It was narrated that Jabir bin Samurah said: \"I sat with the Prophet (ﷺ) and I did not see him deliver the khutbah except standing, and he sat, then he stood up and delivered the second khutbah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin Samurah said:", "reference": "https://sunnah.com/nasai:1415", "inBookReference": "Book 14, Hadith 52"}, {"id": 53, "hadithNumber": "1416", "text": "It was narrated from 'Abdullah that: The Messenger of Allah (ﷺ) used to deliver two khutbahs standing, and he would separate them by sitting.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah that:", "reference": "https://sunnah.com/nasai:1416", "inBookReference": "Book 14, Hadith 53"}, {"id": 54, "hadithNumber": "1417", "text": "It was narrated that Jabir bin Samurah said: \"I saw the Messenger of Allah (ﷺ) delivering the khutbah on Friday standing, then he sat briefly and did not speak, then he stood up and delivered a second khutbah. So whoever tells you that the Messenger of Allah (ﷺ) used to deliver the khutbah seated, he has lied.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin Samurah said:", "reference": "https://sunnah.com/nasai:1417", "inBookReference": "Book 14, Hadith 54"}, {"id": 55, "hadithNumber": "1418", "text": "It was narrated that Jabir bin Samurah said: \"The Prophet (ﷺ) used to deliver the khutbah standing, then he would sit, then he would stand up and recite some Verses and remember Allah, the Mighty and Sublime. His khutbah was moderate in length and his prayer was moderate in length.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin Samurah said:", "reference": "https://sunnah.com/nasai:1418", "inBookReference": "Book 14, Hadith 55"}, {"id": 56, "hadithNumber": "1419", "text": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) would come down from the minbar and a man would come to him and speak to him, then the Prophet (ﷺ) would listen to him until he gave him an answer, then he would go to his place of prayer and pray.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:1419", "inBookReference": "Book 14, Hadith 56"}, {"id": 57, "hadithNumber": "1420", "text": "It was narrated from 'Abdur-Rahman bin Abi Laila that 'Umar said: \"Jumu'ah prayer is two rak'ahs, and the prayer of Al-Fitr is two rak'ahs, and the prayer of Al-Adha is two rak'ahs, and the prayer when traveling is two rak'ahs, complete and not shortened, on the tongue of Muhammad (ﷺ).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdur-Rahman bin Abi Laila that 'Umar said:", "reference": "https://sunnah.com/nasai:1420", "inBookReference": "Book 14, Hadith 57"}, {"id": 58, "hadithNumber": "1421", "text": "It was narrated from Ibn 'Abbas that : During the Subh prayer on Friday, the Messenger of Allah (ﷺ) used to recite: \"Alif-Lam-Mim. The Revelation\"(As-Sajdah 32) and: \"Has there not been over man,\"(Al-Insan 76) and in Jumu'ah prayer he would recite Al-Jumu'ah (62) and Al-Munafiqin (63).", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Abbas that :", "reference": "https://sunnah.com/nasai:1421", "inBookReference": "Book 14, Hadith 58"}, {"id": 59, "hadithNumber": "1422", "text": "It was narrated that Samurah said: \"The Messenger of Allah (ﷺ) used to recite in Jumu'ah prayer: 'Glorify the Name of your Lord, the Most High'(Al-A'la 87) and: 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?\"(Al-Ghashiyah 88)", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Samurah said:", "reference": "https://sunnah.com/nasai:1422", "inBookReference": "Book 14, Hadith 59"}, {"id": 60, "hadithNumber": "1423", "text": "Ad-Dahhak bin Qais asked An-Nu'man bin Bashir: \"What did the Messenger of Allah (ﷺ) use to recite on Friday after Surat Al-Jumu'ah?\" He said: \"He used to recite: 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?'\" (Al-Ghashiyah 88)", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1423", "inBookReference": "Book 14, Hadith 60"}, {"id": 61, "hadithNumber": "1424", "text": "It was narrated that An-Nu'man bin Bashir said: \"The Messenger of Allah (ﷺ) used to recite 'Glorify the name of your Lord, the Most High'(Al-A'la 87) and 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?' (Al-Ghashiyah 88) in the Jumu'ah prayer, and sometimes 'Eid and Jumu'ah would fall on the same day, and he would recite them in both 'Eid and Jumu'ah prayer.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that An-Nu'man bin Bashir said:", "reference": "https://sunnah.com/nasai:1424", "inBookReference": "Book 14, Hadith 61"}, {"id": 62, "hadithNumber": "1425", "text": "It was narrated from Abu Hurairah that: The Prophet (ﷺ) said: \"Whoever catches up with a rak'ah of Jumu'ah prayer has caught up with it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:1425", "inBookReference": "Book 14, Hadith 62"}, {"id": 63, "hadithNumber": "1426", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'When any one of you prays Jumu'ah let him pray four (rak'ahs) after that.'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:1426", "inBookReference": "Book 14, Hadith 63"}, {"id": 64, "hadithNumber": "1427", "text": "It was narrated from Ibn 'Umar that: The Messenger of Allah (ﷺ) would not pray after Jumu'ah until he had left, then he would pray two rak'ahs. (Sahih)", "grade": null, "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:1427", "inBookReference": "Book 14, Hadith 64"}, {"id": 65, "hadithNumber": "1428", "text": "It was narrated from Salim that his father said: \"The Messenger of Allah (ﷺ) used to pray two rak'ahs in his house after Jumu'ah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim that his father said:", "reference": "https://sunnah.com/nasai:1428", "inBookReference": "Book 14, Hadith 65"}, {"id": 66, "hadithNumber": "1429", "text": "It was narrated from Ibn 'Umar that he used to pray two rak'ahs after Jumu'ah, making them lengthy, and he said: \"The Messenger of Allah (ﷺ) used to do this.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:1429", "inBookReference": "Book 14, Hadith 66"}, {"id": 67, "hadithNumber": "1430", "text": "It was narrated that Abu Hurairah said: \"I went out to At-Tur and met Ka'b. He and I spent a day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it his repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah for something, He will give it to him. Ka'b said: Is that one day in every year? I said: No, it is every Friday.' Then Ka'b read in the Tawrah and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. Then I went out and met Basrah bin Abi Basrah Al-Ghifari. He said: From where have you come? I said: From At-Tur. He said: If I had met you before you went there, you would not have gone. I said to him: Why? He said: I heard the Messenger of Allah (ﷺ) say: Do not travel especially to visit any masjid except three: Al Masjid Al-Haram (in Makkah), my masjid (in Al-Madinah) and the Masjid of Bait Al-Maqdis (in Jerusalem). Then I met 'Abdullah bin Salam and said: 'If you had only seen me, I went to At-Tur and met Ka'b, and he and I spent the day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on this day his repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah for something, He will give it to him. Ka'b said: That is one day in every year. 'Abdullah bin Salam said: Ka'b is not telling the truth. I said: Then Ka'b read (in the Tawrah) and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. 'Abdullah said: Ka'b spoke the truth; I know when that time is. I said: O my brother, tell me about it. He said: It is the last hour of Friday, before the sun sets. I said: Did you not hear the Messenger of Allah (ﷺ) say: If a believer prays, but that is not a time for prayer. He said: Did you not hear the Messenger of Allah (ﷺ) say: Whoever prays and sits waiting for the (next) prayer, is in a state of prayer until the next prayer comes? I said: Of course. He said: That is what it is.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:1430", "inBookReference": "Book 14, Hadith 67"}, {"id": 68, "hadithNumber": "1431", "text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: \"On Friday, there is an hour when, if a Muslim slave asks Allah for something at that time, He will give it to him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:1431", "inBookReference": "Book 14, Hadith 68"}, {"id": 69, "hadithNumber": "1432", "text": "It was narrated that Abu Hurairah said: \"Abu Al-Qasim (ﷺ) said: 'On Friday, there is an hour when, if a Muslim slave stands in prayer and asks Allah for something at that time, He will give it to him.'\" He was reducing it: lessening it.", "grade": null, "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:1432", "inBookReference": "Book 14, Hadith 69"}]}