{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 41, "bookName": "Chapter: There Is No Fara ' And No  'Atirah", "hadiths": [{"id": 1, "hadithNumber": "4222", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"There is no fara' and no' Atirah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4222", "inBookReference": "Book 41, Hadith 1"}, {"id": 2, "hadithNumber": "4223", "text": "It was narrated that Abu Hurairah that: the Messenger of Allah forbade Fara' and 'Atirah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah that:", "reference": "https://sunnah.com/nasai:4223", "inBookReference": "Book 41, Hadith 2"}, {"id": 3, "hadithNumber": "4224", "text": "Mikhnaf bin Sulaim said: \"While we were standing with the Messenger of Allah at 'Arafat, he said: 'O people, it is upon each family to offer a sacrifice (Udhiyah) and an 'Atirah each year.\" (One of the narrators) Muadh said: \"Ibn 'Awn used to offer slaughter the 'Atirah, and I saw that with my own eyes during Rajab.\" (Daif)", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4224", "inBookReference": "Book 41, Hadith 3"}, {"id": 4, "hadithNumber": "4225", "text": "'Amr bin Shu'aib bin Muhammad bin 'Abdullah bin 'Amr (narrated) that his father and Zaid bin Aslam said: \"O Messenger of Allah! (What about) the Fara'?\" He said: \"It is a duty, but if you leave it (the animal) until it becomes half-grown and you load upon it (in Jihad) in the cause of Allah or give it to a widow, that is better than if you slaughter it (when it is just born) and its flesh is difficult to separate from its skin, then you turn your vessel upside down (because you will no longer be able to get milk from the mother) and you cause your she-camel to grieve (at the loss of its young).\" They said: \"O Messenger of Allah, (what about) the 'Atirah?\" He said: \"The 'Atirah is a duty.\" (Hasan)\nAbu 'Abdur-Rahman (An-Nasa'i) said:  Abu 'Ali Al-Hanafi (one of the narrators); they are four brothers: One of them is Abu Bakr, and Bishr, and Sharik, and the other.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4225", "inBookReference": "Book 41, Hadith 4"}, {"id": 5, "hadithNumber": "4226", "text": "It was narrated that Yahya bin Zurarah bin Karim bin Al-Harith bin 'Amr Al-Bahili said: \"I heard my father say, that he heard his grandfather Al-Harith bin 'Amr, that he met the Messenger of Allah during the Farewell Pilgrimage, when he was atop his slit-eared camel. (He said): 'I said: O Messenger of Allah, May my father and mother be ransomed for you; pray for forgiveness for me. He said: May Allah forgive you (plural). Then I came to him from the other side, hoping that he would supplicate just for me alone, and not them. I said: O Messenger of Allah, pray for forgiveness for me. He said: May Allah forgive you (plural). Then a man among the people said: O Messenger of Allah, (what about) the 'Atirah and Fara'? He said: Whoever wishes to offer and 'Atirah may do so, and whoever does not wish to, may not. Whoever wishes to offer a Fara' may do so, and whoever does not wish to, may not. And with regard to sheep, a sacrifice should be offered. And he clasped between his fingers except for one.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Yahya bin Zurarah bin Karim bin Al-Harith bin 'Amr Al-Bahili said:", "reference": "https://sunnah.com/nasai:4226", "inBookReference": "Book 41, Hadith 5"}, {"id": 6, "hadithNumber": "4227", "text": "Yahya bin Zurarah As-Sahmi said: \"My father narrated to me from his grandfather, Al-Harith bin 'Amr that he met the Messenger of Allah during the Farewell Pilgrimage and said: 'May my father and mother be sacrificed for you! O Messenger of Allah; pray for forgiveness for me.' He said: 'May Allah forgive you (plural).' He was atop his slit-eared camel and I came around to the other side\"' and he quoted the Hadith.", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4227", "inBookReference": "Book 41, Hadith 6"}, {"id": 7, "hadithNumber": "4228", "text": "It was narrated that Nubaishah said: \"It was said to the prophet: 'During the Jahiliyyah we used to offer the 'Atirah.' He said: 'Slaughter for the sake of Allah, the Mighty and sublime, no matter what month it is; do good for the sake of Allah, the Mighty and sublime, and feed the poor.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Nubaishah said:", "reference": "https://sunnah.com/nasai:4228", "inBookReference": "Book 41, Hadith 7"}, {"id": 8, "hadithNumber": "4229", "text": "It was narrated that Nubaishah said: \"A man called out while he was in Mina and said: 'O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?' He said: 'Sacrifice during whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' They said: 'O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of you flock until it reaches an age where it could be used carry loads, then sacrifice it, and give its meat in charity.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Nubaishah said:", "reference": "https://sunnah.com/nasai:4229", "inBookReference": "Book 41, Hadith 8"}, {"id": 9, "hadithNumber": "4230", "text": "It was narrated from Nubaishah, a man of Hudhail, that the Prophet said: \"I used to forbid you to store the meat of the sacrifices for more than three days so that there would be enough for everyone. But now Allah, the mighty and sublime, has bestowed plenty upon us, so eat some, give some in charity and store some, For these days are the days of eating, drinking and remembering Allah.\" A man said: \"O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?\" He said: \"Sacrifice to Allah, the Mighty and Sublime, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).\" He said: \"O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?\" He said: \"For every flock of grazing animals, feed the firstborn as you feed the rest of your flock, until it reaches an age where it could be used to carry loads, then sacrifice it, and give its meat in charity to the wayfarer, for that is good.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Nubaishah, a man of Hudhail, that the Prophet said:", "reference": "https://sunnah.com/nasai:4230", "inBookReference": "Book 41, Hadith 9"}, {"id": 10, "hadithNumber": "4231", "text": "It was narrated that Nubaishah said: \"A man called out to the Prophet and said: 'We used to sacrifice the 'Atirah - i.e., during the Jahiliyyah - in Rajab; what do you command us to do?' He said: 'Sacrifice, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' He said: 'We used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of your flock until it reaches an age where it could be used to carry loads, then sacrifice it, and give its meat in charity, for that is good.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Nubaishah said:", "reference": "https://sunnah.com/nasai:4231", "inBookReference": "Book 41, Hadith 10"}, {"id": 11, "hadithNumber": "4232", "text": "It was narrated that Nubaishah Al-Hudhaili said: \"A man said: 'O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?' He said: 'Sacrifice to Allah, the Mighty and Sublime, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Nubaishah Al-Hudhaili said:", "reference": "https://sunnah.com/nasai:4232", "inBookReference": "Book 41, Hadith 11"}, {"id": 12, "hadithNumber": "4233", "text": "It was narrated that Abu Razin Laqit bin 'Amir Al-Uqaili said: \"I said: 'O Messenger of Allah, we used to offer sacrifices during the Jahiliyyah in Rajab, and eat of (their meat) and offer some to those who came to us.' The Messenger of Allah said: 'There is nothing wrong with that.\"' (One of the narrators) Waki bin 'Udus said: \"I will not leave it.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Abu Razin Laqit bin 'Amir Al-Uqaili said:", "reference": "https://sunnah.com/nasai:4233", "inBookReference": "Book 41, Hadith 12"}, {"id": 13, "hadithNumber": "4234", "text": "It was narrated from Ibn 'Abbas, from Maimunah, that: the Prophet passed by a dead sheep that had been thrown aside. He said: \"Who does this belong to?\" They said: \"Maimunah.\" He said: \"Why did she not make use of its skin?\" They said: \"It is dead meat (i.e., it was not slaughtered properly).\" He said: \"Allah, the Mighty and Sublime, has only forbidden us to eat  it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Abbas, from Maimunah, that:", "reference": "https://sunnah.com/nasai:4234", "inBookReference": "Book 41, Hadith 13"}, {"id": 14, "hadithNumber": "4235", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah passed by a dead sheep that he had given to a freed slave woman of Maimunah, the wife of the Prophet. He said: 'Why don't you make use of its hide?' They said: 'O Messenger of Allah, it is dead meat.' The Messenger of Allah said: 'It is only forbidden to eat it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4235", "inBookReference": "Book 41, Hadith 14"}, {"id": 15, "hadithNumber": "4236", "text": "Ibn'Abbas said: \"The Messenger of Allah saw a dead sheep that belonged to the freed slave woman of Maimunah, and had come from the Sadaqah.\" He said: \"Why don't you take off its hide and make use of it?\" They said: \"It is dead meat.\" He said: \"It is only unlawful to eat it.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4236", "inBookReference": "Book 41, Hadith 15"}, {"id": 16, "hadithNumber": "4237", "text": "It was narrated from Ibn 'Abbas: \"Maimunah told me that a sheep died, and the Prophet said: 'Why don't you tan its skin and make use of it'?\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Abbas:", "reference": "https://sunnah.com/nasai:4237", "inBookReference": "Book 41, Hadith 16"}, {"id": 17, "hadithNumber": "4238", "text": "Ibn 'Abbas said: \"The Prophet passed by a sheep belonging to Maimunah that had died and said: 'Why don't you take its skin and tan it and make use of it'?\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4238", "inBookReference": "Book 41, Hadith 17"}, {"id": 18, "hadithNumber": "4239", "text": "Ibn 'Abbas said: \"The Prophet passed by a dead sheep and said: 'Why don't you make use of its skin'?\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4239", "inBookReference": "Book 41, Hadith 18"}, {"id": 19, "hadithNumber": "4240", "text": "It was narrated that Sawdah, the wife of the Prophet, said: \"A sheep of ours died, and we tanned its skin, and continued to make Nabidh in it until it wore out.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Sawdah, the wife of the Prophet, said:", "reference": "https://sunnah.com/nasai:4240", "inBookReference": "Book 41, Hadith 19"}, {"id": 20, "hadithNumber": "4241", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah said: 'Any skin that is tanned has been purified.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4241", "inBookReference": "Book 41, Hadith 20"}, {"id": 21, "hadithNumber": "4242", "text": "It was narrated from Ibn Wa'lah that he asked Ibn 'Abbas: \"We are attacking the Maghrib, and they are people who worship idols, and they have waterskins in which they keep milk and water.\" Ibn 'Abbas said: \"Tanning is purification.\" Ibn Wa'lah said: \"Is this your own opinion, or something that you heard from the Messenger of Allah?\" He said: \"No, (I heard it) from the Messneger of Allah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn Wa'lah that he asked Ibn 'Abbas:", "reference": "https://sunnah.com/nasai:4242", "inBookReference": "Book 41, Hadith 21"}, {"id": 22, "hadithNumber": "4243", "text": "It was narrated from Salamah bin Al-Muhabbaq that: during the campaign of Tabuk, the Prophet of Allah called for water from a woman. She said: \"I only have a waterskin of mine made from an (unslaughtered) dead animal.\" He said: \"Didn't you tan it?\" She said: \"Of course.\" He said: \"Then it's tanning is its slaughter\". (Daif)", "grade": null, "narratedBy": "It was narrated from Salamah bin Al-Muhabbaq that:", "reference": "https://sunnah.com/nasai:4243", "inBookReference": "Book 41, Hadith 22"}, {"id": 23, "hadithNumber": "4244", "text": "It was narrated that 'Aishah said: \"The Prophet was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4244", "inBookReference": "Book 41, Hadith 23"}, {"id": 24, "hadithNumber": "4245", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4245", "inBookReference": "Book 41, Hadith 24"}, {"id": 25, "hadithNumber": "4246", "text": "It was narrated from 'Aishah that the Prophet said: \"The dead animal is purified by tanning it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Aishah that the Prophet said:", "reference": "https://sunnah.com/nasai:4246", "inBookReference": "Book 41, Hadith 25"}, {"id": 26, "hadithNumber": "4247", "text": "It was narrated that 'Aishah said: \"The Prophet said: 'The dead animal is purified by tanning it.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4247", "inBookReference": "Book 41, Hadith 26"}, {"id": 27, "hadithNumber": "4248", "text": "It was narrated from Maimunah, the wife of the Prophet, that: some men of Quraish passed by the Messenger of Allah dragging a sheep the size of a donkey. He said to them: \"Why don't you take its skin?\" They said: \"It is dead meat.\" The Messenger of Allah said: \"Purify it with water and Qaraz.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Maimunah, the wife of the Prophet, that:", "reference": "https://sunnah.com/nasai:4248", "inBookReference": "Book 41, Hadith 27"}, {"id": 28, "hadithNumber": "4249", "text": "It was narrated that 'Abdullah bin 'Ukaim said: \"The letter of the Messenger of Allah was read to us when I was a young boy: 'Do not make use of the skins and sinew of dead animals.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin 'Ukaim said:", "reference": "https://sunnah.com/nasai:4249", "inBookReference": "Book 41, Hadith 28"}, {"id": 29, "hadithNumber": "4250", "text": "It was narrated that'Abdullah bin 'Ukaim said: \"The Messenger of Allah wrote to us: 'Do not make use of the skins and sinew of dead animals.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that'Abdullah bin 'Ukaim said:", "reference": "https://sunnah.com/nasai:4250", "inBookReference": "Book 41, Hadith 29"}, {"id": 30, "hadithNumber": "4251", "text": "It was narrated that 'Abdullah bin 'Ukaim said: \"The Messenger of Allah wrote to Juhainah: 'Do not make use of the skin and sinew of dead animals.\"' (Hasan)\nAbu 'Abdur-Rahman )An-Nasa'i) said: The most correct about this topic, regarding the skins of the dead animal when it is tanned, is the narration of Az-Zuhri, from 'Ubaidullah bin 'Abdullah, from Ibn 'Abbas, from Maimunah, and Allah knows best.", "grade": null, "narratedBy": "It was narrated that 'Abdullah bin 'Ukaim said:", "reference": "https://sunnah.com/nasai:4251", "inBookReference": "Book 41, Hadith 30"}, {"id": 31, "hadithNumber": "4252", "text": "It was narrated from 'Aishah that: the Messenger of Allah ordered that the hides of dead animals be made use of if they had been tanned. (Daif)", "grade": null, "narratedBy": "It was narrated from 'Aishah that:", "reference": "https://sunnah.com/nasai:4252", "inBookReference": "Book 41, Hadith 31"}, {"id": 32, "hadithNumber": "4253", "text": "It was narrated from Abu Al-Malih, from his father, that: the Prophet forbade (the use of) the hides of Predators. (Hassan)", "grade": null, "narratedBy": "It was narrated from Abu Al-Malih, from his father, that:", "reference": "https://sunnah.com/nasai:4253", "inBookReference": "Book 41, Hadith 32"}, {"id": 33, "hadithNumber": "4254", "text": "It was narrated that Al-Miqdam bin Ma di Karib said: \"The Messenger of Allah forbade silk, gold and saddlecloths (Miyathir) made of leopard skin.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Al-Miqdam bin Ma di Karib said:", "reference": "https://sunnah.com/nasai:4254", "inBookReference": "Book 41, Hadith 33"}, {"id": 34, "hadithNumber": "4255", "text": "It was narrated that Khalid said: \"Al-Miqdam bi8n Ma di Karib came to visit Mu awiyah and said to him: I adjure you by Allah, do you know that the messenger of Allah forbade wearing the Hides of predators and riding on them? He said: 'yes.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Khalid said:", "reference": "https://sunnah.com/nasai:4255", "inBookReference": "Book 41, Hadith 34"}, {"id": 35, "hadithNumber": "4256", "text": "It was narraterd from Jabir bin 'Abdullah that, during the year of the Conquest, while he was in Makkah, he heard the Messenger of Allah say: \"Allah, the Mighty and Sublime, and His Messenger have forbidden the sale of alcohol, dead meat, pigs and idols.\" It was said to him: \"O Messenger of Allah, what do you think of their fat of dead animals, for it is used to caulk ships, it is daubed on animal skins, and people use it to light their lamps?\" He said: \"No, it is unlawful.\" Then the Messenger of Allah said: \"May Allah, the Mighty and Sublime, curse the Jews, for Allah forbade them the fat (of dead animals) but they rendered it, sold it, and consumed its price.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4256", "inBookReference": "Book 41, Hadith 35"}, {"id": 36, "hadithNumber": "4257", "text": "It was narrated that Ibn'Abbas said: \"It reached 'Umar that Samurah had sold some wine, and he said: 'May Allah ruin Samurah! Does he not know that the Messenger of Allah said: May Allah curse the Jews, for animal fat was forbidden to them, but they rendered it.' Sufyan (one of the narrators) said: \"Meaning: They melted it down.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn'Abbas said:", "reference": "https://sunnah.com/nasai:4257", "inBookReference": "Book 41, Hadith 36"}, {"id": 37, "hadithNumber": "4258", "text": "It was narrated from Ibn 'Abbas, form Maimunah, that: a mouse fell into some cooking fat and died. The Prophet was asked (about that) and he said: \"Throw it away, and whatever  is around it, and eat (the rest).\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Abbas, form Maimunah, that:", "reference": "https://sunnah.com/nasai:4258", "inBookReference": "Book 41, Hadith 37"}, {"id": 38, "hadithNumber": "4259", "text": "It was narrated from Ibn' Abbas, from Maimunah, that: the Prophet was asked about a mouse that had fallen into some solid cooking fat. He said. \"Take it, and whatever is around it, and throw it away.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn' Abbas, from Maimunah, that:", "reference": "https://sunnah.com/nasai:4259", "inBookReference": "Book 41, Hadith 38"}, {"id": 39, "hadithNumber": "4260", "text": "It was narrated from Ibn' Abbas, from Maimunah, that: the Prophet was asked about a mouse that fell into the cooking fat. He said: \"If it (the fat) is solid, then throw it away, and whatever is around it. If it is liquid then do not use it at all.\"(Daif)", "grade": null, "narratedBy": "It was narrated from Ibn' Abbas, from Maimunah, that:", "reference": "https://sunnah.com/nasai:4260", "inBookReference": "Book 41, Hadith 39"}, {"id": 40, "hadithNumber": "4261", "text": "Ibn ' Abbas said: \" I heard Sa'eed bin Jubair say: 'The Messenger of Allah passed by a dead goat and said: \"Why didn't the owners of this sheep makes use of its skin?\"", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4261", "inBookReference": "Book 41, Hadith 40"}, {"id": 41, "hadithNumber": "4262", "text": "It was narrated from Abu Sa'eed Al-Khudri that the Prophet said: \"If a fly falls into the vessel of one of you, let him dip it in,\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Abu Sa'eed Al-Khudri that the Prophet said:", "reference": "https://sunnah.com/nasai:4262", "inBookReference": "Book 41, Hadith 41"}]}