{"collection": "nasai", "collectionName": "Sunan an-Nasa'i", "book": 44, "bookName": "Chapter: Encouragement to Earn A Living", "hadiths": [{"id": 1, "hadithNumber": "4449", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah said: \"The best (most Pure) food that a man eats is that which he has earned himself, and a man's child (and his child's wealth) is part of his earnings\" (Sahih )", "grade": null, "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4449", "inBookReference": "Book 44, Hadith 1"}, {"id": 2, "hadithNumber": "4450", "text": "It was narrated from 'Aishah that the Prophet said: \"Your children are part of the best of your earnings, so eat from what your children earn.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Aishah that the Prophet said:", "reference": "https://sunnah.com/nasai:4450", "inBookReference": "Book 44, Hadith 2"}, {"id": 3, "hadithNumber": "4451", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah said: 'The best (most pure) food that a man eats is that which he has earned himself, and his child (and his child's wealth) is part of his earning,\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4451", "inBookReference": "Book 44, Hadith 3"}, {"id": 4, "hadithNumber": "4452", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah said: 'The best (most pure) food that a man eats is that which he has earned himself, and his child (and his child's wealth) is part of his earning.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4452", "inBookReference": "Book 44, Hadith 4"}, {"id": 5, "hadithNumber": "4453", "text": "An-Nu'man bin Bashir said: \"I heard the Messenger of Allah say: \"That which is lawful is plain and that which is unlawful is plain, and between them are matters which are not as clear. I will strike a parable for you about that: indeed Allah, the Mighty and Sublime, has established a sanctuary, and the sanctuary of Allah is that which He has forbidden. Whoever approaches the sanctuary is bound to transgress upon it, Or he said: 'Whoever grazes around the sanctuary will soon transgress upon it, and whoever indulges in matters that are not clear, he will soon transgress beyond the limits,\"\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4453", "inBookReference": "Book 44, Hadith 5"}, {"id": 6, "hadithNumber": "4454", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah said: 'There will come a time when a man will not care where his wealth comes from, whether (the source is) Halal or Haram.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4454", "inBookReference": "Book 44, Hadith 6"}, {"id": 7, "hadithNumber": "4455", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah said: \"There will come a time when there will be no one left who does not consume Riba, and whoever does not consume it will nevertheless be affected by residue.\" (Sahih )", "grade": null, "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4455", "inBookReference": "Book 44, Hadith 7"}, {"id": 8, "hadithNumber": "4456", "text": "It was narrated that 'Amr bin Taghilb said: \"The Messenger of Allah said: 'One of the portents of the Hour will be that wealth becomes widespread and abundant, and trade will become widespread, but knowledge will disappear. A man will try to sell something and will say: \"No, not until I consult the merchant of banu so and so: and People will look throughout a vast area for a scribe and will not find one.\" (Sahih )", "grade": null, "narratedBy": "It was narrated that 'Amr bin Taghilb said:", "reference": "https://sunnah.com/nasai:4456", "inBookReference": "Book 44, Hadith 8"}, {"id": 9, "hadithNumber": "4457", "text": "It was narrated that Hakim bin Hizam said: \"The Messenger of Allah said: 'The two parties to a transaction have the choice so long as they have not separated. If they are honest and open, their transaction will be blessed, but if they tell lies and conceal anything, the blessing of their transaction will be lost.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hakim bin Hizam said:", "reference": "https://sunnah.com/nasai:4457", "inBookReference": "Book 44, Hadith 9"}, {"id": 10, "hadithNumber": "4458", "text": "It was narrated from Abu Dharr that the Prophet said: \"There are three to whom Allah will not speak on the Day of Resurrection, or will He look at them, or sanctify them, and theirs will be a painful torment: Abu Dharr said:\" May they be lost and doomed: He said: \"The one who drags his Izar (below the ankles) the one who sells his product by means of false oaths, and the one who reminds others (Al-Mannan) of what he has given to them\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Dharr that the Prophet said:", "reference": "https://sunnah.com/nasai:4458", "inBookReference": "Book 44, Hadith 10"}, {"id": 11, "hadithNumber": "4459", "text": "It was narrated from Abu Dharr that the Prophet said: \"There are three at whom Allah will not look on the Day of Resurrection, nor will He sanctify them, and theirs will be a painful torment: the one who does not give anything but he reminds (the recipient of his gift), the one who drags his Izar (below the ankles), and the one who sells his product by means of false oaths.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Abu Dharr that the Prophet said:", "reference": "https://sunnah.com/nasai:4459", "inBookReference": "Book 44, Hadith 11"}, {"id": 12, "hadithNumber": "4460", "text": "It was narrated from Abu Qatadah Al-Ansari that he heard the Messenger of Allah say: \"Beware of taking oaths a great deal when selling, for it may help you to make a sale but it destroys the blessing.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Qatadah Al-Ansari that he heard the Messenger of Allah say:", "reference": "https://sunnah.com/nasai:4460", "inBookReference": "Book 44, Hadith 12"}, {"id": 13, "hadithNumber": "4461", "text": "It was narrated from Abu Hurairah that the Prophet said: \"Taking oaths may help you to make a sale but it takes (blessing) away from the earnings \"(Sahih )", "grade": null, "narratedBy": "It was narrated from Abu Hurairah that the Prophet said:", "reference": "https://sunnah.com/nasai:4461", "inBookReference": "Book 44, Hadith 13"}, {"id": 14, "hadithNumber": "4462", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"There are three to whom Allah will not speak on the Day of Resurrection, or will He look at them, or sanctify them and theirs will be a painful torment: A man who has surplus water when traveling but he withholds it form a wayfarer; a man who swears allegiance to an imam for worldly gains, and if he gives him what he wants he is loyal to him but if he does not give him anything he is not loyal to him: and a man who sells a man his product after 'Asr, swerving by Allah that he bought it for such and such a price, and the other believes him.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4462", "inBookReference": "Book 44, Hadith 14"}, {"id": 15, "hadithNumber": "4463", "text": "It was narrated that Qays bin Abi Gharazah said: \"We used to trade in the markets of Al-Madinah and we used to call ourselves as-Samasir (brokers) and the people called us that, but the Messenger of Allah came out to s and called us by a name that was better than what we called ourselves. He said: \"O merchants (Tujjar)! Selling involves (false) oaths and idle talk, so mix some charity with it,\"\" (Sahih )", "grade": null, "narratedBy": "It was narrated that Qays bin Abi Gharazah said:", "reference": "https://sunnah.com/nasai:4463", "inBookReference": "Book 44, Hadith 15"}, {"id": 16, "hadithNumber": "4464", "text": "It was narrated that Hakim bin Hizam said: The Messenger of Allah said: \"The two parties to a transaction have the choice so long as they have not separated. If they are honest and open, their transaction will be blessed, but if they tell lies and conceal anything the blessing of their transaction will be lost.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hakim bin Hizam said:", "reference": "https://sunnah.com/nasai:4464", "inBookReference": "Book 44, Hadith 16"}, {"id": 17, "hadithNumber": "4465", "text": "It was narrated from Malik, from Nafi from'Abdullah bin 'Umar that the Messenger of Allah said: \"The two parties to a transaction both have the choice so long as they both chosen to conclude the transaction.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Malik, from Nafi from'Abdullah bin 'Umar that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4465", "inBookReference": "Book 44, Hadith 17"}, {"id": 18, "hadithNumber": "4466", "text": "It was narrated from Yahaya, from 'Ubaidullah who said: \"Nafi narrated to me from Ibn 'Umar, tht the Messenger of Allah said: 'the two parties to a transaction both have the choice so long as they have not separated, or they have chosen.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Yahaya, from 'Ubaidullah who said:", "reference": "https://sunnah.com/nasai:4466", "inBookReference": "Book 44, Hadith 18"}, {"id": 19, "hadithNumber": "4467", "text": "it was narrated from Ismail, from Nafi, that Ibn 'Umar said: \"The Messenger of Allah said: 'The two parties to a transaction both have the choice so long as they have not separated, unless they have both chosen to conclude they transaction. If they have both chosen to conclude the transaction, then the transaction is binding.\" (Sahih )", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4467", "inBookReference": "Book 44, Hadith 19"}, {"id": 20, "hadithNumber": "4468", "text": "It was narrated from Ibn Juraij: \"Nafi dictated to me, from Ibn 'Umar who said: The Messenger of Allah said: 'the two parties to a transaction both have the choice so long as they have not separated, unless they have both chosen to conclude the transaction. If they have both chosen to conclude the transaction, then the transactions binding.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Ibn Juraij:", "reference": "https://sunnah.com/nasai:4468", "inBookReference": "Book 44, Hadith 20"}, {"id": 21, "hadithNumber": "4469", "text": "It was a narrated from Ayyub, from Nafi from Ibn 'Umar that the Messenger of Allah said: \"The Messenger of Allah said: \"The two parties to a transaction both have the choice who long as they have not separated or one of them says to the other: 'Decide!\"' (Sahih )", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4469", "inBookReference": "Book 44, Hadith 21"}, {"id": 22, "hadithNumber": "4470", "text": "It was narrated from Ayyub, from Nafi from Ibn 'Umar, who said: \"The Messenger of Allah said: 'The two parties to a transaction both have the choice so long as they have not separated or chosen to conclude the transaction.\" Or perhaps Nafi said: \"Or one of them has said to the other: 'Decide! \"(Sahih )", "grade": null, "narratedBy": "It was narrated from Ayyub, from Nafi from Ibn 'Umar, who said:", "reference": "https://sunnah.com/nasai:4470", "inBookReference": "Book 44, Hadith 22"}, {"id": 23, "hadithNumber": "4471", "text": "It was narrated from Al-Laith from Nafi from Ibn 'Umar who said: \"The Messenger of Allah said: 'The two parties to a transaction both have the choice so long as they have not separated or they have chosen to conclude the transaction.' Or perhaps Nafi said: \"Or one of them has said to the other: 'Decide! (Sahih )", "grade": null, "narratedBy": "It was narrated from Al-Laith from Nafi from Ibn 'Umar who said:", "reference": "https://sunnah.com/nasai:4471", "inBookReference": "Book 44, Hadith 23"}, {"id": 24, "hadithNumber": "4472", "text": "It was narrated from Al-Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah said: \"When two men enter into a transaction, each of them has the choice until they separate.\"  On one occasion he said: \"So long as they have not separated and one has not told the other to decide. If one tells the other to decide and they agree upon something, then the transaction is binding. If they separate after entering into a transaction and neither of them has canceled the transaction, then the transaction is binding.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Al-Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4472", "inBookReference": "Book 44, Hadith 24"}, {"id": 25, "hadithNumber": "4473", "text": "It was narrated from Yahya bin Sa 'eed who said: \"I heard Nafi narrating from Ibn 'Umar, form the Messenger of Allah 'the two parties to a transaction both have the choice so long as they have not separated unless they have chosen to conclude the transaction. \" Nafi said: ''When 'Abdullah bought something he like, he would leave straightaway.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Yahya bin Sa 'eed who said:", "reference": "https://sunnah.com/nasai:4473", "inBookReference": "Book 44, Hadith 25"}, {"id": 26, "hadithNumber": "4474", "text": "It was narrated from Yahya bin Sa 'eed , who said: \"Nafi narrated   to us from Ibn 'Umar, who said: 'The Messenger of Allah said: There is no transaction between the two parties until they separate, unless they have chosen to conclude the transaction.\"\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Yahya bin Sa 'eed , who said:", "reference": "https://sunnah.com/nasai:4474", "inBookReference": "Book 44, Hadith 26"}, {"id": 27, "hadithNumber": "4475", "text": "It was narrated from Ismail from 'Abdullah bin Dinar, from Ibn 'Umar, who said: \"The Messenger of Allah said: 'When two people meet to engage in trade, the transaction between them is not binding until they separate, unless they have chosen to conclude the transaction.,'\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ismail from 'Abdullah bin Dinar, from Ibn 'Umar, who said:", "reference": "https://sunnah.com/nasai:4475", "inBookReference": "Book 44, Hadith 27"}, {"id": 28, "hadithNumber": "4476", "text": "It was narrated from Ibn Al-Had, from 'Abdullah bin Dinar, from 'Abdullah bin 'Umar, that he heard the Messenger of Allah (ﷺ) say: \"When two people meet to engage in trade, the transaction between them is not binding until\nthey separate, unless they have chosen to conclude the transaction.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4476", "inBookReference": "Book 44, Hadith 28"}, {"id": 29, "hadithNumber": "4477", "text": "It was narrated from Sufyan, from 'Amr bin Dinar, from Ibn 'Umar, who said: the Messenger of Allah said: \"When two people meet to engage in trade, the transaction between them is not binding until they separate, unless they have chosen to concluded the transaction.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Sufyan, from 'Amr bin Dinar, from Ibn 'Umar, who said:", "reference": "https://sunnah.com/nasai:4477", "inBookReference": "Book 44, Hadith 29"}, {"id": 30, "hadithNumber": "4478", "text": "It was narrated from Yazid bin 'Abdullah, from 'Abdullah bin dinar, from ibn 'Umar that he heard the Messenger of Allah say: \"When two people meet to engage in trade the transaction between them is not binding until they separate, unless they have chosen to conclude the transaction.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4478", "inBookReference": "Book 44, Hadith 30"}, {"id": 31, "hadithNumber": "4479", "text": "It was narrated from Shu'ban who said: \"Abdullah bin Dinr narrated to us, from Ibn'Umar, who said; The Messenger of Allah said; \"When two people meet to engage in trade, the transaction between them is not binding until they separate, unless    they have       chosen to conclude the transaction.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Shu'ban who said:", "reference": "https://sunnah.com/nasai:4479", "inBookReference": "Book 44, Hadith 31"}, {"id": 32, "hadithNumber": "4480", "text": "It was narrated from Sufyan, from 'Abdullah bin Dinar, from Ibn 'Umar, from the Prophet who said: \"Two traders have the choice as long as they have not separated, or, they have chosen to conclude the transaction.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Sufyan, from 'Abdullah bin Dinar, from Ibn 'Umar, from the Prophet who said:", "reference": "https://sunnah.com/nasai:4480", "inBookReference": "Book 44, Hadith 32"}, {"id": 33, "hadithNumber": "4481", "text": "It was narrated from Al_Hasan, from Samurah, that the Prophet of Allah said: \"Two trades have the choice as long as until they reach a deal that suits both of them and they confirm it three times. \"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Al_Hasan, from Samurah, that the Prophet of Allah said:", "reference": "https://sunnah.com/nasai:4481", "inBookReference": "Book 44, Hadith 33"}, {"id": 34, "hadithNumber": "4482", "text": "It was narrated from Al- Hasan from Samurah, who said: \"The Messenger of Allah said;\" Two traders have the choice as long as they have not separated, or until they reach a deal that suits both of th4em or that is satisfactory (to both)\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Al- Hasan from Samurah, who said:", "reference": "https://sunnah.com/nasai:4482", "inBookReference": "Book 44, Hadith 34"}, {"id": 35, "hadithNumber": "4483", "text": "It was narrated from 'Amr bin Shu'aib, from his father , form his grandfather, that the Prophet said: \"The two parties to a transaction have the choicer so long as they have not separated, unless they reach an agreement before parting, and it is not permissible to hasten to leave for fear that the other party may change his mind.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Amr bin Shu'aib, from his father , form his grandfather, that the Prophet said:", "reference": "https://sunnah.com/nasai:4483", "inBookReference": "Book 44, Hadith 35"}, {"id": 36, "hadithNumber": "4484", "text": "It was narrated from Ibn 'Umar that: a man told the Messenger of Allah that he was always being cheated. The Messenger of Allah said to him: \"When you make a deal, say: There is no intention of cheating\" So, whenever the man engages in a deal he says, 'There is no intention of cheating.\" \"(Sahih )", "grade": null, "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4484", "inBookReference": "Book 44, Hadith 36"}, {"id": 37, "hadithNumber": "4485", "text": "It was narrated from Anas that: there was a man whose mental faculties were lacking, and he used to buy and sell. His family came to the Prophet and said: \"O Prophet of Allah stop him.\" So the Prophet of Allah called him, and told him not to do that. He said: \"O Prophet of Allah, I cannot bear to be away from business,\" He said \"If you engaged in a deal then say: 'There is no intention to deceive. \"' (Sahih )", "grade": null, "narratedBy": "It was narrated from Anas that:", "reference": "https://sunnah.com/nasai:4485", "inBookReference": "Book 44, Hadith 37"}, {"id": 38, "hadithNumber": "4486", "text": "Abu Hurairah said: \"The Messenger of Allah said: 'If any one of you sells a sheep or a milch- camel, let him not refrain from milking it.'' (Sahih )", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4486", "inBookReference": "Book 44, Hadith 38"}, {"id": 39, "hadithNumber": "4487", "text": "It was narrated from Abu Hurairah that the Prophet said: \"Do not go out to meet the riders, and do not bind the udders of camels and seep. Whoever has boughty anything in that manner has two choices: If he whishes he may keep it, or if he wants to return it he may return it, along with a Sa of dates.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Abu Hurairah that the Prophet said:", "reference": "https://sunnah.com/nasai:4487", "inBookReference": "Book 44, Hadith 39"}, {"id": 40, "hadithNumber": "4488", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"whoever buys a Musarraha, if he is please with it when he milks it, he may keep it, and if he is not please with it, he may return it, along with a Sa of daters\"' (Sahih )", "grade": null, "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4488", "inBookReference": "Book 44, Hadith 40"}, {"id": 41, "hadithNumber": "4489", "text": "Abu Hurairah said: Abu Al- Qasim said: \"Whoever buys a Musarrah, he has the choice (of annulling the deal) for three days. If the wishes ti keep it, he may keep it, and if he wishes to return it, he may return it, along with a Sa of daters, not wheat.\" (Sahih )", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4489", "inBookReference": "Book 44, Hadith 41"}, {"id": 42, "hadithNumber": "4490", "text": "It was narrated that 'Aishsh said: \" The Messenger of Allah ruled that what a slave earns belongs to his guarantor.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that 'Aishsh said:", "reference": "https://sunnah.com/nasai:4490", "inBookReference": "Book 44, Hadith 42"}, {"id": 43, "hadithNumber": "4491", "text": "It was narrated  that Abu Hurairah said: \"The Messenger of Allah forbade meeting (the traders on the way) a Muhajhir selling for a Bedouin, keeping the milk in the udder of an animal (so as to increase its price), artificially inflating prices, a man to urge the cancellation of sale already agreed upon and a woman to ask that her sister (in faith) be divorced.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated  that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4491", "inBookReference": "Book 44, Hadith 43"}, {"id": 44, "hadithNumber": "4492", "text": "It was narrated from Anas that: the Prophet forbade a town-dweller to sell for a desert- dweller, even if he was his father or brother. (Sahih )", "grade": null, "narratedBy": "It was narrated from Anas that:", "reference": "https://sunnah.com/nasai:4492", "inBookReference": "Book 44, Hadith 44"}, {"id": 45, "hadithNumber": "4493", "text": "It was narrated that Anas bin Malik said: \"It was forbidden to us for a town-dweller to sell for a desert-dweller, even if he was his father or brother.\" (Sahih )", "grade": null, "narratedBy": "It was narrated that Anas bin Malik said:", "reference": "https://sunnah.com/nasai:4493", "inBookReference": "Book 44, Hadith 45"}, {"id": 46, "hadithNumber": "4494", "text": "It was narrated that Anas said: \"It was forbidden to us for a town-dweller to sell for a desert-dweller.\" (Sahih )", "grade": null, "narratedBy": "It was narrated that Anas said:", "reference": "https://sunnah.com/nasai:4494", "inBookReference": "Book 44, Hadith 46"}, {"id": 47, "hadithNumber": "4495", "text": "Jabir said: \"The Messenger of Allah said: 'A town-dweller should not sell for a direst-dweller. Leave the people alone and let Allah provide for them from one another.\"\" (Sahih )", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4495", "inBookReference": "Book 44, Hadith 47"}, {"id": 48, "hadithNumber": "4496", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"Do not go out to meet the riders, and do not urge someone to cancel a sale he has already agreed upon os as to sell him your own goods, do not artificially inflate prices, and let not a town-dweller sell for a desert-dweller.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4496", "inBookReference": "Book 44, Hadith 48"}, {"id": 49, "hadithNumber": "4497", "text": "It was narrated from 'Abdullah that: the Messenger of Allah forbade artificially inflating prices, meeting traders on the way, and for a town-dweller to sell for a desert-dweller.\" (Sahih )", "grade": null, "narratedBy": "It was narrated from 'Abdullah that:", "reference": "https://sunnah.com/nasai:4497", "inBookReference": "Book 44, Hadith 49"}, {"id": 50, "hadithNumber": "4498", "text": "It was narrated from Ibn 'Umar that: the Messenger of Allah forbade meeting traders on the way.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4498", "inBookReference": "Book 44, Hadith 50"}, {"id": 51, "hadithNumber": "4499", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (ﷺ) forbade meeting traders on the way, until one enters the \nmarket with them?\" Abu Usamah acknowledged it and said: Yes.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4499", "inBookReference": "Book 44, Hadith 51"}, {"id": 52, "hadithNumber": "4500", "text": "It was narrate from Ibn Tawus, from his father, that Ibn 'Abbas said;\n\"The Messenger of Allah forbade meeting the riders, and for a town-dweller.\" I said to Ibn \n'Abbas: \"What does a town-dweller (selling) for a desert-dweller mean?\" he said: \"He should not act as a broker for him,\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4500", "inBookReference": "Book 44, Hadith 52"}, {"id": 53, "hadithNumber": "4501", "text": "Abu Hurairah said: \"The Messenger of Allah said: 'Do and whoever meets any of them and buys from him the vendor has the choice of annulling the transaction when he comes to the marketplace.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4501", "inBookReference": "Book 44, Hadith 53"}, {"id": 54, "hadithNumber": "4502", "text": "It was narrated that Abu Hurairah said: The Messenger of Allah said: \"No town-dweller should sell for a desert-dweller, do not artificially inflate prices, no man should  urge  a seller to cancel a sale already agreed upon with another buy so as to by the goods himself, no one should make a proposal over the proposal of his brother and no woman should make a proposal over the proposal of his brother and no woman should ask for her sister in faith) to be divorced so as to turn over what is  in her  vessel Deprived her of her share of maintenance) and so that she may get married in her place: she will have what Allah has decreed or her.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4502", "inBookReference": "Book 44, Hadith 54"}, {"id": 55, "hadithNumber": "4503", "text": "It was narrated from Ibn 'Umar that the Prophet said: \"No one of you should urge someone to cancel a sale he has already agreed upon with his brother so as to sell him his own goods.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that the Prophet said:", "reference": "https://sunnah.com/nasai:4503", "inBookReference": "Book 44, Hadith 55"}, {"id": 56, "hadithNumber": "4504", "text": "It was narrated from Ibn 'Umar that the Messenger of Allah said: \"Do not urge someone to cancel a sale he has already agreed upon so as to sell him your own goods, unless he bys or changes his mind.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4504", "inBookReference": "Book 44, Hadith 56"}, {"id": 57, "hadithNumber": "4505", "text": "It was narrated from Ibn 'Umar that: the Prophet forbade artificially inflating prices.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4505", "inBookReference": "Book 44, Hadith 57"}, {"id": 58, "hadithNumber": "4506", "text": "It was narrated that Abu Hurairah said: \"I heard the messenger of Allah say: \"No man should urge anyone to cancel a sale he has already agreed upon with his brother so as to sell him his own goods; no town-dweller should sell for a desert-dweller; do not artificially inflate prices; no man should outbid his brother; and no woman should ask for her sister (in faith) to be divorced so as to turn over what is in her vessel (deprive her of her share of maintenance),", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4506", "inBookReference": "Book 44, Hadith 58"}, {"id": 59, "hadithNumber": "4507", "text": "It was narrated from Abu Hurairah that the Prophet said: \"No tow-dweller should sell for desert-dweller, no man should outbid his brother; and no woman should ask for her sister (in faith) to be divorced so as to turn over what is in her bowl (deprive her of her share of maintenance)\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Prophet said:", "reference": "https://sunnah.com/nasai:4507", "inBookReference": "Book 44, Hadith 59"}, {"id": 60, "hadithNumber": "4508", "text": "It was narrated from Anas bin Malik that: the Messenger of Allah sold a drinking bowl and a blanket (for a horse of camel) to the highest bidder '", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Anas bin Malik that:", "reference": "https://sunnah.com/nasai:4508", "inBookReference": "Book 44, Hadith 60"}, {"id": 61, "hadithNumber": "4509", "text": "It was narrated from Abu Hurairah that: the Messenger of Allah forbade Mulamash and Munabadha.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that:", "reference": "https://sunnah.com/nasai:4509", "inBookReference": "Book 44, Hadith 61"}, {"id": 62, "hadithNumber": "4510", "text": "It was narrated from Abu Sa' eed Al- Khudri that: the Messenger of Allah forbade Mulamasah, which means touching a garment without looking at it, and Munabadha, which is where one man sells his garment to another man, by throwing it to him, without him checking it or looking at it.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Sa' eed Al- Khudri that:", "reference": "https://sunnah.com/nasai:4510", "inBookReference": "Book 44, Hadith 62"}, {"id": 63, "hadithNumber": "4511", "text": "It was narrated that Abu Sa'eed al-Khudri said: \"The Messenger of Allah forbade two kinds of transactions: Mulamash and Munabddhah \"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Sa'eed al-Khudri said:", "reference": "https://sunnah.com/nasai:4511", "inBookReference": "Book 44, Hadith 63"}, {"id": 64, "hadithNumber": "4512", "text": "It was narrated that Abu Sa'eed Al-Khudri said: \"The messenger of Allah forbade two kinds of transactions: Mulamash and Mumabadha.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Sa'eed Al-Khudri said:", "reference": "https://sunnah.com/nasai:4512", "inBookReference": "Book 44, Hadith 64"}, {"id": 65, "hadithNumber": "4513", "text": "Abu Hurairah said: \"The Messenger of Allah forbade Munabadhah and Mulamash. Mulamasah is when two men trade garments with each other under cover of night, each man touching the garment of the other with his hand> and Munabadhah is when one man throws a garment to another and the other throws a garment to him, and they trade them with each other in that manner.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4513", "inBookReference": "Book 44, Hadith 65"}, {"id": 66, "hadithNumber": "4514", "text": "It was narrated that Abu Sa 'eed A-Khudri said: \"The Messenger of Allah forbade Mulamasah, which means touching a garment without looking at it; (and he forbade) Munabadhah which is where one man sells his garment to another man by throwing it to him, without him checking it or looking at it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Sa 'eed A-Khudri said:", "reference": "https://sunnah.com/nasai:4514", "inBookReference": "Book 44, Hadith 66"}, {"id": 67, "hadithNumber": "4515", "text": "It was narrated that Abu Sa'eed Al-Khudri said: \"The Messenger of Allah forbade two kinds of garments and two kinds of transactions. As for the two kinds of transactions, they are Mulamash and Munabadhaha. Munabadha is when a man says, 'I throw this garment, and the transaction becomes binding, and Mulamasah is when a man touches it with his had, without spreading it out and checking it, and once he touches it, the transaction becomes binding.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Sa'eed Al-Khudri said:", "reference": "https://sunnah.com/nasai:4515", "inBookReference": "Book 44, Hadith 67"}, {"id": 68, "hadithNumber": "4516", "text": "It was narrated from Salim that his father said: \"The Messenger of Allah forbade two kinds of garments, and he forbade two kinds of transactions for us: Munabadhah and \nMulamasah, which are kinds of transactions which were common during the Jahiliyyah.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim that his father said:", "reference": "https://sunnah.com/nasai:4516", "inBookReference": "Book 44, Hadith 68"}, {"id": 69, "hadithNumber": "4517", "text": "It was narrated from Hafs bin 'Asim, from Abu Hurairah that the Prophet forbade two kids of transactions: Munabadhah and Mulamasha. And he said that Mulamasah means when one man says to another: \"I will sell you my garment for your garment,\" and neither of them looks at the garment of the others, rather he just touches it. And Munabadhah is when he says: \"I will throw what I have and you throw what you have,\" so that they buy from one another, and neither of them knows how much the other has, and so on.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4517", "inBookReference": "Book 44, Hadith 69"}, {"id": 70, "hadithNumber": "4518", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah forbade Gharar transaction and Hasah transactions.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4518", "inBookReference": "Book 44, Hadith 70"}, {"id": 71, "hadithNumber": "4519", "text": "; It was narrated from Ibn 'Uar that the Messenger of Allah said: \"Do not sell fruits until their condition is known. And he forbade (both) the seller and the purchaser (to engage in such a transaction).", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4519", "inBookReference": "Book 44, Hadith 71"}, {"id": 72, "hadithNumber": "4520", "text": "It was narrated from Salim, from his father, that: the Messenger of Allah forbade selling fruits until their condition is known.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim, from his father, that:", "reference": "https://sunnah.com/nasai:4520", "inBookReference": "Book 44, Hadith 72"}, {"id": 73, "hadithNumber": "4521", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah said: 'Do not sell fruits until their condition is known, and do not sell fresh dates (still on the tree) for dried dates.\"' Ibn Shihab said: \"Salim bin 'Abdullah narrated to me, from his father: 'That Allah's Messenger forbade from  ...\" similarly.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4521", "inBookReference": "Book 44, Hadith 73"}, {"id": 74, "hadithNumber": "4522", "text": "'Abdullah bin 'Umar said: \"The Messenger of Allah stood up among us ad said: 'Do not sell fruits until their condition is known.\"\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4522", "inBookReference": "Book 44, Hadith 74"}, {"id": 75, "hadithNumber": "4523", "text": "It was narrated from 'Ata: \"I heard Jabir bin 'Abdullah (narrate) from the Prophet that he forbade Mukhabarah, Muzabanah and Muhaqalah, an (he forbade) selling fruits until their condition is known, an that they should only sold for Dinars and Dirhams, but he granted a concession regarding the sale of Araya:", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Ata:", "reference": "https://sunnah.com/nasai:4523", "inBookReference": "Book 44, Hadith 75"}, {"id": 76, "hadithNumber": "4524", "text": "It was narrated from Jabir that: the Prophet forbade Mukhabarah, Muzabanah and Muhaqalah, and selling fruits until they were fit to eat, except in the case f 'Aray.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4524", "inBookReference": "Book 44, Hadith 76"}, {"id": 77, "hadithNumber": "4525", "text": "It was narrated that Jabir said: \"the Messenger of Allah forbade selling the fruit of date palms until they are fit to eat.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4525", "inBookReference": "Book 44, Hadith 77"}, {"id": 78, "hadithNumber": "4526", "text": "It was narrated from Anas bin Malik that: the Messenger of Allah forbade selling fruits before they ripen. It was said: \"O Messenger of Allah what does ripen mean?\" he said: 'when they turn red.\" And the Messenger of Allah said: \"What do you think if Allah withholds the fruits (causes it not to ripen), why would any one of you take his brother's wealth?\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Anas bin Malik that:", "reference": "https://sunnah.com/nasai:4526", "inBookReference": "Book 44, Hadith 78"}, {"id": 79, "hadithNumber": "4527", "text": "Jabir said: \"The Messenger of Allah said: \"If you sell fruits to your brother then the crop fails, it is not permissible for you it takes anything from him. Why would you take the wealth of your brother unlawfully?\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4527", "inBookReference": "Book 44, Hadith 79"}, {"id": 80, "hadithNumber": "4528", "text": "It was narrated from Jabir bin 'Abdullah that the Messenger of Allah said: \"Whoever sells fruit then his crop fails, he should not take (anything) from his brother.\" \n(And he said something along the lines of) \"Why would anyone of you consume the wealth of his Muslim brother?\"", "grade": null, "narratedBy": "It was narrated from Jabir bin 'Abdullah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4528", "inBookReference": "Book 44, Hadith 80"}, {"id": 81, "hadithNumber": "4529", "text": "It was narrated from Jabir that: the Prophet annulled transaction in the event of crop faioure.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4529", "inBookReference": "Book 44, Hadith 81"}, {"id": 82, "hadithNumber": "4530", "text": "it was narrated that Abu Sa' eed Al-Khudri said: \"At the time of the Messenger of Allah, a ma suffered loss of some fruit that he had purchased, and his debts increased. The Messenger of Allah said: 'give him charity.' So the people gave him charity, but that was not enough to pay of his debts. The Messenger of Allah said: \"Take what you find but you have no right to or than that.\"\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4530", "inBookReference": "Book 44, Hadith 82"}, {"id": 83, "hadithNumber": "4531", "text": "It was narrated from Jabir that: the Prophet forbade selling the harvest for a number of years (in advance.)", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4531", "inBookReference": "Book 44, Hadith 83"}, {"id": 84, "hadithNumber": "4532", "text": "It was narrated from Salim, from his father, that: the Prophet forbade selling fresh dates still on the tree for dried dates. Ibn 'Umar said: \"Azid bin Thabit narrated to me, that Allah's Messenger permitted that in the case o 'Ayaya\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim, from his father, that:", "reference": "https://sunnah.com/nasai:4532", "inBookReference": "Book 44, Hadith 84"}, {"id": 85, "hadithNumber": "4533", "text": "It was narrated from Ibn 'Umar that: the Messenger of Allah forbade Muzabanah. Ad Muzabanah is when what is art the tops of the trees is sold for a certain amount f dried dates; if there are more then I gain, and if there are less the I lose.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4533", "inBookReference": "Book 44, Hadith 85"}, {"id": 86, "hadithNumber": "4534", "text": "It was narrated from Ibn 'Umar that: the messenger of Allah forbade Muzabana, and Muzabanah means selling fresh dates still on tree  for dried dates by measure, and selling fresh grapes for raisins by measure.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4534", "inBookReference": "Book 44, Hadith 86"}, {"id": 87, "hadithNumber": "4535", "text": "It was narrated that Rafi bin Khadij said: \"the Messenger of Allah forbade Muhaqalah and Muzabana.\"(Hasan )", "grade": null, "narratedBy": "It was narrated that Rafi bin Khadij said:", "reference": "https://sunnah.com/nasai:4535", "inBookReference": "Book 44, Hadith 87"}, {"id": 88, "hadithNumber": "4536", "text": "It was narrated from Salim that his father said: \"Zaid bin Thabit told me that the Messenger of Allah granted a concession regarding the sale of 'Arays.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim that his father said:", "reference": "https://sunnah.com/nasai:4536", "inBookReference": "Book 44, Hadith 88"}, {"id": 89, "hadithNumber": "4537", "text": "Kharijah bin Zaid bin Thabit narrated from his father that: the Messenger of Allah granted a concession regarding 'Araya sales regarding dried dates and fresh dates.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4537", "inBookReference": "Book 44, Hadith 89"}, {"id": 90, "hadithNumber": "4538", "text": "It was narrated from Zaid bin Thabit that: the Messenger of Allah granted a concession allowing Araya sales by estimation.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Zaid bin Thabit that:", "reference": "https://sunnah.com/nasai:4538", "inBookReference": "Book 44, Hadith 90"}, {"id": 91, "hadithNumber": "4539", "text": "Zaid bin Thabit narrated that: the Messenger of Allah granted a concession allowing 'Araya sales for dried dates by estimation.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4539", "inBookReference": "Book 44, Hadith 91"}, {"id": 92, "hadithNumber": "4540", "text": "It was narrated the Zaid bin Thabit sadi: \"The Messenger of Allah granted a concession allowing 'Araya sales for fresh dates and for dried dates, but he did not allow anything other than that.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated the Zaid bin Thabit sadi:", "reference": "https://sunnah.com/nasai:4540", "inBookReference": "Book 44, Hadith 92"}, {"id": 93, "hadithNumber": "4541", "text": "It was narrated from Au Hurairah that the prophet granted a concession allowing estimation for 'Ararya sales, so long as they were five Wasq or less then that", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4541", "inBookReference": "Book 44, Hadith 93"}, {"id": 94, "hadithNumber": "4542", "text": "It was narrated from Sahl bin Abi Hathamah that the Prophet forbade selling fruits before their condition was known, but he granted a concession allowing 'Araya sales by estimate, so its people could eat fresh dates.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4542", "inBookReference": "Book 44, Hadith 94"}, {"id": 95, "hadithNumber": "4543", "text": "Rafi bin Khadij and Sahl Bi Abi Hathamah narrated that the Messenger of Allah forbade Muzabanah, which means selling fresh dates still on the tree for dried dates, except in cases of 'Araya, for which he gave permission. (Sahih", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4543", "inBookReference": "Book 44, Hadith 95"}, {"id": 96, "hadithNumber": "4544", "text": "It was narrated from Bashir bin yasar that the Companions of the Messenger of Allah said: \"The Messenger of Allah granted a concession allowing 'Araya sales by estimate.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Bashir bin yasar that the Companions of the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4544", "inBookReference": "Book 44, Hadith 96"}, {"id": 97, "hadithNumber": "4545", "text": "it was narrated that Sa'd said: \"The Messenger of Allah was asked about (buying) fresh dates with dried dates, and he said to those who were around him: 'Will fresh dates decrease (in weight or volume) when they dry out?\" they said Yes,' so he forbade that.\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4545", "inBookReference": "Book 44, Hadith 97"}, {"id": 98, "hadithNumber": "4546", "text": "It was narrated that Sa 'd bin Malik said: \"The Messenger of Allah was asked about (buying) said; 'Will fresh dates decrees (in weight or volume) when they dry out? 'They said 'yes so he forbade that\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Sa 'd bin Malik said:", "reference": "https://sunnah.com/nasai:4546", "inBookReference": "Book 44, Hadith 98"}, {"id": 99, "hadithNumber": "4547", "text": "Jabir bin 'Abdullahsaid: \"The Messenger of Allah forbade selling a heap of dried dates whose volume is unknown for known volume of dried dates,\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4547", "inBookReference": "Book 44, Hadith 99"}, {"id": 100, "hadithNumber": "4548", "text": "Abu Zubair narrated that he heard Jabir bin 'Abdullah say: \"The Prophet said: '\nA heap of grain should not be sold for a heap of grain, or for a heap of grain of known measure. \"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4548", "inBookReference": "Book 44, Hadith 100"}, {"id": 101, "hadithNumber": "4549", "text": "It was narrated that Ibn 'umar said: \"The Messenger of Allah forbade Muzabanah, which refers to when a man sells the dates of his  grove while they are still on the trees, for a measure of dry on the tree, for a measure of dry dates, estimating the amount( of dates on the trees). Or, if it is grapes, he sells them when they are still on the vines, for a measure of raisins, estimating the amount (of grapes on the vines). Or if it is grain in the field, he sells it for grain that has been harvested, estimating the amount (of grain in the fields). He forbade all of that.\"\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'umar said:", "reference": "https://sunnah.com/nasai:4549", "inBookReference": "Book 44, Hadith 101"}, {"id": 102, "hadithNumber": "4550", "text": "It was narrated from Jabir that: the Messenger of Allah forbade Mukhabarah, Muzabanah and Muhaqalah, and selling dates before they arte fit or eating, and selling them for anything except Dinars and Dirhams. ,\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4550", "inBookReference": "Book 44, Hadith 102"}, {"id": 103, "hadithNumber": "4551", "text": "It was narrated from Ibn 'umar that: the Messenger of Allah forbade selling dates in the trees before they ripen or selling ears of corn before the grains become visible and there is no fear of blight. He forbade that to the seller ad the buyer. ,\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'umar that:", "reference": "https://sunnah.com/nasai:4551", "inBookReference": "Book 44, Hadith 103"}, {"id": 104, "hadithNumber": "4552", "text": "It was narrate from Abu Salih that: a man form among the companions of the Prophet told him, he said: \"O Messenger of Allah we cannot buy Saihani dates or 'idhq dates for the same amount of mixed dates (which are of inferior quality). Should we increase (the amount we give in payment for the better quality dates)?\" The messenger of Allah said: \"Sell them for silver them buy with it\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4552", "inBookReference": "Book 44, Hadith 104"}, {"id": 105, "hadithNumber": "4553", "text": "It was narrated from Abu Sa'eed Al'Khudri and Abu Hurairah that: the Messenger of Allah appointed a man in charge of kharibar and he brought some Janib dates. The messenger of Allah said; \"Are all the dates if khaibar like this?\" He said: \"No (by Allah, O Messenger of Allah) we take a Sa of these for two for three Sas (of other types of  dates).\" The messenger of Allah said: \"do not do that Sell the mixed dates for Dirhams then buy the Janib dates with the Dirhams\" ,\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Sa'eed Al'Khudri and Abu Hurairah that:", "reference": "https://sunnah.com/nasai:4553", "inBookReference": "Book 44, Hadith 105"}, {"id": 106, "hadithNumber": "4554", "text": "It was narrated from Abu Sa'eed Al-udri that: some dates from trees that were irrigated artificially were brought to the Messenger of Allah and the dates of the messenger of Allah were dates from trees that were nourished by their roots.  He said: \"Where did you get these from?\" They said: \"We bought a Sa of them for two Sa s of our dates: He said: \"Do not do that, for this is not right. Rather sell your dates and but what you need of these,\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Sa'eed Al-udri that:", "reference": "https://sunnah.com/nasai:4554", "inBookReference": "Book 44, Hadith 106"}, {"id": 107, "hadithNumber": "4555", "text": "A Abu Sa 'eed al- Khudri said: \"We used to be given mixed dates during the time of the Messenger of Allah and we would sell two Sa s for one Sa News of that reached the Messenger of Allah and he said Do not sell) two Sa s of dates for a Sa, or two Sa s of wheat for s Sa or a Dirham for two Dirhams. ,\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4555", "inBookReference": "Book 44, Hadith 107"}, {"id": 108, "hadithNumber": "4556", "text": "Abu Sa' eed said: \"We used to sell two Sa s of mixed dates for a Sa but the Prophet said (Do not sell) two Sa s dates for a Sa or two Sa s wheat or a Sa or two Dirhams for a Dirham. ,\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4556", "inBookReference": "Book 44, Hadith 108"}, {"id": 109, "hadithNumber": "4557", "text": "Abu Saeed said: \"Bilal brought some Bami dates to the Messenger of Allah and he said: 'What is this? 'He said: 'I bought a Sa of them for two Sas. The Messenger of Allah said: \"O! The essence of Riba, do not approach it.\"'", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4557", "inBookReference": "Book 44, Hadith 109"}, {"id": 110, "hadithNumber": "4558", "text": "Umar bin Al-Khattab said: \"The Messenger of Allah said: '(Exchanging) gold for silver is Riba unless it is done on the spot. (Exchanging) dates for dates is Riba unless it is done on the spot. (Exchanging) wheat for wheat is Riba unless it is done on the spot. (Exchanging) barley is Riba unless it is done on the spot.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4558", "inBookReference": "Book 44, Hadith 110"}, {"id": 111, "hadithNumber": "4559", "text": "Abu Hurairah said: \"The Messenger of Allah said: 'Dates for dates, wheat for wheat, barley for barley, salt for salt, exchanged hand to hand. Whoever gives more or takes more has engaged in Riba unless they are of different types.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4559", "inBookReference": "Book 44, Hadith 111"}, {"id": 112, "hadithNumber": "4560", "text": "It was narrated that Muslim bin Yasar and 'Abdullah bin 'Atik said: \"Ubadah bin As-Samit and Muawiyah met at a stopping place on the road. 'Ubadah told them: 'The Messenger of Allah forbade selling gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates\"'- one of them said: 'salt for salt,\"' but the other did not say it-\"unless it was like for like, hand to hand. And he commanded us to sell gold for silver and silver for gold, and wheat for barley and barley for wheat, and to hand, however we wanted.\"' And one of them said: \"Whoever gives more or ask for more has engaged in Riba.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Muslim bin Yasar and 'Abdullah bin 'Atik said:", "reference": "https://sunnah.com/nasai:4560", "inBookReference": "Book 44, Hadith 112"}, {"id": 113, "hadithNumber": "4561", "text": "Muslim bin Yasar and Abdullah bin Ubaid who was called Ibn Hurmuz narrated that 'Ubadah bin As-Samit and Muawiyah met at a stopping place on the road. 'Ubadah told them: \"The Messenger of Allah forbade selling gold for gold, silver for silver, dates for dates, wheat for wheat, barley for barley\"- one of them said: \"salt for salt,\" but the other did not say it-\"unless it was equal amount for equal amount, like for like.\" One of them said: \"Whoever gives more or takes more has engaged in Riba,\" but he other one did not say it. \"And he commanded us to sell gold for silver and silver for gold, and wheat for barley and barley for wheat, hand to hand, however we wanted.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4561", "inBookReference": "Book 44, Hadith 113"}, {"id": 114, "hadithNumber": "4562", "text": "Muslim bin Yasar and 'Abdullah bin 'Ubaid said: \"Ubadah bin As-Samit and Muawiyah met at a stopping place on the road. 'Ubadah said: 'The Messenger of Allah forbade us to sell gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates\"' - one of them said: \"salt for salt, \" but the other did not say \"unless it was equal amount for equal amount, like for like.\" One of them said: \"Whoever gives more or takes more has engaged in Riba,\" but the other one did not say it. \"And the commanded us to sell gold for silver and silver for gold, and wheat for barley and barley for wheat, hand to hand, however we wanted.' News of this hadith reached Muawiyah and he stood up and said: 'What is the matter with men who narrate Hadiths from the Messenger of Allah when we accompanied him and we never heard him say it? News of that reached 'Ubadah bin As-Samit and he stood up and repeated the Hadith, then he said: 'We will narrate what we heard from the Messenger of Allah, whether Muawiyah likes it or not.\"' Qatadah contradicted him, he reported it from Muslim bin Yasar, from Abu Al-=Ashath, from 'Ubadah.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4562", "inBookReference": "Book 44, Hadith 114"}, {"id": 115, "hadithNumber": "4563", "text": "It was narrated from 'Ubdah bin As-Samit-who had been present at Badar and had given his pledge to the Prophet swearing not to fear the blame of any blamer for the sake of Allah that 'Ubadah stood up to deliver a speech and said: \"O people, you have invented kinds of transactions, I do not know what they are, but make sure it is gold for gold, of the same weight, or silver for silver, of the same weight. There is nothing wrong with selling silver for gold, hand to hand, giving more silver than gold, but no credit is allowed. When you sell wheat for wheat and barley for barley, it should be measure for measure, but there is nothing wrong with selling barley for wheat, hand to hand, giving more barley than wheat, but no credit is allowed. And when you sell dates for dates, it should be measure for measure\" And he mentioned salt, \"measure for measure, and whoever gives more or asks for more has engaged in Riba.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4563", "inBookReference": "Book 44, Hadith 115"}, {"id": 116, "hadithNumber": "4564", "text": "It was narrated that 'Ubadah bin As-Samit said: \"The messenger of Allah said: 'Gold for gold, of equal measure; silver for silver, of equal measure; salt for salt, dates for dates wheat for wheat, barley for barley, like for like. Whoever gives more or  takes more has engaged in Riba.\"' (Sahih)\nThe wording is that of Muhammad Yaqub did not mention - \"Wheat for wheat\".", "grade": null, "narratedBy": "It was narrated that 'Ubadah bin As-Samit said:", "reference": "https://sunnah.com/nasai:4564", "inBookReference": "Book 44, Hadith 116"}, {"id": 117, "hadithNumber": "4565", "text": "It was narrated from Sulaiman bin Ali: \"Abu Al-Mutawakkil passed by them in the market and some people, including me, stood up to greet him. We said: 'We have come to you to ask you about transactions.' He said: 'I heard a man say to Abu Saeed Al-Khudri': 'Is there anyone between you and the Messenger of Allah (in the chain of narrators) apart from Abu Saeed Al-Khudri? He said: 'There is no one else between him and I. He said: Gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates, salt for salt, equal amounts. Whoever gives more than that or takes more has engaged in Riba, and the taker and the giver are the same.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Sulaiman bin Ali:", "reference": "https://sunnah.com/nasai:4565", "inBookReference": "Book 44, Hadith 117"}, {"id": 118, "hadithNumber": "4566", "text": "It was narrated that 'Ubadah bin As-Samit said: \"I heard the Messenger of Allah say: 'Gold, equal amount.\"' (One of the narrators) Yaqub did not mention: \"Equal amount.\" Muawiyah said: \"This does not mean anything.\" 'Ubadah said; \"By Allah I do not care if I am in a land where Muawiyah is not present. I bear witness that I heard the Messenger of Allah say that.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Ubadah bin As-Samit said:", "reference": "https://sunnah.com/nasai:4566", "inBookReference": "Book 44, Hadith 118"}, {"id": 119, "hadithNumber": "4567", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"Dinar for Dinar Dirham for Dirham, no difference between them.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4567", "inBookReference": "Book 44, Hadith 119"}, {"id": 120, "hadithNumber": "4568", "text": "It was narrated that Mujahid said: \"Umar said: Dinar for Dinar, Dirham for Dirham, no difference between them, this is the obligation that our Prophet enjoined upon us.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Mujahid said:", "reference": "https://sunnah.com/nasai:4568", "inBookReference": "Book 44, Hadith 120"}, {"id": 121, "hadithNumber": "4569", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah said: 'Gold for gold, weight for weight, like for like; and silver for silver, weight for weight, like for like. Whoever gives more or takes more has engaged in Riba.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4569", "inBookReference": "Book 44, Hadith 121"}, {"id": 122, "hadithNumber": "4570", "text": "It was narrated from Abu Saeed Al-Khudri that the Messenger of Allah said: \"Do not sell gold for gold except like for like and do not differentiate. Do not sell silver for silver except like for like, and do not sell it in return for something to be paid later.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Saeed Al-Khudri that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4570", "inBookReference": "Book 44, Hadith 122"}, {"id": 123, "hadithNumber": "4571", "text": "It was narrated that Abu Saeed Al-Khudri said: \"My eyes saw and my ears heard the Messenger of Allah. And he mentioned the prohibition of (selling) gold for gold and silver for silver, unless it is equal amounts, like for like. And do not sell it in return for something to be paid later, and do not differentiate.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Saeed Al-Khudri said:", "reference": "https://sunnah.com/nasai:4571", "inBookReference": "Book 44, Hadith 123"}, {"id": 124, "hadithNumber": "4572", "text": "It was narrated from 'Ata' bin Yasir that: Muawiyah sold a cup of gold or silver for more than its weight. Abu Ad-Darda' said: \"I heard the Messenger of Allah forbid such transactions unless it was like for like.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Ata' bin Yasir that:", "reference": "https://sunnah.com/nasai:4572", "inBookReference": "Book 44, Hadith 124"}, {"id": 125, "hadithNumber": "4573", "text": "It was narrated the Fadalah bin 'Ubaid said: \"On the Day of Khaibar I bought a necklace containing gold and ggems for twelve Dinars. The I took it apart and found that it contatined more than twelve Dinars. Mentiion of that was made to the Prophet and he said: 'It should not be sold until it is taken apart.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated the Fadalah bin 'Ubaid said:", "reference": "https://sunnah.com/nasai:4573", "inBookReference": "Book 44, Hadith 125"}, {"id": 126, "hadithNumber": "4574", "text": "It was narrated that Fadalah bin 'Ubad said: \"On the Day of Khaibar I got a necklace containing gold and gems, and I wanted to sell it. Mention of that was made to the Prophet and he said: 'Take it apart, and then sell it.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Fadalah bin 'Ubad said:", "reference": "https://sunnah.com/nasai:4574", "inBookReference": "Book 44, Hadith 126"}, {"id": 127, "hadithNumber": "4575", "text": "It was narrated that abu Al-Minhal said: \"Sharik sold some silver on credit for me. He came to me and told me. And I said: 'This is not correct.' He said; 'By Allah, I did this transaction in the market and no one criticized me .' So I went to Al-Bara bin Azib and asked him about that. He said: 'The Prophet came to us in Al-Madinah and we used to do this kind of transaction, but he said: Whatever is hand to hand, there is nothing wrong with it, but whatever is on credit, is Riba. Then he said to me: 'Go to Zaid bin Arqam.' So I went to him and asked him, and he said the same thing.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that abu Al-Minhal said:", "reference": "https://sunnah.com/nasai:4575", "inBookReference": "Book 44, Hadith 127"}, {"id": 128, "hadithNumber": "4576", "text": "Abu Al-Minhal said: \" I asked Al-Bara bin 'Azib and Zaid bin Arqam and they said: 'We were merchants at the time of the Messenger of Allah and we asked the Prophet of Allah about money exchange. He said: \"If it is done hand to hand there is nothing wrong with it, but if it is done on credit then it is not right.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4576", "inBookReference": "Book 44, Hadith 128"}, {"id": 129, "hadithNumber": "4577", "text": "Abu Al-Minhal said: \"I asked Al-Bara bin 'Azib about money exchange. He said: 'Ask Zaid bin Arqam, for he is better than me and more knowledgeable.' So I asked Zaid and he said: 'Ask Al-Bara for he is better than me and more knowledgeable.' And they both said: 'The Messenger of Allah forbade (selling) silver for gold on credit.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4577", "inBookReference": "Book 44, Hadith 129"}, {"id": 130, "hadithNumber": "4578", "text": "'Abdur-Rahman bin Abi Bakrah narrated that his father said: \"The Messenger of Allah forbade selling silver for silver and gold for gold, unless it was of equal amounts. And he told us to sell gold for silver however we wanted, and silver for gold however we wanted.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4578", "inBookReference": "Book 44, Hadith 130"}, {"id": 131, "hadithNumber": "4579", "text": "It was narrated from 'Abdur-Rahman bin Abi Bakrah that his father said: \"The Messenger of Allah forbade us from selling silver for silver unless it was of equal amounts, or selling gold for gold unless it was of equal amounts. The messenger of Allah said: 'Sell gold for silver however you want, and silver for gold however you want.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdur-Rahman bin Abi Bakrah that his father said:", "reference": "https://sunnah.com/nasai:4579", "inBookReference": "Book 44, Hadith 131"}, {"id": 132, "hadithNumber": "4580", "text": "Usmah bin Zaid Narrated that the Messenger of Allah said: \"There is no Riba except in credit.'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4580", "inBookReference": "Book 44, Hadith 132"}, {"id": 133, "hadithNumber": "4581", "text": "It was narrated that Abu Salih heard Abu Saeed Al-Khudri say: \"I said to Ibn Abbas: 'Do you think that what you are saying is something that you found in the Book of Allah, or something that you heard from the Messenger of Allah?' He said: 'I did not find it in the Book of Allah, nor did I hear it from the messenger of Allah, rather Usamah bin Zaid told me that the Messenger of Allah said: 'Riba is only in credit.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Salih heard Abu Saeed Al-Khudri say:", "reference": "https://sunnah.com/nasai:4581", "inBookReference": "Book 44, Hadith 133"}, {"id": 134, "hadithNumber": "4582", "text": "It was narrated that Ibn 'Umar said: \"I used to sell camels at Al-Baqi and I would sell Dinars in exchange for Dirhams. I came to the Prophet in the house of Hafsah and said: 'O Messenger of Allah, I want to ask you:  I sell camels in Al-Baqi and I sell Dinars in exchange for Dirhams. He said: 'There is nothing wrong with it if you take the price on that day, unless you depart when there is still unfinished business between you both (buyer and seller).\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4582", "inBookReference": "Book 44, Hadith 134"}, {"id": 135, "hadithNumber": "4583", "text": "It was narrated that Ibn 'Umar said: \"I used to sell gold for silver, or silver for gold. I came to the Messenger of Allah and told him about that, and he said: 'If you make a deal with your companion, d o not leave him when there is still any ambiguity (in the deal) between you.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4583", "inBookReference": "Book 44, Hadith 135"}, {"id": 136, "hadithNumber": "4584", "text": "It was narrated from Saeed bin Jubair that: he did not like to exchange Dinars for Dirhams or Dirhams for Dinars.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Saeed bin Jubair that:", "reference": "https://sunnah.com/nasai:4584", "inBookReference": "Book 44, Hadith 136"}, {"id": 137, "hadithNumber": "4585", "text": "It was narrated from Saeed bin Jubair, from Ibn 'Umar, that: he did not see anything wrong with parying Dirhams for Dinars.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Saeed bin Jubair, from Ibn 'Umar, that:", "reference": "https://sunnah.com/nasai:4585", "inBookReference": "Book 44, Hadith 137"}, {"id": 138, "hadithNumber": "4586", "text": "It was narrated from Ibrahim, with regard to exchanging Dirnars for Dirhams, that: he disliked it (this transaction) if it was done on credit. (Da 'if )", "grade": null, "narratedBy": "It was narrated from Ibrahim, with regard to exchanging Dirnars for Dirhams, that:", "reference": "https://sunnah.com/nasai:4586", "inBookReference": "Book 44, Hadith 138"}, {"id": 139, "hadithNumber": "4587", "text": "It was narrated from Saeed bin Jubair that: he did not see anything wrong with it even if it was on credit.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Saeed bin Jubair that:", "reference": "https://sunnah.com/nasai:4587", "inBookReference": "Book 44, Hadith 139"}, {"id": 140, "hadithNumber": "4588", "text": "Something similar was narrated form Saeed bin Jubair. Abu 'Abdur-Rehman (An-Nasai) said: This is what I have found on this topic.", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4588", "inBookReference": "Book 44, Hadith 140"}, {"id": 141, "hadithNumber": "4589", "text": "It was narrated that Ibn 'Umar said: \"I came to the Prophet and said: 'Wait, I want to ask you something. I sell camels in Al-Baqi with a price set in Dinars but I accept Dirhams instead.' He said: 'There is nothing wrong with it if you take the price on that day, still unfinished business between you both (buyer and seller)\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4589", "inBookReference": "Book 44, Hadith 141"}, {"id": 142, "hadithNumber": "4590", "text": "It was narrated that Jabir said: \"When the Prophet (ﷺ) came to Al-Madinah, he called for a scale and weighed (something) for me and gave me more.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4590", "inBookReference": "Book 44, Hadith 142"}, {"id": 143, "hadithNumber": "4591", "text": "It was narrated that Jabir said: 'The Messenger of Allah paid off what he owed me, and gave me more.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4591", "inBookReference": "Book 44, Hadith 143"}, {"id": 144, "hadithNumber": "4592", "text": "It was narrated that Suwaid bin Qais said: \"Makhrafah Al-Abdi and I brought some cloth from Hajar, and the Messenger of Allah came to us while we were in Mina where there w a man who weighed (goods) in return for payment. He bought some trousers from us, and said to the man who weighed: 'Weigh it, and allow more.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Suwaid bin Qais said:", "reference": "https://sunnah.com/nasai:4592", "inBookReference": "Book 44, Hadith 144"}, {"id": 145, "hadithNumber": "4593", "text": "It was narrated that Simak bin Harb said: \"I heard Abu Safwan say: 'I bought a pair of trousers from the Messenger of Allah before the Hijrah, and he weighed it for me and allowed me.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Simak bin Harb said:", "reference": "https://sunnah.com/nasai:4593", "inBookReference": "Book 44, Hadith 145"}, {"id": 146, "hadithNumber": "4594", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah said: \"Volume is to be measured according to the system of the people of Al-Madinah, and weight is to be measured according to the system of the peole of Makkah.\"' (Sahih) \nThis is the wording of Ishaq (one of the narrators).", "grade": null, "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4594", "inBookReference": "Book 44, Hadith 146"}, {"id": 147, "hadithNumber": "4595", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah said: 'Whoever buys food, let him not sell it until he has taken possession of it.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4595", "inBookReference": "Book 44, Hadith 147"}, {"id": 148, "hadithNumber": "4596", "text": "It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said: \"Whoever buys food let him not sell it until he has taken possession of it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4596", "inBookReference": "Book 44, Hadith 148"}, {"id": 149, "hadithNumber": "4597", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah said: 'Whoever buys food, let him not sell it until he has checked its weight.\"\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4597", "inBookReference": "Book 44, Hadith 149"}, {"id": 150, "hadithNumber": "4598", "text": "It was narrated that Ibn 'Abbas said: \"I heard the Prophet say\" something similar to the preceding two reports \"until he takes possession of it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4598", "inBookReference": "Book 44, Hadith 150"}, {"id": 151, "hadithNumber": "4599", "text": "It was narrated that Tawus said: \"I heard Ibn 'Abbas say: 'As for that which the Messenger of Allah forbade, (it is) selling before taking possession of food.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Tawus said:", "reference": "https://sunnah.com/nasai:4599", "inBookReference": "Book 44, Hadith 151"}, {"id": 152, "hadithNumber": "4600", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah said: 'Whoever buys food let him not sell it until he takes possession of it. Ibn 'Abbas said: \"I think the same applies to everything else as to food.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4600", "inBookReference": "Book 44, Hadith 152"}, {"id": 153, "hadithNumber": "4601", "text": "It was narrated that Hakim bin Hizam said: \"The Messenger of Allah said: \"Do not sell food until you have bought it and taken possession of it.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Hakim bin Hizam said:", "reference": "https://sunnah.com/nasai:4601", "inBookReference": "Book 44, Hadith 153"}, {"id": 154, "hadithNumber": "4602", "text": "Ibn Jurayi said: \"Ata' told me that from 'Abdullah bin 'Ismah Al-Jushami from Hakim bin Hizam from the prophet. \"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4602", "inBookReference": "Book 44, Hadith 154"}, {"id": 155, "hadithNumber": "4603", "text": "Hakim bin Hizam said: \"I bought some food and made food and made a profit on it (by selling it) before I took possession of it. I came to the Messenger of Allah and told him about that and he said: 'Do not sell it until you take possession of it.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4603", "inBookReference": "Book 44, Hadith 155"}, {"id": 156, "hadithNumber": "4604", "text": "It was narrated from Ibn 'Umar that: the Prophet forbade anyone to sell food that he brought", "grade": null, "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4604", "inBookReference": "Book 44, Hadith 156"}, {"id": 157, "hadithNumber": "4605", "text": "It was narrated that 'Abdullah bin 'Umar said: \"During the time the Messenger of Allah we used to buy food, and he sent someone to tell us to remove it from the place where we had bought it, to another place, b before selling\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah bin 'Umar said:", "reference": "https://sunnah.com/nasai:4605", "inBookReference": "Book 44, Hadith 157"}, {"id": 158, "hadithNumber": "4606", "text": "It was narrated from Ibn 'Umar that: they used to buy and sell during the time of the Messenger of Allah at the top of the marketplace without measuring. The Messenger of Allah forbade them to sell it in the place where they had bought it until they moved it.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4606", "inBookReference": "Book 44, Hadith 158"}, {"id": 159, "hadithNumber": "4607", "text": "It was narrated from Nafi that Ibn 'UMar told them, that: they used to buy foold from the riders at the time of the Messenger of Allah and he forbade them to sell it in the place where they had bought it until they moved it to the food market.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Nafi that Ibn 'UMar told them, that:", "reference": "https://sunnah.com/nasai:4607", "inBookReference": "Book 44, Hadith 159"}, {"id": 160, "hadithNumber": "4608", "text": "It was narrated from Salim that his father said: \"I saw people being beaten (in punishment) at the time of the Messenger of Allah for buying food unmeasured and selling it before bringing it to their own camp.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim that his father said:", "reference": "https://sunnah.com/nasai:4608", "inBookReference": "Book 44, Hadith 160"}, {"id": 161, "hadithNumber": "4609", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah bought some food from a Jew with payment to be made later, and he put his shield in pledge for that.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4609", "inBookReference": "Book 44, Hadith 161"}, {"id": 162, "hadithNumber": "4610", "text": "It was narrated from Anas bin Malik that he brought some barley bread and rancid oil to the Messenger of Allah. He said: \"He put his armor in pledge for that with a Jew in Al-Madinah, and he took some barley from him for his family.", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4610", "inBookReference": "Book 44, Hadith 162"}, {"id": 163, "hadithNumber": "4611", "text": "It was narrated from'Amr bin Shu'aib, from his father that his grandfather, Said: that the Messenger of Allah said: \"It is not permissible to lend on the condition of a sale, or to have two conditions in one transaction, or to sell what you do not have.\" (Sahih", "grade": null, "narratedBy": "It was narrated from'Amr bin Shu'aib, from his father that his grandfather, Said:", "reference": "https://sunnah.com/nasai:4611", "inBookReference": "Book 44, Hadith 163"}, {"id": 164, "hadithNumber": "4612", "text": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said: \"The Messenger of Allah said: 'No man is bound by a transaction involving the sale of something that he does not possess.'''", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:", "reference": "https://sunnah.com/nasai:4612", "inBookReference": "Book 44, Hadith 164"}, {"id": 165, "hadithNumber": "4613", "text": "It was narrated that Hakim bin Hizam said: \"I asked the Prophet \"O Messenger of Allah, a man may come to me and ask me to sell him something that I do not have. Can I sell it to him then go and buy it from the market?' He said: 'Do not sell what you do not have.'''", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Hakim bin Hizam said:", "reference": "https://sunnah.com/nasai:4613", "inBookReference": "Book 44, Hadith 165"}, {"id": 166, "hadithNumber": "4614", "text": "It was narrated that 'Abdullah Ibn Abi Awfa about paying in advance. He said: 'We used to pay in advance during the time of the Messenger of Allah and Abu Bakr and 'Umar, for wheat, barley and dates, paying people whom we did not know if they had those things or not.'''Ibn Abza said meaning, similarly.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdullah Ibn Abi Awfa about paying in advance. He said:", "reference": "https://sunnah.com/nasai:4614", "inBookReference": "Book 44, Hadith 166"}, {"id": 167, "hadithNumber": "4615", "text": "Ibn Abi Al-Mujalid-on one occasion he (the narrator) said 'Abdullah, and on another occasion he said Muhammad - said: \"Abu Burdah and 'Abdullah bin Shaddad argued about payment in advance. They sent me to Ibn Abi Awfa and I asked him (about that). He said: 'We used to pay in advance during the time of the Messenger of Allah and Abu Bakr and 'Umar, for wheat, barley, raisins and dates, paying people whom we did not see it with them.\" And I asked Ibn Abza and he said something similar to that.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4615", "inBookReference": "Book 44, Hadith 167"}, {"id": 168, "hadithNumber": "4616", "text": "It was narrated that Abu Al-Minhal said: \"I heard Ibn 'Abbas say: 'When the Prophet came (to al-Madinah), they used to pay in advance for dates, two or three years in advance. He forbade them that and said: 'whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time'''", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Al-Minhal said:", "reference": "https://sunnah.com/nasai:4616", "inBookReference": "Book 44, Hadith 168"}, {"id": 169, "hadithNumber": "4617", "text": "It was narrated from Abu Rafi that the Messenger of Allah borrowed a young camel from a man, and then he came to get his camel back. He said to a man: \"Go and buy a young camel for him.\" He came and said: \"I could only get a Raba camel of good quality.\" He said: \"Give it to him, for the best of the Muslims is the one who is best in repaying.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4617", "inBookReference": "Book 44, Hadith 169"}, {"id": 170, "hadithNumber": "4618", "text": "It was narrated that Abu Hurairah said: \"A man had lent a camel of a certain age to the Prophet and he came to get it back. He said: \"Give it to him\" But they could only find a camel that was older than it. He said: \"Give it to him.\" He said: \"You have repaid me well,\" The Messenger of Allah said; \"The best of you is the one who is best in repaying\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4618", "inBookReference": "Book 44, Hadith 170"}, {"id": 171, "hadithNumber": "4619", "text": "Irbad bin Saryah said: \"I lent a young camel to the Messenger of Allah, and I came to ask him to repay me. He said: 'Yes, I will only repay you with a superior she-camel.' so he repaid me and repaid me well. Then a Bedouin came to him to ask to repay him a camel of a certain age, and the Messenger of Allah said: 'Give him a camel of certain age.' On that day they gave him a mature camel and he said: 'This is better than my camel.' He (The Prophet) Said:' The best of you is the one who is best in repaying.'''", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4619", "inBookReference": "Book 44, Hadith 171"}, {"id": 172, "hadithNumber": "4620", "text": "It was narrated from Sasmurah that: the Messenger of Allah forbade selling animals in exchange for animal's ion credit.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Sasmurah that:", "reference": "https://sunnah.com/nasai:4620", "inBookReference": "Book 44, Hadith 172"}, {"id": 173, "hadithNumber": "4621", "text": "It was narrated that Jabir Sair: \"A slave came and gave his pledge to the Messenger of Allah to emigrate, and the Prophet did not realize that he was a slave. Then his master came looking for him. The Prophet said; 'Sell him to me.' So he bought him for two black slaves, then he did not accept until he had asked; 'Is he a slave?'''", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir Sair:", "reference": "https://sunnah.com/nasai:4621", "inBookReference": "Book 44, Hadith 173"}, {"id": 174, "hadithNumber": "4622", "text": "It was narrated from Ibn 'Abbas that the Propher said: \"Paying in advance for the offspring of the offspring of a pregnant animal (Habal al-Habalah) is Riba''", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Abbas that the Propher said:", "reference": "https://sunnah.com/nasai:4622", "inBookReference": "Book 44, Hadith 174"}, {"id": 175, "hadithNumber": "4623", "text": "It was narrated from Ibn 'Umar that: the Prophet forbade selling the offspring of the offspring of a pregnant animal (Habal Al-Habalah)", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4623", "inBookReference": "Book 44, Hadith 175"}, {"id": 176, "hadithNumber": "4624", "text": "It was narrated from Ibn 'Umar that: the Prophet forbade selling the offspring of the offspring of a pregnant animal (Habal Al-Habalah)", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4624", "inBookReference": "Book 44, Hadith 176"}, {"id": 177, "hadithNumber": "4625", "text": "It was narrated from Ibn 'Umar that: the Messenger of Allah forbade selling the offspring of the offspring of a pregnant animal (Habal Al-Habalah), which was a transaction practiced by the people of the Jahiliyyah, whereby a man would buy camel to slaughter, but he would wait until the she-camel had produced offspring and the offspring in her belly had then produced offspring.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4625", "inBookReference": "Book 44, Hadith 177"}, {"id": 178, "hadithNumber": "4626", "text": "It was narrated that Jabir said: \"The Messenger of Allah forbade selling the produce several years in advance.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4626", "inBookReference": "Book 44, Hadith 178"}, {"id": 179, "hadithNumber": "4627", "text": "It was narrated from Jabir that: the Messenger of Allah forbade selling the produce several years in advance.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4627", "inBookReference": "Book 44, Hadith 179"}, {"id": 180, "hadithNumber": "4628", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah was wearing two Qitri garments which, if he sat and sweated, would become heavy (and uncomfortable). A Jewish man got some fabric from Ash-sham so I said: 'Why don't you send word to him to buy two garments from him, and pay him when things get easier?' So he sent word to him, but he said: 'I know what Muhammad wants; he wants to go away with my money and take them (the two garments).' The Messenger of Allah said; 'He is lying; he knows that I am one of the ones who fear Allah the most, and are most honest in fulfilling trusts.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4628", "inBookReference": "Book 44, Hadith 180"}, {"id": 181, "hadithNumber": "4629", "text": "It was narrated from 'Amr bin shu'aib, from his father, from his grandfather, that: the Messenger of Allah prohibited lending on the condition of a sale, or to have two conditions in one transaction, or to profit from what you do not posses.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Amr bin shu'aib, from his father, from his grandfather, that:", "reference": "https://sunnah.com/nasai:4629", "inBookReference": "Book 44, Hadith 181"}, {"id": 182, "hadithNumber": "4630", "text": "'Amr bin shu'aib said: \"My father told me, mar rating from his father, from his father (and he mentioned 'Abdullah bin 'Amr) that he said: \"The Messenger of Allah said: \"It is not permissible to lend on the condition of a sale, or to stipulate two conditions in one transaction, or to make a profit on that which you do not possess.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4630", "inBookReference": "Book 44, Hadith 182"}, {"id": 183, "hadithNumber": "4631", "text": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said: \"The Messenger of Allah forbade lending on the condition of a sale, selling what you do not have, and profiting on what you do not possess.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:", "reference": "https://sunnah.com/nasai:4631", "inBookReference": "Book 44, Hadith 183"}, {"id": 184, "hadithNumber": "4632", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah forbade two transactions in one.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4632", "inBookReference": "Book 44, Hadith 184"}, {"id": 185, "hadithNumber": "4633", "text": "It was narrated from Jabir that: the Prophet forbade Muhaqalah, Muzahanah, Mukhabarah and selling with an exception unless it is defined.", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4633", "inBookReference": "Book 44, Hadith 185"}, {"id": 186, "hadithNumber": "4634", "text": "It was narrated that Jabir said: \"The Messenger of Allah forbade Muhaqalah, Muzahanah, Mukhabarah, Mu'awamah, and selling with an exception unless it is defined but he gave concession allowing 'Araya.", "grade": null, "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4634", "inBookReference": "Book 44, Hadith 186"}, {"id": 187, "hadithNumber": "4635", "text": "It was narrated from Ibn 'Umar that the Prophet said: \"Any man who pollinates a date-palm tree then sells it, the fruits of the tree are for the one who pollinated it, unless the purchaser stipulated otherwise.\"", "grade": null, "narratedBy": "It was narrated from Ibn 'Umar that the Prophet said:", "reference": "https://sunnah.com/nasai:4635", "inBookReference": "Book 44, Hadith 187"}, {"id": 188, "hadithNumber": "4636", "text": "It was narrated from Salim, from his father that the Prophet said: \"Whoever buys a date-palm tree after it has been pollinated, its fruits belong to the seller, unless the purchaser has stipulated otherwise. And whoever buys a slave who has wealth, his wealth belongs to the seller, unless the purchaser has stipulated otherwise. \"(sahih)", "grade": null, "narratedBy": "It was narrated from Salim, from his father that the Prophet said:", "reference": "https://sunnah.com/nasai:4636", "inBookReference": "Book 44, Hadith 188"}, {"id": 189, "hadithNumber": "4637", "text": "It was narrated that Jabir bin 'Abdullah said: \"I was with the Prophet on a journey, and my camel got tired. I thought I wanted to let it go, but the Messenger of \"Allah met me and prayed for it (the camel) and hit it. Then it started to run like never before. He said: 'Sell it to me for one Uwqyah.' I said\" 'No.' He said: 'Sell it to me.' So I sold it to him for one Uwqiyah but stipulated an exception, to ride it until we reached al-Madinah. When we reached Al-Medina, I brought the camel to him and asked him for its price, then I went back. He sent word to me saying; 'Do you think I bargained with you to take your camel?' Take your camel and your Dirhams.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin 'Abdullah said:", "reference": "https://sunnah.com/nasai:4637", "inBookReference": "Book 44, Hadith 189"}, {"id": 190, "hadithNumber": "4638", "text": "It was narrated that Jabir said: \"I went on a campaign with the Messenger of  Allah riding a camel of ours,\" then he quoted the whole Hadih. Then he said words to the effect that: \"The camel got tried and the Prophet hit it, so it became energetic and came to the front of the army. The Prophet said: 'O Jabir, I see that your camel has become energetic.' I said: \"It is because of your blessing, O Messenger of Allah,' He said: 'Sell it to me, and you can ride it till we arrive (in Al-Madinah). 'So I sold it to him. I was in great need of it myself but I felt too shy to refuse. When we finished our campaign, and we were close to Al-Madinah, I asked his permission to go on ahead. I said: 'O Messenger of Allah, I am newly married.' He said; 'Have you married a virgin or a previously married woman?' I said: 'A previously married woman, O Messenger of Allah. 'Abdullah bin 'Arm died and left behind young druthers, and I did not like to bring to them someone who was like them, so I married a previously married woman who could teach the, and rise them with good manners.' So he gave me permission, and said to me; 'Go to When I arrived, I told my maternal uncle that I had sold the camel and he scolded me. When the Messenger of Allah came, I brought the camel to him, and he gave me the price of the camel, and the camel, and share (of the spoils of war) with the rest of the people.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4638", "inBookReference": "Book 44, Hadith 190"}, {"id": 191, "hadithNumber": "4639", "text": "It was narrated that Jabir 'Abdullah said: \"I was with the Messenger of Allah on a journey, and I was riding a camel. He said: 'Why are you at the back of the people?, I said: 'My camel is tired, He took hold of its tail and shouted at it, then I was at the front of the people, worrying that it would go ahead of the others. When we drew close to al-Madinah he said: 'What happened to the camel? Sell it to me.' I said, No, it is yours O Messenger of Allah.; He said, 'No, sell it tome. I said, 'No, it is yours, O Messenger of Allah.' He said: 'No, sell it to me. I will take it for one Uwqiyah but you (continue to) ride it. Then when you reach Al-Madinah, bring it to us.' So when I reached Al-Madinah, I brought it him. He said to Bilal: 'O Bilal, weight out for him one Uwqiyyah and add a Qirat.' I said: 'This is something extra that the Messenger of Allah gave to.' I kept it with me and put it in a bag, and it stayed with me until the people of Ash-Sham came on the Day of Al-Harrah and took from us what they took.'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir 'Abdullah said:", "reference": "https://sunnah.com/nasai:4639", "inBookReference": "Book 44, Hadith 191"}, {"id": 192, "hadithNumber": "4640", "text": "It was narrated tat Jabir Said: \"The Messenger of Allah caught up with me when I was riding a bad camel of ours, and I said: 'We have a bad camel, mare's the pit! The Prophet said: Will you sell it to me, O Jabir?' I Said, 'No, It is yours, O Messenger of Allah.; He said: 'O Allah forgive him; O Allah, have mercy on him. I will buy it for such and such, and I will lend it to you to ride until (we reach) al-Madinah.' When Reached al-Madinah, I prepared it, and brought it to him, and he said: O Bilal, give him its price,' When I turned to leave, he called me back, and I was afraid that he would give it back at he said: 'It is yours.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated tat Jabir Said:", "reference": "https://sunnah.com/nasai:4640", "inBookReference": "Book 44, Hadith 192"}, {"id": 193, "hadithNumber": "4641", "text": "It was narrated that Jabir bin 'Abdullah said: \"We were traveling with the Messenger of Allah and I was riding a camel. The Messenger of Allah said to me: 'Will you sell it to me for such and such, may Allah forgive you?', I said, I said, 'Yes, it is yours, O Prophet of Allah.' He said: 'Will you sell it to me for such and such, may Allah forgive your?' I said: 'Yes, it is yours, O Prophet of \"Allah.' He said: 'Will you sell it to me for such and such, may Allah forgives you?' I said: 'Yes, it is yours. '''(One of the narrators) Abu Nadrah said: \"This became a phrase that was used by the Muslims: 'Do such and such, may Allah forgive you.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir bin 'Abdullah said:", "reference": "https://sunnah.com/nasai:4641", "inBookReference": "Book 44, Hadith 193"}, {"id": 194, "hadithNumber": "4642", "text": "It was narrated that 'Aishah said: \"I bought Barirah and her masters stipulated that her loyalty (Wala) should be to them, I mentioned that to the Prophet and he said: 'Set her free, and loyalty belongs to the one who pays the silver.''' She said: \"so I set her free. The Messenger of Allah called her and gave her the choice regarding her husband, and she chose herself. Her husband was a free man.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4642", "inBookReference": "Book 44, Hadith 194"}, {"id": 195, "hadithNumber": "4643", "text": "It was narrated from Aishah that: she wanted to buy Barirah to set her free, but they stipulated that her loyalty (should be to them. She mentioned that to the Messenger of Allah and the Messenger of Allah said: \"Buy her, and wet her free and loyalty (Wala) belongs to the one who sets the slave free.\" Some meat was brought to the Messenger of and it was said that this had been given in charity to Bariirah. He said: \"It is charity for her, and a gift for us.\" And she was given the choice", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Aishah that:", "reference": "https://sunnah.com/nasai:4643", "inBookReference": "Book 44, Hadith 195"}, {"id": 196, "hadithNumber": "4644", "text": "It was narrated from'Abdullah bin 'Umar that 'Aishah wanted to but a slave woman to set her free, but her people said: \"We will sell her to you on condition that her loyalty (Walla) is to us,\" She mentioned that top the Messenger of Allah and he said: \"That should not stop you. Loyalty belongs to the one who sets the slave free.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4644", "inBookReference": "Book 44, Hadith 196"}, {"id": 197, "hadithNumber": "4645", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah forbade selling something from the spoils of war prior to its distribution, having intercourse with a pregnant woman until she gives birth, and (eating) the flesh of any predator that has fangs.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4645", "inBookReference": "Book 44, Hadith 197"}, {"id": 198, "hadithNumber": "4646", "text": "it was narrated that Jabir said: \"The Messenger of Allah said: 'Pre-emption is to be given in everything that is shared, whether it is a house or a garden. It is not right to sell it before informing one's partner, and if he sells it he (the partner) has more right to it, unless he gives Permission to sell it to someone else.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4646", "inBookReference": "Book 44, Hadith 198"}, {"id": 199, "hadithNumber": "4647", "text": "It was narrated from 'Umarah bin Khuzaimah that his paternal uncle, who was one of the companions of the Prophet told him, that: the Prophet bought a horse from a Bedouin and asked him to follow him, so that he could pay him for the horse. The Prophet hastened but the Bedouin was slow. Men started to talk to the Bedouin and make offers for the horse, and they did not realize that the Prophet had bought it, until some of them offered more than the Prophet had bought it for. Then the Bedouin called out to the Prophet and said; \"Are you going to buy this horse or shall I sell it?\" The Prophet stood up when he heard him calling and said: \"Have I not bought it from you?\" He said: 'No, by Allah, I have not sold it to you, and the Prophet said \"I bought it from you.\" The people started to gaiter around the Prophet and the Bedouion as they were talking, and the Bedouin started to say: \"Bring a witness who will testify that you bought it. \" Khuzaimah bin habit said: \"I bear witness that you bought it\" The Prophet turned to Khunzimah and said: \"Why are you bearing witness?\" He said: \"Because I know that you are truthful, O Messenger of Allah\" made the testimony of Khuzaimah equivalent to the testimony of two men. (sahih)", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4647", "inBookReference": "Book 44, Hadith 199"}, {"id": 200, "hadithNumber": "4648", "text": "'Abdullah said: \"I heard the Messenger of Allah say: 'If the two parties to a transaction disagree, and neither of them has any proof, then it is as the owner of the goods says, or they may cancel it.'''", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4648", "inBookReference": "Book 44, Hadith 200"}, {"id": 201, "hadithNumber": "4649", "text": "It was narrated that 'Abdul-Malik bin'Ubaid said: \"We were with Abu 'Ubaidah bin 'Abdullah bin Mas'ud when two men who were involved in a transaction came to him. One of them said: 'I bought it for such and such', and the other said; 'I sold it to him for such and such,' Abu 'Ubaidah said\" 'something like this was brought to Ibn Masud, and he said; I was with something like this was brought to him. He told the seller to swear an oath, them he gave the purchaser the choice; If he wished, he could buy it, and if he wished he could cancel (the transaction)''", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Abdul-Malik bin'Ubaid said:", "reference": "https://sunnah.com/nasai:4649", "inBookReference": "Book 44, Hadith 201"}, {"id": 202, "hadithNumber": "4650", "text": "It was narrated that 'Aishah said: \"The Messenger of Allah bought some food from a Jew on credit, and he gave him a shield of his as a pledge. \"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4650", "inBookReference": "Book 44, Hadith 202"}, {"id": 203, "hadithNumber": "4651", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah died when his shield was in pledge with a Jew for thirty Sa's of barley for his family", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4651", "inBookReference": "Book 44, Hadith 203"}, {"id": 204, "hadithNumber": "4652", "text": "It was narrated that Jabir said: \"A man from Banu 'Adhrah stated that a slave of his was to be set free after he died. News of that reached the Messenger of Allah and he said: 'Do you have any other property basides him/' He said? 'No.' the Messenger of Allah said; 'Who will buy him from me?' Nu'aim bin 'Abdullah Al-Adawi bought him for eight hundred Dirhams, which the Messenger of Allah brought and gave to him (the former owner). Then the Messenger of Allah said: 'Start with yourself and give charity to (yourself). If there is anything left over, then give it to your family; if there is anything left over from your family, then give it to your relatives; if there is anything left over from your relatives, then give it to such and such,' saying 'In front of you, to your right and to your left.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4652", "inBookReference": "Book 44, Hadith 204"}, {"id": 205, "hadithNumber": "4653", "text": "It was narrated from Jabir that: a man from among the Ansar who was called Abu (Madhkur) stated that a slave of his who was called Ya'qub was to be set free after he died, and he did not own any other property apart from him. The Messenger of Allah called for him (the slave) to be brought and he said: \"Who will buy him?\" Nu'aim bin 'Abdullah bought him for eight hundred dirhams, and he gave it to him and said: \"If one of you is poor, let him start with himself; if there is anything left over, (let him give it) to his dependents; if there is anything left over, (let him give it) to his relatives; and if there is anything left over, (let him give it) here and there.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4653", "inBookReference": "Book 44, Hadith 205"}, {"id": 206, "hadithNumber": "4654", "text": "It was narrated from Jabir that: the Prophet sold a Mudabbar.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4654", "inBookReference": "Book 44, Hadith 206"}, {"id": 207, "hadithNumber": "4655", "text": "It was narrated from'Aishah that Barirah came to 'Aishah asking her to help her with her contract of manumission.' Aishah said: \"Go back to your masters, and if they agree to let me pay off your contract of manumission, and let your loyalty be to me, then I will do it\" Barirah told her masters about that, but they refused and said: \"If she wants to seek reward (with Allah) by freeing you, let her do so, but your loyalty will be to us.\" She told the Messenger of Allah about that , and the Messenger of Allah said to her; \"Buy her and set her free, and loyalty belongs to the one who set the slave free,\" Then the Messenger of Allah said: \"What is the matter with people who stipulate conditions that are not in the Book of Allah? Whoever stipulates something that is not in the Book of Allah, it is not valid even if he stipulates one hundred conditions? The condition of Allah is more deserving of being followed and is more hinting.\"", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4655", "inBookReference": "Book 44, Hadith 207"}, {"id": 208, "hadithNumber": "4656", "text": "It was narrated that 'Aishah said: \"Barirah came to me and said: 'O 'Sishah, I have drawn up a contract of manumission with my master, (to buy my freedom) in return for nine Uwqiyah, one Uwqiyah to be paid each year; help me,' she had not yet paid anything toward her contract of manumission.' 'Aishah, who liked her and wanted to help her, said: 'Go back to your masters and if they agree to let me pay the whole sum and that your loyalty will be to me, I will do it.' So Barirah went to her masters and suggested that to them, but they refused and said: 'if she wants to seek reward (with Allah) by freeing you, let her do so, but (you loyalty) will be to us, 'Aishah told the Messenger of Allah about that and he said: 'Do not let that stop you. Buy her and set her free, and loyalty belongs to the one who sets the slave free.; so she did that, then the Messenger of Allah stood up before the people, praised and glorified Allah, then said: 'What is the matter with people who stipulate conditions that are not in the Book of Allah? Whoever stipulates conditions that are not in even if there are a hundred conditions? The decree of Allah takes priority, and the conditions of Allah binding. And loyalty belongs to the one who sets the slaves free.'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4656", "inBookReference": "Book 44, Hadith 208"}, {"id": 209, "hadithNumber": "4657", "text": "it was narrated from 'Abdullah that: the Messenger of Allah forbade selling loyalty or giving it away.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4657", "inBookReference": "Book 44, Hadith 209"}, {"id": 210, "hadithNumber": "4658", "text": "It was narrated from Ibn 'Umar that: the Messenger of Allah forbade selling loyalty or giving it away. (Shah)", "grade": null, "narratedBy": "It was narrated from Ibn 'Umar that:", "reference": "https://sunnah.com/nasai:4658", "inBookReference": "Book 44, Hadith 210"}, {"id": 211, "hadithNumber": "4659", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah forbade selling loyalty or giving it away.\" (Sahih)]", "grade": null, "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4659", "inBookReference": "Book 44, Hadith 211"}, {"id": 212, "hadithNumber": "4660", "text": "It was narrated from Jabir that: the Messenger of Allah forbade selling water.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that:", "reference": "https://sunnah.com/nasai:4660", "inBookReference": "Book 44, Hadith 212"}, {"id": 213, "hadithNumber": "4661", "text": "Abu Al-Minhal said: \"I heard Iyas bin 'Umar\" - and on one occasion he said: \"Ibn 'Abd - say: 'I heard the Messenger of Allah forbid the sale of water.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4661", "inBookReference": "Book 44, Hadith 213"}, {"id": 214, "hadithNumber": "4662", "text": "It was narrated from Iyas that: the Messenger of Allah forbade selling surplus water. The keeper of al-Wahat sold the surplus water of al-Wahat, and 'Abdullah bin 'Arm disapproved of that.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Iyas that:", "reference": "https://sunnah.com/nasai:4662", "inBookReference": "Book 44, Hadith 214"}, {"id": 215, "hadithNumber": "4663", "text": "Iya bin 'Abd, the companion of the Prophet said: \"do not sell surplus water, for the Prophet forbade the sale of surplus water.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4663", "inBookReference": "Book 44, Hadith 215"}, {"id": 216, "hadithNumber": "4664", "text": "It was narrated from Ibn Wa'lah Misri that he asked Ibn 'Abbas about what is produced from grapes. Ibn'Abbas said: \"A man gave the Messenger of Allah a skin full of wine, and the Prophet said to him;' did you know that Allah has forbidden it?' He whispered something and I did not understand what he whispered as I wanted to. I asked a person who was beside him and the Prophet said to him; 'What are you whispering about?' He said: 'I told him to sell it.' The Prophet said: 'The One Who forbade drinking it also forbade selling it.' Then he opened the vessels and poured out their contents.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4664", "inBookReference": "Book 44, Hadith 216"}, {"id": 217, "hadithNumber": "4665", "text": "It was narrated that 'Aishah said: \"When the Verses of Riba were revealed, the Messenger of\nAllah (ﷺ) stood up on the Minbar and recited them to the people, then he forbade dealing in wine.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that 'Aishah said:", "reference": "https://sunnah.com/nasai:4665", "inBookReference": "Book 44, Hadith 217"}, {"id": 218, "hadithNumber": "4666", "text": "Abu Mas'us 'Uqbah bin 'Amr said: \"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator, and the fee of a fortuneteller.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4666", "inBookReference": "Book 44, Hadith 218"}, {"id": 219, "hadithNumber": "4667", "text": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah said - among the things that be forbade - 'And the price of a dog.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Abbas said:", "reference": "https://sunnah.com/nasai:4667", "inBookReference": "Book 44, Hadith 219"}, {"id": 220, "hadithNumber": "4668", "text": "It was narrated from Jabir bin 'Adbullah that: the Messenger of Allah forbade the price of dogs and cats, except hunting dogs. (Da'if)\nAbu 'Abdur-Rahman  (An-Nasa'i) said: This is Munkar.", "grade": null, "narratedBy": "It was narrated from Jabir bin 'Adbullah that:", "reference": "https://sunnah.com/nasai:4668", "inBookReference": "Book 44, Hadith 220"}, {"id": 221, "hadithNumber": "4669", "text": "It was narrated from Jabir bin 'Abdullah that he heard the Messenger of Allah say, when he was in Makkah during the Year of the Conquest: \"Allah and His Messenger have forbidden the sale of wine, dead animals, pigs and idols.\" It was said: \"O messenger of Allah, what do you thing about the fat of the dead animal, for ships are caulked with it, skins are daubed with it and people use it in their lamps.\" He said: \"No, it is Haram.\" And the Messenger of Allah then said: \"My Allah curse the Jews, for when Allah, the Mighty and Sublime, forbade the meat (of dead animals) to them, they melted it down and sold it, and consumed its price.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4669", "inBookReference": "Book 44, Hadith 221"}, {"id": 222, "hadithNumber": "4670", "text": "Jabir said: \"The Messenger of Allah forbade charging stud fees for a camel, the sale of water, the renting of land for cultivation. Selling one's land and water, this is what the Prophet forbade.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4670", "inBookReference": "Book 44, Hadith 222"}, {"id": 223, "hadithNumber": "4671", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah forbade charging stud fees for a stallion.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4671", "inBookReference": "Book 44, Hadith 223"}, {"id": 224, "hadithNumber": "4672", "text": "It was narrated that Anas bin Malik said: \"A man from Banu As-Sa'q, one of Banu Kilab, came to the Messenger of Allah and asked him about charging stud fees for a stallion. He forbade him to do that, but he said: 'We give payment for that. \"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Anas bin Malik said:", "reference": "https://sunnah.com/nasai:4672", "inBookReference": "Book 44, Hadith 224"}, {"id": 225, "hadithNumber": "4673", "text": "Abu Hurairah said: \"The Messenger of Allah forbade the earnings of a cupper, the price of a dog and stud fees for a stallion.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4673", "inBookReference": "Book 44, Hadith 225"}, {"id": 226, "hadithNumber": "4674", "text": "It was narrated that (Abu Hurairah) said: \"The Messenger of Allah forbade the price of a dog and stud fees for a stallion.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that (Abu Hurairah) said:", "reference": "https://sunnah.com/nasai:4674", "inBookReference": "Book 44, Hadith 226"}, {"id": 227, "hadithNumber": "4675", "text": "It was narrated that (Abu Hurairah) said: \"The Messenger of Allah forbade the price of a dog and stud fees for a stallion.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that (Abu Hurairah) said:", "reference": "https://sunnah.com/nasai:4675", "inBookReference": "Book 44, Hadith 227"}, {"id": 228, "hadithNumber": "4676", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"If a person becomes bankrupt, then a man finds the goods that he sold to him with him, he has more right to them than anyone else.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4676", "inBookReference": "Book 44, Hadith 228"}, {"id": 229, "hadithNumber": "4677", "text": "It was narrated from Abu Hurairah from the Prophet, that: if a man becomes bankrupt, then a specific item is found with him, and is recognized, then it belongs to the one who sold it to him.", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah from the Prophet, that:", "reference": "https://sunnah.com/nasai:4677", "inBookReference": "Book 44, Hadith 229"}, {"id": 230, "hadithNumber": "4678", "text": "It was narrated the Abu Sa'eed Al-Khudri said: \"At the time of the Messenger of Allah, a man suffered loss of some fruit that he had purchased, and his debts increased. \"The Messenger of Allah said: 'Give him charity.' So the people gave him charity, but that was not enough to pay off his debts. 'The Messenger of Allah said: 'Take what you find, but you have no right to more than that.\"' (meaning his creditors).", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated the Abu Sa'eed Al-Khudri said:", "reference": "https://sunnah.com/nasai:4678", "inBookReference": "Book 44, Hadith 230"}, {"id": 231, "hadithNumber": "4679", "text": "Usaid bin Hudair bin Simak narrated that: the Messenger of Allah ruled that if a man found (his goods) in the possession of a man who was not guilty, then if he wished he could give the man what he had paid for it, or if he wished he could go after the one who had stolen it. Abu Bakr and 'Umar passed similar judgments.", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4679", "inBookReference": "Book 44, Hadith 231"}, {"id": 232, "hadithNumber": "4680", "text": "Usaid bin Zubair Al-Ansari, who was one of Banu Harithah narrated that: there was the governor of Al-Yamamah, and Marwan wrote to him saying that Mu'awiyah had written to him, saying that any man who had something stolen from him had more right to it wherever he found it. Then Marwan wrote saying that to me (Usaid). I wrote to Marwan saying that the Prophet had ruled that if the one who bought it from the one who stole it is ot guilty of anything (and did not realize that it was stolen goods), then the owner has the choice: If he wishes, he may buy it from the one who bought it from the thief, or if he wishes he may go after the thief. Abu Bakr, 'Umar and 'Uthman also passed judgment along these lines. Marwan sent my letter to Mu'awiyah, and Mu'awiyah wrote to Marwan (saying): 'Neither you nor Usaid are in a position to tell me what to do, rather I am the one who tells you what to do because I am superior in rank to you, so do what I tell you.' Marwan sent the letter of Mu'awiyah to me, and I said: I will not judge according to Mu'awiyah's opinion as long as I am the governor.\"'", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4680", "inBookReference": "Book 44, Hadith 232"}, {"id": 233, "hadithNumber": "4681", "text": "It was narrated from Sammurah that the Messenger of Allah said: \"A man has more right to his own wealth when he finds it, and the buyer should pursue the one who sold it to him.\"", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated from Sammurah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4681", "inBookReference": "Book 44, Hadith 233"}, {"id": 234, "hadithNumber": "4682", "text": "It was narrated from Sammurah that the Messenger of Allah said: \"If a woman is married off by two guardians, then the first marriage is the one that counts, and if a man sells something to two men, it belongs to the first one.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from Sammurah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4682", "inBookReference": "Book 44, Hadith 234"}, {"id": 235, "hadithNumber": "4683", "text": "it was narrated from Isla'il bin Ibrahim bin 'Abdullah bin Abi Rabi'ah, from his father, that his grandfather said: \"The Prophet borrowed forty thousand from me, then some wealth came to him, and he paid me back and said: 'May Allah bless your family and your wealth for you: the reward for lending is praise and repayment.\"", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4683", "inBookReference": "Book 44, Hadith 235"}, {"id": 236, "hadithNumber": "4684", "text": "It was narrated that Muhammad bin Jahsh said: \"We were sitting with the Messenger of Allah when he raised his head toward the sky, and put his palm on his forehead, then he said: 'Subhan Allah, what a stern warning has been revealed! We fell silent and were scared. The following day I asked him: 'O Messenger of Allah, what is this stern warning that has been revealed? He said: 'By the One in Whose hand is my soul, if a man were to be killed in the cause of Allah then brought back  to life, then killed, but he owed a debt, he would not enter paradise until his debt was paid off,\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Muhammad bin Jahsh said:", "reference": "https://sunnah.com/nasai:4684", "inBookReference": "Book 44, Hadith 236"}, {"id": 237, "hadithNumber": "4685", "text": "It was narrated that samurah said: \"We were with the Prophet at a funeral, and he said: 'I there anyone from banu so and so here? He said this three times. Then a man stood up, and he said to him: 'What kept you form answering the first two times? I am not going to say anything but good to you, so and so (mentioning the name of a man from among them) has died and he is being detained (from entering Paradise) because of his debt.\"'", "grade": "Da'if (Darussalam)", "narratedBy": "It was narrated that samurah said:", "reference": "https://sunnah.com/nasai:4685", "inBookReference": "Book 44, Hadith 237"}, {"id": 238, "hadithNumber": "4686", "text": "It was narrated that 'Imran bin Hudaifah said: \"Maimunah used to take out loans frequently, and some of her family criticized her and denounced her for that. She said: 'I will not stop taking loans, for I heard my close friend and my beloved say: \"There is no one who takes out a loans, and Allah knows that he intends to pay it back, but Allah will pay it back for him in this world.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated that 'Imran bin Hudaifah said:", "reference": "https://sunnah.com/nasai:4686", "inBookReference": "Book 44, Hadith 238"}, {"id": 239, "hadithNumber": "4687", "text": "It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah that Maimunah, the wife of the Prophet, took a loan, and it was said to her: \"O Mother of the Believers, why have you taken a loan when you do not have the means to pay if off?\" She said: \"I heard the Messenger of Allah say: 'Whoever takes a loan intending to pay it back, Allah, the Mighty and Sublime, will help him.\"'", "grade": "Hasan (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4687", "inBookReference": "Book 44, Hadith 239"}, {"id": 240, "hadithNumber": "4688", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah said: 'If one of you is referred to a rich man (to help repay a debt), he should accept that referral, and (wrongdoing) is when a rich man takes a long time to repay a debt.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4688", "inBookReference": "Book 44, Hadith 240"}, {"id": 241, "hadithNumber": "4689", "text": "It was narrated from 'Amr bin Ash-Sharid, that his father said: \"The Messenger of Allah said: 'if one who can afford it delay repayment, his honor and punishment become permissible.\"'", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Amr bin Ash-Sharid, that his father said:", "reference": "https://sunnah.com/nasai:4689", "inBookReference": "Book 44, Hadith 241"}, {"id": 242, "hadithNumber": "4690", "text": "It was narrated from 'Amr bin Ash-Shrid, from his father that the Messenger of Allah said: \"If one who can afford it delays repayment, his honor and punishment become permissible.\"", "grade": "Hasan (Darussalam)", "narratedBy": "It was narrated from 'Amr bin Ash-Shrid, from his father that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4690", "inBookReference": "Book 44, Hadith 242"}, {"id": 243, "hadithNumber": "4691", "text": "It was narrated that Abu Hurairah said: \"The Messenger of Allah said: 'Wrongdoing is when a rich man takes a long time to repay a debt, and if one of you is referred to a rich man (to help repay debt), he should accept that referral.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Abu Hurairah said:", "reference": "https://sunnah.com/nasai:4691", "inBookReference": "Book 44, Hadith 243"}, {"id": 244, "hadithNumber": "4692", "text": "It was narrated from 'Abdullah bin Abi Qatadah, from his father, that a man from among the Ansar was brought to the prophet for him to offer the funeral prayer, and he said: \"Your companion owes a debt. \" Abu Qutdah said: \"I will guarantee it for him. \"The prophet said: \"In full?\" He said: \"In full.\" (Sahah)", "grade": null, "narratedBy": null, "reference": "https://sunnah.com/nasai:4692", "inBookReference": "Book 44, Hadith 244"}, {"id": 245, "hadithNumber": "4693", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"The best of you is the one who is best in repaying.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4693", "inBookReference": "Book 44, Hadith 245"}, {"id": 246, "hadithNumber": "4694", "text": "It was narrated from Abu Hurairah that the Messenger of Allah said: \"There was a man who never did any good deed, but he used to lend to people and he would say to this messenger: \"Take what can be paid easily and leave what is difficult, let them off, and perhaps Allah, the Mighty and Sublime, said to him: 'Did you ever do any good did? He said: No, but I had a slave and I used to lend to people. When I sent him to collect the debts I said to him: Take what can he paid easily and leave what is difficult; let them off, and perhaps Allah will let us off. Allah, the Most High, said: 'I have let you off.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Hurairah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4694", "inBookReference": "Book 44, Hadith 246"}, {"id": 247, "hadithNumber": "4695", "text": "Abu Hurairah said: The prophet said: \"A man used to lend to people, but if he realized that someone was going through hardship, he would say to his slave: 'Let him off, perhaps Allah, the Most High, will let us off.' And when he met Allah, He let him off.\"", "grade": "Sahih (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4695", "inBookReference": "Book 44, Hadith 247"}, {"id": 248, "hadithNumber": "4696", "text": "It was narrated that 'Uthman bin  'Affan said: \"The Messenger of Allah said: 'Allah, the Mighty and Sublime, admitted to paradise a man who was easygoing in buying and selling, in paying off debts and asking for repayment.\"' (Sahaih)", "grade": null, "narratedBy": "It was narrated that 'Uthman bin  'Affan said:", "reference": "https://sunnah.com/nasai:4696", "inBookReference": "Book 44, Hadith 248"}, {"id": 249, "hadithNumber": "4697", "text": "It was narratd that 'Abdullah said: \"Sa'd, 'Ammar and I entered into a partnership on the Day of Badr, (agreeing to share) whatever was allotted to us. 'Ammar and I did not get anything. But sa'd got two prisoners.\"", "grade": "Da'if (Darussalam)", "narratedBy": null, "reference": "https://sunnah.com/nasai:4697", "inBookReference": "Book 44, Hadith 249"}, {"id": 250, "hadithNumber": "4698", "text": "It was narrated from Salim, from his father, that the Messenger of Allah said: \"Whoever sets free his share of a slave should set him free completely from his own wealth, if he has enough wealth to cover the price of the slave.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Salim, from his father, that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4698", "inBookReference": "Book 44, Hadith 250"}, {"id": 251, "hadithNumber": "4699", "text": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah said: 'Whoever sets free his share of a slave, and he has sufficient wealth to set him free completely by paying the price of the slave, then he should set him free with his own wealth.\"'", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Ibn 'Umar said:", "reference": "https://sunnah.com/nasai:4699", "inBookReference": "Book 44, Hadith 251"}, {"id": 252, "hadithNumber": "4700", "text": "It was narrated from Jabir that the Prophet said: \"Any one of you who has land, or date palm trees, he should not sell them until he offers them to his partner first.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Jabir that the Prophet said:", "reference": "https://sunnah.com/nasai:4700", "inBookReference": "Book 44, Hadith 252"}, {"id": 253, "hadithNumber": "4701", "text": "It was narrated that Jabir said: \"The Messenger of Allah ruled that pre-emption is to be given in everything that is shared in which the division is not clear, whether it is a house or a garden. It is not permissible to sell it before informing one's partner, who may take it or leave it, as he wishes. He (the share-owner) sells it without informing him, and then he has more right to it.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4701", "inBookReference": "Book 44, Hadith 253"}, {"id": 254, "hadithNumber": "4702", "text": "It was narrated that Abu Rafi said: \"The Messenger of Allah said\" \"The neighbor has more right to property that is near.\"'", "grade": null, "narratedBy": "It was narrated that Abu Rafi said:", "reference": "https://sunnah.com/nasai:4702", "inBookReference": "Book 44, Hadith 254"}, {"id": 255, "hadithNumber": "4703", "text": "It was narrated from 'Amr Bin Ash-Sharid, from his father, that a man said: \"O Messenger of Allah, not one else has any share in my land, but there are neighbors.\" He said: \"The neighbor has more right to property that is near.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from 'Amr Bin Ash-Sharid, from his father, that a man said:", "reference": "https://sunnah.com/nasai:4703", "inBookReference": "Book 44, Hadith 255"}, {"id": 256, "hadithNumber": "4704", "text": "It was narrated from Abu Salamah that the Messenger of Allah said: \"Pre-emption takes effect in all cases where land has not been divided. But if the boundaries have been sent, and the roads lay out, then there is no pre-emption.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated from Abu Salamah that the Messenger of Allah said:", "reference": "https://sunnah.com/nasai:4704", "inBookReference": "Book 44, Hadith 256"}, {"id": 257, "hadithNumber": "4705", "text": "It was narrated that Jabir said: \"The Messenger of Allah decreed the principle of pre-emption, and the (rights of) neighbors.\"", "grade": "Sahih (Darussalam)", "narratedBy": "It was narrated that Jabir said:", "reference": "https://sunnah.com/nasai:4705", "inBookReference": "Book 44, Hadith 257"}]}