{"collection":"muslim","collectionName":"Sahih Muslim","book":35,"bookName":"The Book of Sacrifices","hadiths":[{"id":1,"hadithNumber":"1","text":"I was with Allah's Messenger (ﷺ) on the day of 'Id al-Adha. While he had not returned after having offered (the Id prayer) and finished it, he saw the flesh of the sacrificial animals which had been slaughtered before he had completed the prayer. Thereupon he (the Holy Prophet) said: One who slaughtered his sacrificial animal before his prayer or our prayer ('Id), he should slaughter another one in its stead, and he who did not slaughter, he should slaughter by reciting the name of Allah.","grade":null,"narratedBy":"Jundab b. Sufyan reported:"},{"id":2,"hadithNumber":"2","text":"I was with Allah's Messenger (ﷺ) (on the occasion) of 'Id al-Adha. After he had completed the prayer with people, he found that the goats had been slaughtered, whereupon he said: He who slaughtered sacrificial animal before the prayer should slaughter a goat (again) in its stead and he who has not slaughtered he should slaughter it by reciting the name of Allah.","grade":null,"narratedBy":"Jundab b. Sufyan reported:"},{"id":3,"hadithNumber":"3","text":"This hadith has been narrated on the authority of al-Aswad b. Qais with the same chain of transmitters.","grade":null,"narratedBy":null},{"id":4,"hadithNumber":"4","text":"I saw Allah's Messenger (ﷺ) observing ('Id) prayer on the Day of Sacrifice (10th of Dhu'l-Hijja) and then delivering a sermon and he said: He who sacrificed the (animal) before offering ('Id) prayer, he should offer again in its stead, and he who did not sacrifice the animal should slaughter it by reciting the name of Allah.","grade":null,"narratedBy":"Jundab al-Bajali reported:"},{"id":5,"hadithNumber":"5","text":"This hadith has been narrated on the authority of Shu'ba through another chain of transmitters.","grade":null,"narratedBy":null},{"id":6,"hadithNumber":"6","text":"My maternal uncle Abu Burda sacrificed his animal before ('Id) prayer. Thereupon Allah's Messenger (ﷺ) said: That is a goat (slaughtered for the sake of) flesh (and not as a sacrifice on the day of Adha). He said: I have a lamb of six months. Thereupon he said: Offer it as a sacrifice, but it will not justify for anyone except you, and then said: He who sacrificed (the animal) before ('Id) prayer, he in fact slaughtered it for his own self, and he who slaughtered after prayer, his ritual of sacrifice became complete and he in fact observed the religious practice of the Muslims.","grade":null,"narratedBy":"Al-Bara' reported:"},{"id":7,"hadithNumber":"7","text":"Apostle of Allah, it is the day of meat and it is not desirable (to have longing for it and not to make use of it immediately), so I hastened in offering my animal as a sacrifice, so that I might feed my family and neighbours and my kith and kin. Thereupon Allah's Messenger (ﷺ) said: Offer again your sacrifice. He said: Messenger of Allah, I have a small milch goat of less than one year, and that is better than two dry goats (from which only) meat (can be acquired). Thereupon he said: That is better than the two animals of sacrifice on your behalf, and the sacrifice of a goat, of less than six months shall not be accepted as a sacrifice on behalf of anyone after your (sacrifice).","grade":null,"narratedBy":"Al-Bara' b. 'Azib reported that his maternal'uncle Abu Burda b. Niyar sacrificed his animal earlier than the Prophet (ﷺ) had sacrificed. Thereupon he said:"},{"id":8,"hadithNumber":"8","text":"Allah's Messenger (ﷺ) delivered an address on the day (of Nahr) in which he said: None of you should offer sacrifice of animals until he has completed the ('Id) prayer. Thereupon my maternal uncle said: Messenger of Allah, it is the day of meat, so it is not desirable (to keep my family in the state of longing). The rest of the hadith is the same.","grade":null,"narratedBy":"Al-Bara' b. 'Azib reported:"},{"id":9,"hadithNumber":"9","text":"He who observes prayer like our prayer and turns his face towards our Qibla (in prayer) and who offers sacrifices (of animals) as we do, he must not slaughter the (animal as a sacrifice) until he has completed the prayer. Thereupon my maternal uncle said: Messenger of Allah, I have sacrificed the animal on behalf of my son. The Messenger of Allah (ﷺ) said: This is the thing in which you have made haste for your family. He said: I have a goat with me better than two goats. Thereupon he said: Sacrifice it for that is the best.","grade":null,"narratedBy":"Al-Bara' reported Allah's Messenger (ﷺ) having said:"},{"id":10,"hadithNumber":"10","text":"The first (act) with which we started our day (the day of 'Id-ul Adha) was that we offered prayer. We then returned and sacrificed the animals and he who did that in fact adhered to our Sunnah (practice). And he who slaughtered the (animal on that day before the 'Id prayer), for him (the slaughtering of animal was directed to the acquiring of) meat for his family, and there is nothing of the sort of sacrifice in it. It was Abu Burda b. Niyar who had slaughtered (the animal before the 'Id prayer). He said: I have a small lamb, of less than one year, but better than that of more than a year. Thereupon Allah's Messenger (ﷺ) qaid: Sacrifice it, but it will not suffice (as a sacrifice) for anyone after you.","grade":null,"narratedBy":"Al-Bara' b. 'Azib reported Allah's Messenger (ﷺ) having said:"},{"id":11,"hadithNumber":"11","text":"A hadith like this has been narrated on the authority of al-Bara' b. 'Azib through another chain of transmitters.","grade":null,"narratedBy":null},{"id":12,"hadithNumber":"12","text":"Allah's Messenger (ﷺ) addressed us on the day of Nahr after the ('Id) prayer. The rest of the hadith is the same.","grade":null,"narratedBy":"al-Bara' b. 'Azib reported:"},{"id":13,"hadithNumber":"13","text":"Allah's Messenger (ﷺ) addressed us on the day of Nahr and said: None should sacrifice the animal unless he has completed the ('Id) prayer. A person said: I have a milch goat of less than one year, better than two fat goats. Thereupon he said: Sacrifice it, and no goat of less than a year of age will be accepted as sacrifice after you.","grade":null,"narratedBy":"Al-Bara' b. 'Azib reported:"},{"id":14,"hadithNumber":"14","text":"Offer a substitute for it (since it does not absolve you of the responsibility of sacrifice). Thereupon he said: Allah's Messenger. I have nothing with me but a goat of less than six months. Shu'ba (one of the narrators) said: I think he (al-Bara' b. 'Azib also) said: And it is better than a goat of one year. Thereupon Allah's Messenger (ﷺ) said: Make it a substitute for that (and sacrifice it), but it will not suffice for anyone (as a sacrifice) after you.","grade":null,"narratedBy":"Al-Bara' b. 'Azib reported that Abu Burda slaughtered the animal as a sacrifice before the ('Id) prayer. Thereupon Allah's Apostle (ﷺ) said:"},{"id":15,"hadithNumber":"15","text":"This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but did not mention tht doubt (expressed in his statement) That is (the goat of less than a year) is better than a goat of more than one year.","grade":null,"narratedBy":null},{"id":16,"hadithNumber":"16","text":"He who slaughtered (the animal as a sacrifice) before the ('Id) prayer. should repeat it (i. e. offer another animal). Thereupon a person stood up and said: Messenger of Allah, that is the day when meat is much desired, and he also made a mention of the need of his neighbour, and perhaps Allah's Messenger (ﷺ) attested it. He (the person who had sacrificed the animal before the 'Id prayer) said: I have a goat of less than one year of age with me and I like it more than two fleshy goats; should I offer it as a sacrifice? He permitted him to do so. He (the narrator) said: I do not know whether this permission was granted to anyone else besides him or not. Allah's Messenger (ﷺ) then turned towards two rams. and he slaughtered them, and the people' came to the goats and got them distributed amongst themselves (for offering them as sacrifice).","grade":null,"narratedBy":"Anas (b. Malik) reported Allah's Messenger (ﷺ) having said on the day of Nahr (Sacrifice):"},{"id":17,"hadithNumber":"17","text":"He who slaughtered the animal before prayer should slaughter (another animal as a sacrifice). The rest of the hadith is the same.","grade":null,"narratedBy":"Anas b. Malik reported that Allah's Messenger (ﷺ) offered the 'Id prayer and then delivered the sermon giving the command:"},{"id":18,"hadithNumber":"18","text":"Allah's Messenger (ﷺ) addressed us on the day of 'Id al-Adha. He smelt the odour of flesh and he prohibited thern from slaughtering (the animals before the 'Id prayer), saying: He who slaughtered the animals (before the 'Id prayer) should do that again (as it is not valid as a sacrifice).","grade":null,"narratedBy":"Anas b. Malik reported:"},{"id":19,"hadithNumber":"19","text":"Sacrifice only a grown-up animal, unless it is difficult for you, in which case sacrifice a ram (of even less than a year, but more than six months' age).","grade":null,"narratedBy":"Jabir reported Allah's Messenger (ﷺ) as saying:"},{"id":20,"hadithNumber":"20","text":"Allah's Messenger (ﷺ) led us in the 'Id prayer in Medina on the Day of Sacrifice. Some persons slaughtered their animals ahead of him under the impression that Allah's Apostle (ﷺ) had-already offered sacrifice. Thereupon Allah's Apostle (ﷺ) said: Those who had slaughtered their animals ahead of him should slaughter the other ones in their stead. And they should not sacrifice the animal before Allah's Messenger (ﷺ) had sacrificed (his animal)","grade":null,"narratedBy":"Jabir b. 'Abdullah reported:"},{"id":21,"hadithNumber":"21","text":"You sacrifice it.","grade":null,"narratedBy":"Uqba b. 'Amir reported that Allah's Messenger (ﷺ) gave the gifts of goats to be distributed amongst his Companions. They sacrificed them, but a lamb of one year of age was left. (Someone) made a mention of that to the Messenger of Allah (ﷺ), whereupon he said:"},{"id":22,"hadithNumber":"22","text":"Allah's Messenger (ﷺ) distributed sacrificial animals (amongst us for sacrificing them on 'Id al-Adha). So we sacrificed them. There fell to my lot a lamb of less than one year I said: Allah's Messenger, there has fallen to my lot a lamb (Jadha'a), whereupon he said: Sacrifice that.","grade":null,"narratedBy":"Amir al-Juhani reported:"},{"id":23,"hadithNumber":"23","text":"This hadith has been transmitted on the authority of 'Uqba b. 'Amir al-Juhan with a slight change of wording.","grade":null,"narratedBy":null},{"id":24,"hadithNumber":"24","text":"Anas reported that Allah's Messenger (ﷺ) sacrificed with his own hands two horned rams which were white with black markings reciting the name of Allah and glorifying Him (saying Allah-o-Akbar). He placed his foot on their sides (while sacrificing).","grade":null,"narratedBy":null},{"id":25,"hadithNumber":"25","text":"I saw him sacrificing them with his own hand and saw him placing his foot on their sides, and recited the name of Allah and Glorified Him.","grade":null,"narratedBy":"Anas reported that Allah's Messenger (ﷺ) sacrificed two horned rams of white colour with black markings over them. He also stated:"},{"id":26,"hadithNumber":"26","text":"Qatada informed me that he had heard Anas saying that Allah's Messenger (may peace be npon him) sacrificed (the horned rams) and like that. I said: Did you (Qatada) hear from Anas? He said. Yes.","grade":null,"narratedBy":"Shu'ba reported:"},{"id":27,"hadithNumber":"27","text":"This hadith has been transmitted on the authority of Anas with a slight variation of wording.","grade":null,"narratedBy":null},{"id":28,"hadithNumber":"28","text":"Give me the large knife, and then said: Sharpen it on a stone. She did that. He then took it (the knife) and then the ram; he placed it on the ground and then sacrificed it, saying: Bismillah, Allah-humma Taqabbal min Muhammadin wa Al-i-Muhammadin, wa min Ummati Muhammadin (In the name of Allah,\" O Allah, accept  on behalf of Muhammad and the family of Muhammad and the Umma of Muhammad\" ).","grade":null,"narratedBy":"'A'isha reported that Allah's Messenger (ﷺ) commanded that a ram with black legs, black belly and black (circles) round the eyes should be brought to him, so that he should sacrifice it. He said to 'A'isha:"},{"id":29,"hadithNumber":"29","text":"Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger (ﷺ) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger (ﷺ) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that","grade":null,"narratedBy":"Rafi' b. Khadij is reported to have said:"},{"id":30,"hadithNumber":"30","text":"While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalised ten goats for a camel. The rest of the hadith is the same.","grade":null,"narratedBy":"Rafi' b. Khadij reported:"},{"id":31,"hadithNumber":"31","text":"Allah's Messenger, we are going to encounter the enemy tomorrow, but we do not have long knives with us, should we then slaughter them with the peel of the reed? The rest of the hadith is the same. (And at the end the words are):\" A camel became wild (and got out of our control). We attacked it with arrows until we made it fall down.\"","grade":null,"narratedBy":"Rafi' b. Khadij reported from his grandfather that he said:"},{"id":32,"hadithNumber":"32","text":"This hadith has been narrated on the authority of Sa'id b. Masruq with the same chain of transmitters with a slight variation of words.","grade":null,"narratedBy":null},{"id":33,"hadithNumber":"33","text":"Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this:\" The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), cammanded and these were turned over and the narrator narrated the whole event.","grade":null,"narratedBy":"Rafi' b. Khadij reported that he said:"},{"id":34,"hadithNumber":"34","text":"I was with 'Ali b. Abi Talib on the occasion of the 'Id day. He started with the 'Id prayer before delivering the sermon, and said: Allah's Messenger (ﷺ) forbade us to eat the flesh of our sacrificial animals beyond three days.","grade":null,"narratedBy":"Abu Ubaid reported:"},{"id":35,"hadithNumber":"35","text":"He led us in prayer before delivering the sermon and then addressed the people saying: Allah's Messenger (ﷺ) has forbidden you to eat the flesh of your sacrificial animals beyond three nights, so do not eat that.","grade":null,"narratedBy":"Abu 'Ubaid, the freed slave of Ibn Azhar, reported that he said 'Id (prayer) with Umar b. al-Khattab, and then said the 'Id (prayer) with 'Ali b. Abu Talib. He (the narrator further) reported:"},{"id":36,"hadithNumber":"36","text":"This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.","grade":null,"narratedBy":null},{"id":37,"hadithNumber":"37","text":"None of you should eat the flesh of his sacrificial animal beyond three days.","grade":null,"narratedBy":"Ibn 'Umar reported Allah's Apostle (ﷺ) having said:"},{"id":38,"hadithNumber":"38","text":"This hadith has been narrated on the authority of Ibn Umar through another chain of transmitters.","grade":null,"narratedBy":null},{"id":39,"hadithNumber":"39","text":"Ibn 'Umar did not eat the flesh of the sacrificial animals beyond three (days). Ibn Abu 'Umar said:\" Beyond three days.\"","grade":null,"narratedBy":"Ibn 'Umar reported that Allah's Messenger (ﷺ) forbade that the flesh of sacrificial animals be eaten beyond three (days) Salim (son of Ibn Umar) said:"},{"id":40,"hadithNumber":"40","text":"Allah's Messenger (ﷺ) forbade (people) to cat the flesh of sacrificed animals beyond three days. Abdullah b. Abu Bakr said, I made a mention of that to 'Amra, whereupon she said: He has told the truth, for I heard 'A'isha say: The poor among the people of the desert come (to the towns) on the occasion of Id al-Adha during the lifetime of Allah's Messenger (ﷺ). Upon this Allah's Messenger (ﷺ) said: Retain with you (the flesh) sufficing for three (days), and whatever is left out of that give in charity. After this. they (the Muslims) said: Allah's Messenger, the people make waterskins with the (hides) of their sacrificed animals and they melt fat out of them. Thereupon he said. What the then? They said: You forbade (us) to eat the flesh of sacrificial animals beyond threoq (days), whereupon he said: I forbade you for those (poor persons) who flocked (to the towns on this occasion for getting meat) but now when (this situation has improved) you may eat, preserve and give -in charity.","grade":null,"narratedBy":"Abdullah b. Waqid reported:"},{"id":41,"hadithNumber":"41","text":"Eat, make a provision, and keep it.","grade":null,"narratedBy":"Jabir reported that Allah's Apostle (ﷺ) forbade eating of the flesh of sacrificed animals beyond three (days). but afterwards said:"},{"id":42,"hadithNumber":"42","text":"We did not eat the flesh of our sacrificial animals beyond three days in Mina. Then Allah's Messenger (ﷺ) permitted us saying: Eat and make it a provision (for journey). I asked 'Ata' whether Jabir had also said: Till we came to Medina. He said: Yes.","grade":null,"narratedBy":"Jabir b. Abdullah reported:"},{"id":43,"hadithNumber":"43","text":"We did not eat the flesh of sacrificed animals beyond three (days), but then Allah's Messenger (ﷺ) commanded us to make it a provision for journey and cat it (beyond three days).","grade":null,"narratedBy":"Jabir b. 'Abdullah reported:"},{"id":44,"hadithNumber":"44","text":"We made provision (out of the flesh of sacrificed animals for our journey) to Medina during the lifetime of Allah's Messenger (ﷺ).","grade":null,"narratedBy":"Jabir reported:"},{"id":45,"hadithNumber":"45","text":"O people of Medina, do not eat the flesh of sacrificed animals beyond three days. Ibn al-Muthanni said: Three days. They (the Companions of the Holy Prophet) complained to the Messenger of Allah (may peace he upon him) that they had children and servants of theirs (to feed), whereupon he said: Eat, and feed others, and store, and make it a provision of food.","grade":null,"narratedBy":"Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) having said:"},{"id":46,"hadithNumber":"46","text":"He who sacrifices (animal) among you nothing should be left in his house (out of its flesh) on the morning of the third day. When it was the next year they (his Companions) said: Should we do this year as we did daring the previous year? Thereupon he said: Don't do that, for that was a year when the people were hard pressed (on account of poverty). so I wanted that the (flesh) might be distributed amongst them.","grade":null,"narratedBy":"Salama b. al-Akwa' reported Allah's Messenger (way peace be upon him) having said:"},{"id":47,"hadithNumber":"47","text":"Thauban, make his meat usable (for journey), and I continuously served him that until he arrived in Medina.","grade":null,"narratedBy":"Thauban reported that Allah's Messenger (way peace be upon him) slaughtered his sacrificial animal and then said:"},{"id":48,"hadithNumber":"48","text":"This hadith has been narrated on the authority of Mu'awiya b. Salih with the same chain of transmitters.","grade":null,"narratedBy":null},{"id":49,"hadithNumber":"49","text":"Allah's Messenger (ﷺ) said to me on the occasion of Hajjat-al-Wada' (the Farewell Pilgrimage): Make the flesh usable. So I made it usable (for him) and he ate it constantly until he reached Medina. This hadith has been narrated on the authority of Yabya b. Hamza with the same chain of transmitters, but he did not say: On the occasion of Hajjat-al-Wada'.","grade":null,"narratedBy":"Thauban, the freed slave of Allah's Messenger (ﷺ), reported:"},{"id":50,"hadithNumber":"50","text":"I prohibited you from visiting the graves, but (now) you may visit them, and I prohibited you (from eating) the flesh of sacrific- ed animals beyond three days, but now keep it as long as you like. I prohibited you from the use of Nabidh except (that preoared) in dry waterskins. Now drink (Nabidh prepared in any utensil), but do not drink when it becomes intoxicant.","grade":null,"narratedBy":"Abdullah b. Buraida reported on the authority of his father that Allah's Messenger (ﷺ) said this:"},{"id":51,"hadithNumber":"51","text":"I used to forbid you. The rest of the hadith is the same.","grade":null,"narratedBy":"Ibn Buraida, on the authority of his father, reported Allah's Messenger (ﷺ) having said this:"},{"id":52,"hadithNumber":"52","text":"(The sacrifice of Fara' and 'Atira) has no (sanction in Islam). Ibn Rafi' made this addition in his narration that Fara' means the first-born young one of a camel.","grade":null,"narratedBy":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:"},{"id":53,"hadithNumber":"53","text":"When any one of you intending to sacrifice the animal enters in the month (of Dhu'l-Hijja) he should not get his hair or nails touched (cut). It was said to Sufyan that some of the (scholars) did not deem this hadith to be Maffu'. He said: But I deem it as Marfu' (i. e. chain of narration traceable right up to the Holy Prophet).","grade":null,"narratedBy":"Umm Salama reported Allah's Messenger (ﷺ) having said this:"},{"id":54,"hadithNumber":"54","text":"If anyone of you intends to offer sacrifice he should not get his hair cut or nails trimmed.","grade":null,"narratedBy":"Umm Salama reported Allah's Apostle (ﷺ) as saying:"},{"id":55,"hadithNumber":"55","text":"If anyone has in his possession a sacrificial animal to offer as a sacrifice (on 'Id al-Adha), he should not get his hair cut and nails trimmed after he has entered the first days of Dhu'l Hijja","grade":null,"narratedBy":"Umm Salama reported (these words) directly from Allah's Messenger (ﷺ):"},{"id":56,"hadithNumber":"56","text":"This hadith has been narrated on the authority of 'Amr b. Muslim with the same chain of transmitters.","grade":null,"narratedBy":null},{"id":57,"hadithNumber":"57","text":"He who has a sacrificial animal with him whom (he intends) to offer as sacrifice, and he enters the month of Dhu'I-Hijja, he should not get his hair cut or nails trimmed until he has sacrificed the animal.","grade":null,"narratedBy":"Umm Salama, the wife of Allah's Apostle (ﷺ), reported Allah's Messenger (ﷺ) to have said:"},{"id":58,"hadithNumber":"58","text":"While we were in a bathroom just before 'Id al-Adha some of the persons tried to remove the hair with the help of hair-removing chemicals. Thereupon some of the people owning the bath (or some of the people sitting therein) said that Sa'id b. Musayyib did not approve of it, or he prohibited it. Then I met Sa'id b. Musayyib and made a mention of that to him, whereupon he said: O my nephew, this is the hadith which has been forgotten, and abandoned. Umm Salama, the wife of Allah's Apostle (ﷺ), narrated to me Allah's Messenger (ﷺ) having said as narrated above.","grade":null,"narratedBy":"'Amr b. Muslim b. 'Ammar al-Laithi reported:"},{"id":59,"hadithNumber":"59","text":"Amr b. Muslim al-Jundani reported that Ibn Musayyib had told him that it was Umm Salama, the wife of Allah's Apostle (ﷺ), who had informed him of that as narrated above.","grade":null,"narratedBy":null},{"id":60,"hadithNumber":"60","text":"I was in the company of 'Ali b. Abi Talib, when a person came to him, and said: What was it that Allah's Apostle (ﷺ) told you in secret? Thereupon he (liadrat 'All) was enraged and said: Allah's Apostle (ﷺ) did not tell me anything in secret that he hid from people, except that he told me four things. He said: Com- mader of Faithful, what are these? He said: Allah cursed him who cursed his father; Allah cursed him who sacrificed for anyone besides Allah; and Allah cursed him who accommodates an innovator (in religion) ; and Allah cursed him who changed the minarets (the boundary lines) of the land.","grade":null,"narratedBy":"Abu Tufail 'Amir b. Withila reported:"},{"id":61,"hadithNumber":"61","text":"We said to 'Ali b. Abi Talib: Inform us about something which Allah's Messenger (ﷺ) told you in secret, whereupon he said: He told me nothing in secret which he bid from people, but I heard him say: Allah cursed him who sacrificed for anyone besides Allah; and cursed him who accommodated an innovator; and Allah cursed him who cursed his parents and Allah cursed him who changed the boundary lines (of the land possessed by him).","grade":null,"narratedBy":"Abu Tufail reported:"},{"id":62,"hadithNumber":"62","text":"'Ali was asked whether Allah's Messenger (ﷺ) had showed special favour (by disclosing to him) a thing (which he kept secret from others). Thereupon he said: Allah's Messenger (ﷺ) singled us not for (disclosing to us) anything (secret) which he did not make public, (but those few things) which lie in the sheath of my sword. He drew out the written document contained in it and on that (it was mentioned): Allah cursed him who sacrificed for anyone else besides Allah; and Allah cursed him who stole the signposts (demarcating the boundary lines of the) land; and Allah cursed him who cursed his father; and Allah cursed him who accommodated an innovator (in religion).","grade":null,"narratedBy":"Abu Tufail reported:"}]}