{"verses":[{"verseKey":"68:1","text":"Nun. By the pen and what the scribes write"},{"verseKey":"68:2","text":"By your Lord's Grace, you are not afflicted with madness"},{"verseKey":"68:3","text":"and surely yours shall be a never-ending reward"},{"verseKey":"68:4","text":"and you are certainly on the most exalted standard of moral excellence"},{"verseKey":"68:5","text":"So you will soon see, and they too will see"},{"verseKey":"68:6","text":"which of you is afflicted with madness"},{"verseKey":"68:7","text":"Surely your Lord knows well those who have strayed from His Way just as He knows well those who are on the Right Way"},{"verseKey":"68:8","text":"Do not, then, yield to those who reject the Truth, decrying it as false"},{"verseKey":"68:9","text":"they would wish you to be pliant so that they too may be pliant"},{"verseKey":"68:10","text":"And do not yield to any contemptible swearer"},{"verseKey":"68:11","text":"the fault-finder who goes around slandering"},{"verseKey":"68:12","text":"the hinderer of good, the transgressor, the sinful"},{"verseKey":"68:13","text":"the coarse-grained, and above all mean and ignoble"},{"verseKey":"68:14","text":"(who so acts) simply because he has wealth and sons"},{"verseKey":"68:15","text":"and whenever Our verses are rehearsed to him, he says: “These are fairy- tales of times gone by.”"},{"verseKey":"68:16","text":"Soon shall We brand him on his snout"},{"verseKey":"68:17","text":"We have put them [i.e., the Makkans] to test even as We put to test the owners of the orchard when they vowed that they would gather the fruit of their orchard in the morning"},{"verseKey":"68:18","text":"without making any allowance (for the will of Allah)"},{"verseKey":"68:19","text":"Thereupon a calamity from your Lord passed over it while they were asleep"},{"verseKey":"68:20","text":"and so by morning the orchard lay as though it had been fully harvested"},{"verseKey":"68:21","text":"At daybreak they called out to one another"},{"verseKey":"68:22","text":"“Hurry to your orchard if you would gather its fruit.”"},{"verseKey":"68:23","text":"So off they went, whispering to one another"},{"verseKey":"68:24","text":"“No destitute person shall enter it today.”"},{"verseKey":"68:25","text":"They went forth early, believing that they had the power (to gather the fruit)"},{"verseKey":"68:26","text":"But as soon as they beheld the orchard, (they cried out): “We have certainly lost the way"},{"verseKey":"68:27","text":"rather, we are utterly ruined.”"},{"verseKey":"68:28","text":"The best among them said: “Did I not say to you: why do you not give glory to (your Lord)?”"},{"verseKey":"68:29","text":"They cried out: “Glory be to our Lord! Certainly we were sinners.”"},{"verseKey":"68:30","text":"Then they began to reproach one another"},{"verseKey":"68:31","text":"They said: “Woe to us! We had indeed transgressed"},{"verseKey":"68:32","text":"Maybe our Lord will give us a better orchard in its place; to our Lord do we penitently turn.”"},{"verseKey":"68:33","text":"Such is the chastisement; and the chastisement of the Hereafter is assuredly even greater, if only they knew"},{"verseKey":"68:34","text":"Surely the God-fearing shall have Gardens of bliss with their Lord"},{"verseKey":"68:35","text":"What! Shall We treat those who have submitted (to Our command) like those who have acted as criminals"},{"verseKey":"68:36","text":"What is the matter with you? How ill do you judge"},{"verseKey":"68:37","text":"Or do you have a Book wherein you read"},{"verseKey":"68:38","text":"that (in the Hereafter) you shall have all that you choose for yourselves"},{"verseKey":"68:39","text":"Or have We sworn a covenant with you which We are bound to keep till the Day of Resurrection, (a covenant requiring that whatever you ordain for yourselves shall be yours)"},{"verseKey":"68:40","text":"Ask them: “Which of them can guarantee that"},{"verseKey":"68:41","text":"Or has something been guaranteed by any of those whom they associate with Allah in His Divinity?” If so, let them bring forth their associates, if they are truthful"},{"verseKey":"68:42","text":"On the Day when the dreadful calamity will unfold, when people will be summoned to prostrate themselves, and yet they will not be able to prostrate"},{"verseKey":"68:43","text":"Their eyes shall be downcast and ignominy shall overwhelm them. For when they were safe and sound, they were summoned to prostrate themselves, (and they refused)"},{"verseKey":"68:44","text":"So leave Me, (O Prophet), to deal with him who gives the lie to this Discourse. We shall draw them little by little (to their undoing) in a way that they will not know"},{"verseKey":"68:45","text":"I am giving them a respite. Great is My scheme"},{"verseKey":"68:46","text":"Or are you asking them for some compensation so that they feel burdened with debt"},{"verseKey":"68:47","text":"Or do they have any knowledge of the Unseen which they are now writing down"},{"verseKey":"68:48","text":"So bear with patience until the Judgement of your Lord comes, and do not belike the man in the fish (i.e., Jonah) who called out, choking with grief"},{"verseKey":"68:49","text":"had his Lord not bestowed His favour upon him, he would have been cast upon that barren shore (and would have remained there) in disgrace"},{"verseKey":"68:50","text":"But his Lord exalted him, and included him among His righteous servants"},{"verseKey":"68:51","text":"When the unbelievers hear this Exhortation, they look at you as though they would knock you off your feet with their (hostile) glances. They say: “Surely he is afflicted with madness”"},{"verseKey":"68:52","text":"although this is nothing but an Exhortation (to goodness) for everyone in the world"}]}