{"verses":[{"verseKey":"78:1","text":"About what are they asking one another"},{"verseKey":"78:2","text":"Is it about the awesome tiding"},{"verseKey":"78:3","text":"that they are in utter disagreement"},{"verseKey":"78:4","text":"No indeed; soon will they come to know"},{"verseKey":"78:5","text":"again, no indeed; soon will they come to know"},{"verseKey":"78:6","text":"Have We not spread the earth like a bed"},{"verseKey":"78:7","text":"and fixed the mountains like pegs"},{"verseKey":"78:8","text":"and created you in pairs (as men and women)"},{"verseKey":"78:9","text":"and made your sleep a means of repose"},{"verseKey":"78:10","text":"and made the night a covering"},{"verseKey":"78:11","text":"and made the day to seek livelihood"},{"verseKey":"78:12","text":"and built above you seven strong firmaments"},{"verseKey":"78:13","text":"and placed therein a hot, shining lamp"},{"verseKey":"78:14","text":"and sent down abundant water from the clouds"},{"verseKey":"78:15","text":"so that We may thereby bring forth grain and vegetation"},{"verseKey":"78:16","text":"and gardens dense with foliage"},{"verseKey":"78:17","text":"Surely the Day of Judgement has an appointed time"},{"verseKey":"78:18","text":"the Day when the Trumpet shall be blown, and you will come forth in multitudes"},{"verseKey":"78:19","text":"and when the sky shall be opened up and will become all doors"},{"verseKey":"78:20","text":"and the mountains will be set in motion and become a mirage"},{"verseKey":"78:21","text":"Surely the Hell is an ambush"},{"verseKey":"78:22","text":"a resort for the rebellious"},{"verseKey":"78:23","text":"therein they shall abide for ages"},{"verseKey":"78:24","text":"they shall taste in it no coolness, nor any pleasant drink"},{"verseKey":"78:25","text":"save boiling water and wash of the wounds"},{"verseKey":"78:26","text":"a befitting recompense for their deeds"},{"verseKey":"78:27","text":"For indeed they did not look forward to any reckoning"},{"verseKey":"78:28","text":"and roundly denied Our Signs as false"},{"verseKey":"78:29","text":"And everything have We recorded in a Book"},{"verseKey":"78:30","text":"So taste (the fruit of your deeds). We shall only increase your torment"},{"verseKey":"78:31","text":"Surely the state of triumph awaits the God-fearing"},{"verseKey":"78:32","text":"gardens and vineyards"},{"verseKey":"78:33","text":"and youthful maidens of like age"},{"verseKey":"78:34","text":"and an overflowing cup"},{"verseKey":"78:35","text":"Therein they shall hear no idle talk, nor any falsehood"},{"verseKey":"78:36","text":"a recompense from your Lord and an ample reward"},{"verseKey":"78:37","text":"from the Lord of the heavens and the earth and of that which is between them; the Most Merciful Lord before Whom none dare utter a word"},{"verseKey":"78:38","text":"The Day when the Spirit and the angels are ranged row on row. None shall speak save he whom the Merciful Lord will permit; and he too will speak what is right"},{"verseKey":"78:39","text":"That Day is sure to come. So let him who will seek a resort with his Lord"},{"verseKey":"78:40","text":"Lo! We warn you of a chastisement near at hand; the Day when a man will look on what his own hands have sent forth, and the unbelievers shall say: “Oh would that I were utter dust.”"}]}